[{"quote":"“Carve your name on hearts, not tombstones. A legacy is etched into the minds of others and the stories they share about you.” ― Shannon Alder"},{"quote":"“Still, there are times I am bewildered by each mile I have traveled, each meal I have eaten, each person I have known, each room in which I have slept. As ordinary as it all appears, there are times when it is beyond my imagination.” ― Jhumpa Lahiri, Interpreter of Maladies"},{"quote":"“I’ve dreamed a lot. I’m tired now from dreaming but not tired of dreaming. No one tires of dreaming, because to dream is to forget, and forgetting does not weigh on us, it is a dreamless sleep throughout which we remain awake. In dreams I have achieved everything.” ― Fernando Pessoa, The Book of Disquiet"},{"quote":"“Success is not obtained overnight. It comes in installments; you get a little bit today, a little bit tomorrow until the whole package is given out. The day you procrastinate, you lose that day's success.” ― Israelmore Ayivor"},{"quote":"“It is extraordinarily entertaining to watch the historians of the past ... entangling themselves in what they were pleased to call the \"problem\" of Queen Elizabeth. They invented the most complicated and astonishing reasons both for her success as a sovereign and for her tortuous matrimonial policy. She was the tool of Burleigh, she was the tool of Leicester, she was the fool of Essex; she was diseased, she was deformed, she was a man in disguise. She was a mystery, and must have some extraordinary solution. Only recently has it occrurred to a few enlightened people that the solution might be quite simple after all. She might be one of the rare people were born into the right job and put that job first.” ― Dorothy L. Sayers, Are Women Human? Penetrating, Sensible and Witty Essays on the Role of Women in Society"},{"quote":"“While the astronauts, heroes forever, spent mere hours on the moon, I have remained in this new world for nearly thirty years. I know that my achievement is quite ordinary. I am not the only man to seek his fortune far from home, and certainly I am not the first. Still, there are times I am bewildered by each mile I have traveled, each meal I have eaten, each person I have known, each room in which I have slept. As ordinary as it all appears, there are times when it is beyond my imagination.\" (from \"The Third and Final Continent\")” ― Jhumpa Lahiri, Interpreter Of Maladies"},{"quote":"“The most important thing is this: to sacrifice what you are now for what you can become tomorrow.” ― Shannon Alder"},{"quote":"“Nearly' only counts in horseshoes and hand-grenades.” ― Neil Gaiman, The Graveyard Book"},{"quote":"“How to win in life:1 work hard 2 complain less 3 listen more 4 try, learn, grow5 don't let people tell you it cant be done6 make no excuses” ― Germany Kent"},{"quote":"“The most critical time in any battle is not when I’m fatigued, it’s when I no longer care.” ― Craig D. Lounsbrough"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“Remember how far you’ve come, and you won’t have to rely on a destiny for your future. It will come on your own.” ― Shannon A. Thompson, Seconds Before Sunrise"},{"quote":"“Success in life is not for those who run fast, but for those who keep running and always on the move.” ― Bangambiki Habyarimana, Pearls Of Eternity"},{"quote":"“Opportunity doesn't make appointments, you have to be ready when it arrives.” ― Tim Fargo"},{"quote":"“It is one of the unexpected disasters of the modern age that our new unparalleled access to information has come at the price of our capacity to concentrate on anything much. The deep, immersive thinking which produced many of civilization's most important achievements has come under unprecedented assault. We are almost never far from a machine that guarantees us a mesmerizing and libidinous escape from reality. The feelings and thoughts which we have omitted to experience while looking at our screens are left to find their revenge in involuntary twitches and our ever-decreasing ability to fall asleep when we should.” ― Alain de Botton, Religion for Atheists: A Non-Believer's Guide to the Uses of Religion"},{"quote":"“As for my own part I care not for death, for all men are mortal; and though I be a woman yet I have as good a courage answerable to my place as ever my father had. I am your anointed Queen. I will never be by violence constrained to do anything. I thank God I am indeed endowed with such qualities that if I were turned out of the realm in my petticoat I were able to live in any place in Christendom.” ― Elizabeth I, Collected Works"},{"quote":"“Act as if it was, and it will be.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Remember your customers appreciate efficiency and convenience and those two become achievable through innovation and willingness to change with time.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“It seems, in fact, that the more advanced a society is, the greater will be its interest in ruined things, for it will see in them a redemptively sobering reminder of the fragility of its own achievements. Ruins pose a direct challenge to our concern with power and rank, with bustle and fame. They puncture the inflated folly of our exhaustive and frenetic pursuit of wealth.” ― Alain de Botton, The Pleasures and Sorrows of Work"},{"quote":"“Our progress, the realization of our dreams, and the quality of our life depend directly on the level of our commitment to the process.” ― Dr Prem Jagyasi"},{"quote":"“The number of ways to live in one lifetime is limitless. So why limit yourself?” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“Resistance is a powerful motivator precisely because it enables us to fulfill our longing to achieve our goals while letting us boldly recognize and name the obstacles to those achievements.” ― Derrick Bell"},{"quote":"“If you work without being distracted, you can do so much in one hour. Something that is not even achievable in a month, especially if you are not living with a Procrasdemon – a blood curdling time-wasting machine.” ― Neeraj Agnihotri, Procrasdemon - The Artist's Guide to Liberation from Procrastination"},{"quote":"“I'm happy for all who reached for the stars happily and successfully.” ― Ana Monnar"},{"quote":"“What makes the prospect of death distinctive in the modern age is the background of permanent technological and sociological revolution against which it is set, and which serves to strip us of any possible faith in the permanence of our labours. Our ancestors could believe that their achievements had a chance of bearing up against the flow of events. We know time to be a hurricane. Our buildings, our sense of style, our ideas, all of these will soon enough be anachronisms, and the machines in which we now take inordinate pride will seem no less bathetic than Yorick's skull.” ― Alain de Botton, The Pleasures and Sorrows of Work"},{"quote":"“My dear, here is lesson number one for using opportunity; waste no time on false humility. Tell the world about your achievements don't wait for someone else to do it.” ― Kate Alcott, The Dressmaker"},{"quote":"“Everything that we enjoy is a result of someone's hard work. Some work is visible and other work goes unseen, but both are equally important. Some people stop working as soon as they find a job. Regardless of the unemployment statistics, it is hard to find good people to work. Many people don't understand the difference between idle time and leisure time. Idle time amounts to wasting or stealing time; leisure time is earned. Procrastinating amounts to not working. Excellence is not luck; it is the result of a lot of hard work and practice. Hard work and practice make a person better at whatever he is doing.” ― Shiv Khera, You Can Win : A Step by Step Tool for Top Achievers"},{"quote":"“Focus your efforts on adding value rather than on promoting your achievements.” ― Frank Sonnenberg, Listen to Your Conscience: That's Why You Have One"},{"quote":"“Unity is the intentional inclination to corporately control our destination. In other words, achieving the dream takes a team!” ― Dewayne Owens, How to Get Rich on Purpose: Secrets to Prosperity and Controlling Your Destiny"},{"quote":"“Be as successful as a Smith.” ― Gregory C Dugger"},{"quote":"“What'll Geoffrey do when you pull off your First, my child?\" demanded Miss Haydock.\"Well, Eve -- it will be awkward if I do that. Poor lamb! I shall have to make him believe I only did it by looking fragile and pathetic at the viva.” ― Dorothy L. Sayers, Gaudy Night"},{"quote":"“The Anasazi did manage to construct in stone the largest and tallest buildings erected in North America until the Chicago steel girder skyscrapers of the 1880s.” ― Jared Diamond, Collapse: How Societies Choose to Fail or Succeed"},{"quote":"“Just because you've achieved your dreams, doesn't mean you'll always be happy” ― Hwang Bo-Reum, Welcome to the Hyunam-Dong Bookshop"},{"quote":"“Achievements has no value, if you leave behind the people to celebrate with” ― Invajy"},{"quote":"“I know everything feels a bit hopeless right now, but don't lose faith. Your greatest achievements often grow out of the worst circumstances.” ― Amita Parikh, The Circus Train"},{"quote":"“Win once, then repeat.” ― Aegelis"},{"quote":"“The things that hadn't happened, the honors not bestowed, had never bothered me earlier in my career, when time felt like a field without a visible horizon--but now that dark line had appeared in the distance and the story I had always told myself about my own limitless prospects was breaking down; not yet was starting to feel more like not ever.” ― Laura van den Berg, I Hold a Wolf by the Ears: Stories"},{"quote":"“This is the problem with greatness: it is a summit from which all paths lead downwards, and one cannot stay atop it forever. At least the depths of Hell had Heaven above them, a goal, as difficult as it might seem.” ― Nathan H. Green, My Late Life"},{"quote":"“Dear Daughter, Learn to celebrate your achievements. No one can do it better than you can.” ― Gift Gugu Mona, Dear Daughter: Short and Sweet Messages for a Queen"},{"quote":"“What you ‘have’ accomplished is the exact stuff that you use to accomplish what you haven’t, rather than making the ‘haven’t’ the focus of your accomplishments.” ― Craig D. Lounsbrough"},{"quote":"“Root for your friend's achievements, milestones, and victories, no matter the size!” ― Jason Langella"},{"quote":"“Every great achievement was a vision before it became a reality. In that sense, it arose from commitment, not resignation to the inevitable.” ― Henry Kissinger, On China"},{"quote":"“Humility is the jewel in the crown of achievements.” ― Vikrmn: CA Vikram Verma, Rep By Rep"},{"quote":"“Well, let’s see … my life. Put simply, I could not get into battle fast enough, and my father couldn’t die soon. The two greatest moments of my life so far are when I received my first Iron Cross and the death of my father.” ― Josh Becker, Hitler in the Madhouse"},{"quote":"“If you take up something, then try to be the best in it.” ― Avijeet Das"},{"quote":"“Our looks don't matter, what matters is our achievements in life.” ― Avijeet Das"},{"quote":"“The socialist planning system had a number of important achievements to its credit. It introduced mass production into Soviet industry. It greatly increased the output of a number of key industrial sectors, such as oil and steel. It produced the huge number of weapons necessary to emerge victorious from World War II. It provided full employment. It produced the world’s first earth satellite. It invested heavily in human capital. Its educational system (except in the social sciences) was good by international standards, and produced large numbers of qualified people. During the 1950s the USSR enjoyed a golden age with growth rates much in excess of those in the USA or UK. However, socialist planning also had a number of problems. These included: shortages of consumer goods; inability to take full advantage of the world market for goods, capital and people; slow home-grown technical progress; and living standards that lagged behind those in capitalist countries. In addition, the high growth rates of the 1950s gradually declined.” ― Michael Ellman, Socialist Planning"},{"quote":"“The mountains of achievement are quality discovered in one direction only, and are relatively meaningless and often unobtainable unless taken together with the ocean trenches of self awareness - so different from self consciousness - which result from inner peace of mind.” ― Robet M. Pirsig"},{"quote":"“The mountains of achievement are quality discovered in one direction only, and are relatively meaningless and often unobtainable unless taken together with the ocean trenches of self awareness... so different from self-consciousness... which result from inner peace of mind.” ― Robert M. Pirsig, Zen And The Art Of Motorcycle Maintenance and Siddhartha 2 Books Collection Set"},{"quote":"“Distractions mimic achievements.” ― Craig D. Lounsbrough"},{"quote":"“But wherever you rode on your conquests, you left a pile of corpses as high as any mountain. Do your achievements outweigh your sins?” ― Jin Yong, A Heart Divided"},{"quote":"“If you want to achieve your goals you have to consume your strength because the power of your surrounding will scattered you.” ― Kamaran Ihsan Salih"},{"quote":"“Rather than counting the stars we haven't reached, let's celebrate the constellations we've already created.” ― Monika Ajay Kaul"},{"quote":"“God's plan and timing are the best to achieve life purpose and create who you want to be. Don't doubt your journey to yourself creation. Self motivation, patience, persistence and perseverance with faith will take you to your dreamland.” ― Adeleke Aishat - Tashia"},{"quote":"“Have faith in your self-creation path and celebrate your little victories in becoming the person you want to be. You have what it takes to be great.” ― Adeleke Aishat- Tashia"},{"quote":"“Embark on your self-creation journey with the mindset that the universe is secretly watching. Go above and beyond being intentional with your journey process to make a global mark and impact.” ― Adeleke Aishat - Tashia"},{"quote":"“The secret to realizing your maximum potential and creating who you want to be is having an attitude of gratitude. Be thankful for the person you have become, the lessons you have learned, and the progress you have achieved.” ― Adeleke Aishat - Tashia"},{"quote":"“Chase your dreams until you catch them, when you do, celebrate those achievements and cherish the moments.” ― Gift Gugu Mona, Exploring the Explosive Power of Big Dreams"},{"quote":"“Always surround yourself with people who care about you as a person, because those are the ones who will encourage you to attain success. They will support you when you need a helping hand. They will encourage you when you need improvement. They will advise you when you need guidance, and they will celebrate with you for your achievements.” ― Gift Gugu Mona, The Kind of Substance You Need For Your Success"},{"quote":"“If you want to conquer the beliefs that hinder your achievements, you would want to maintain the habit of challenging your thoughts on a regular basis.” ― Thomas Lu, The Personal Sustainability Handbook: 60+ Practices to Sustainabilize Your Health, Finances, Relationships and Beyond"},{"quote":"“Not just the organizational structure but the management style can also affect your business goals of success and growth.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“A society punishing a boy for stealing because he is otherwise unable to feed himself, would be hypocritical if not also blaming the instrument for not being tuned.” ― Monaristw"},{"quote":"“Look in your bill box, do you see someone else’s name? When you do; then you can worry about what that person thinks.” ― Ron Baratono"},{"quote":"“Great products and brands are results of continuous improvement and dedication of those coworkers, who think beyond money as a motive but purpose. One who is truly an inspiration and genius.” ― Ankit Samrat"},{"quote":"“Most ambitions are either achieved or abandoned; either way, they belong to the past. The future, instead of the ladder toward the goals of life, flattens out into a perpetual present. Money, status, all the vanities the preacher Ecclesiastes described hold so little interest: a chasing after wind, indeed.” ― Paul Kalanithi, When Breath Becomes Air"},{"quote":"“The risk in reaching for great things is that they might elude our grasp. But have we considered that the ‘reaching’ might in fact have been the great thing?” ― Craig D. Lounsbrough"},{"quote":"“Who would you be if you'd then devoted the impossible time and effort to actually achieving your absolute full potential?” ― Ezra Claytan Daniels, Upgrade Soul"},{"quote":"“You don’t need to be an overachiever, you just need to be a quality achiever.” ― Drue Grit"},{"quote":"“Education is achieved externally.Enlightenment is achieved from the inside.” ― Zhizhi Meshach"},{"quote":"“Discouragement has never caused me to give up. But once I’ve had my fill of it, it always causes me to step up.” ― Craig D. Lounsbrough"},{"quote":"“Dreams must be bigger than the chances of achieving them” ― Aniket S. Sharma, CHAKRAVYUH - Through the Eyes of the Young Warrior"},{"quote":"“It is the aversion to fear that kills the greatest of dreams. And until the aversion to the death of our dreams outpaces the fears that kill them, what we could achieve will only be a dream.” ― Craig D. Lounsbrough"},{"quote":"“Achievement without the privilege to achieve means that we can be thankful for the former when it happens, but we need to be thankful that the latter allowed it to happen.” ― Craig D. Lounsbrough"},{"quote":"“I think that life never have to measure in physical achievements, but how you have spent your every second of life is important? in any situation.” ― Pranita P Deshpande, Quotations & Stories: Thoughts"},{"quote":"“Achievement is 60 percent determination, 40 percent action” ― Abhijit Naskar, Martyr Meets World: To Solve The Hard Problem of Inhumanity"},{"quote":"“The story of who you were will be told by the things that you accomplished. However, the greater story will be told by what you refused to accomplish.” ― Craig D. Lounsbrough"},{"quote":"“There is no great success and outstanding achievement on earth without the input of friendship.” ― John Arthur"},{"quote":"“What most enlightened people consider as wealth has nothing to do with money. Seeking true wealth may mean seeking deeper relationships, more personal growth, or ways to create more meaning in life. Achieving true wealth means possessing the ability to enjoy the small, ordinary pleasures of life.” ― Dr. Lucas D. Shallua, Average to Abundant: How Ordinary People Build Sustainable Wealth and Enjoy the Process"},{"quote":"“To forgo every achievement that would demand the sacrifice of our character is by far one of the greatest achievements of all.” ― Craig D. Lounsbrough"},{"quote":"“Your definition of purpose is the starting point of all measured achievements.” ― Tony Warrick"},{"quote":"“The higher the goal, the higher the possibility of significant achievement. We rarely hit a perfect mark on our goals, which is why it is important to aim high.” ― Sebastien Richard, Lead Like a Superhero: What Pop Culture Icons Can Teach Us About Impactful Leadership"},{"quote":"“I would suggest that many of our perceived defeats are actually God saving us from the things that would have defeated us had we actually achieved them.” ― Craig D. Lounsbrough"},{"quote":"“Our tomorrows pile up faster than we can keep track of them. And rather than attempt to keep track of each one, I would rather focus on what I made of each one.” ― Craig D. Lounsbrough"},{"quote":"“In order to peak one must reach higher than expected” ― Michael S. McKinney"},{"quote":"“It's humbling to recognise just how many great achievements have been the result not of superior talent or technical know-how, but merely of that strange buoyancy of the soul we call confidence. And this sense of confidence is ultimately nothing more than an internalised version of the confidence other people once had in us.” ― The School of Life, A Job to Love"},{"quote":"“Don’t fear what other people can do. Fear most what you could have done, but didn’t.” ― Craig D. Lounsbrough"},{"quote":"“Own your mistakes to own your achievements.” ― Steven Magee"},{"quote":"“I am proud of my mistakes because they led to my achievements.” ― Steven Magee"},{"quote":"“Carole Lombard made me believe that anything is possible if I just put my mind to it.” ― Laika Constantino"},{"quote":"“If they ain't talking about you, you aren't successful.” ― Wrushank Sorte"},{"quote":"“Good thing there was nothing that motivated me more than hearing that I couldn’t do something” ― Maurene Goo, I Believe in a Thing Called Love"},{"quote":"“All great achievements are born of anomalies.” ― Abhijit Naskar, The Gospel of Technology"},{"quote":"“With God, the setbacks of today are the precise ingredients that He needs to craft the victories of tomorrow.” ― Craig D. Lounsbrough"},{"quote":"“Without deadlines, nothing get done.” ― Lailah Gifty Akita"},{"quote":"“If we stand for nothing we will likely become nothing and subsequently achieve nothing, for nothing can only breed more of itself.” ― Craig D. Lounsbrough, The Eighth Page: A Christmas Journey"},{"quote":"“A success and happiness principle that all animals except humans know - you can achieve wonders by loving what you do” ― Dr Prem Jagyasi"},{"quote":"“I have great respect for the achievements of Elon Musk, but in some areas I do acknowledge his incompetence.” ― Steven Magee"},{"quote":"“Are you going to judge a person's character by the mistakes they made on a few bad dates or by their achievements?” ― Steven Magee"},{"quote":"“Some would say—don’t strive for what cannot be achieved. But how do you know what can be achieved without trying?Nor is it correct to say—Be happy with what you’ve got.But should happiness depend on inferiority?No, to my way of thinking expectations should align with ability. Therefore if one increases the ability to achieve higher goals by determination and perseverance, higher achievements will be the norm. © 2020, Daniel Kemp All rights reserved.” ― Daniel Kemp"},{"quote":"“. Much as an organization is unlikely to invest millions of dollars in a product that has a small chance of serving many customers, you don’t want to devote thousands of hours of your learning and development time to an area for which there is little demand from your employer or community.This is one of the critiques of the “follow your passion” advice — that it presumes you are at the center of the world, and pursuing your own joy (not service of others) is the objective. I have found that those who leave a lasting mark on the world, in contrast, are always asking what they can give.Exploring specific actions to take, starting with this question, allows you to continually redirect your talents to what's needed most in the social circles close to you.” ― Tom Rath, Life's Great Question: Discover How You Contribute To The World"},{"quote":"“Always be slightly to deep for your feet,And never intending to stay.For it's a real shame,When extraordinary brains,Are used in an ordinary way.” ― Daniel Thompson"},{"quote":"“We are in an era of overachievers where nothing is ever enough.” ― Maira Cheeda"},{"quote":"“But without consciously setting goals and markers for achievement, we are left feeling lost and without any value.” ― Amr Okasha"},{"quote":"“You have to do all what you can, you never know what you are going to hear and where it is going to lead you.. Let’s do our best; it ignites my faith, at least, we are not just sitting in a corner waiting for a miracle, we ask the miracle to happen instead.” ― Noha Alaa El-Din, Norina Luciano"},{"quote":"“Dreams? Ah, reality spoils the perfection of all beautiful dreams, so the dream can find a place in real life, you know how? By being dyed by the colour of reality, its pain and its bitterness. In other words, life will squash you so that you give up on your dreams and surrender to your needs.. And the decision is completely yours.\" \"No, I shan't give up on my dream.\" \"Then, challenge life! Know the rules, play by rules.” ― Noha Alaa El-Din, Norina Luciano"},{"quote":"“What is life but an attempt to let our immortal self defeat our mortality?” ― Noha Alaa El-Din, Norina Luciano"},{"quote":"“I will work hard and harder as my luck is not on good terms with me. I will replace it so simply.” ― Noha Alaa El-Din, Norina Luciano"},{"quote":"“Don’t limit yourself based only on what you see in front of you today. You have the potential to turn it around.” ― Germany Kent"},{"quote":"“Ones a Goal is reached all the hard work don't seems so hard but worth it. Then, we can laugh of pass struggles” ― Maria Boria"},{"quote":"“There is no satisfaction like the joy of work, well done.” ― Lailah Gifty Akita"},{"quote":"“Always take time to celebrate achievements whether great or small” ― Charmaine J. Forde"},{"quote":"“The real hero expects no repayment; a hero doesn't mention his achievements, nor does he keep reminding people of the favours he did for them. The hero never surrenders.” ― Noha Alaa El-Din, It's Hard to Please Vandanya: The Suitcase"},{"quote":"“I am aware of two of ‘America’s Greatest Achievements’ that were lemons.” ― Steven Magee"},{"quote":"“Some of my achievements were born out of an insane mind.” ― Steven Magee"},{"quote":"“We need positive energy in everything in life, at home, at school, at work, and everywhere. Positive energy spreads happiness, makes our duties less hard, and helps us achieve more.In the face of life challenges and hardships, we need positive energy to keep going, and we need people with positive energy to help those around them stand on their feet and overcome their difficulties.” ― Noora Ahmed Alsuwaidi"},{"quote":"“…of any achievements open to you, the one that makes all others possible is the creation of your own character.” ― Ayn Rand, Atlas Shrugged"},{"quote":"“You can achieve the unachievable!For this to happen you must begin by aiming beyond what you are capable of. You become rich and powerful by wanting to be rich and powerful.Without having a goal it is difficult to score!” ― Abhishek Ratna, small wins BIG SUCCESS: A handbook for exemplary success in post Covid19 Outbreak Era"},{"quote":"“There is no success without a solid foundation of failures.” ― Lailah Gifty Akita"},{"quote":"“Grow bigger that your fears and your feet will do wonders.” ― Abhijit Naskar, Rowdy Buddha: The First Sapiens"},{"quote":"“Colour of balloon never decides the height it will attain” ― Tanay Makin"},{"quote":"“When you love your work, you will be exceptionally diligent in what you do and you will excel in delivering both quality and quantity.” ― Dr Prem Jagyasi"},{"quote":"“I had rather die in the adventure of noble achievements, than live in obscure and sluggish security.” ― Margaret Cavendish, The Blazing World"},{"quote":"“The ice had been retreating. Humanity had sprung back swiftly, expanded, fought its small wars, re-industrialized, tripping constantly over reminders of what the species had previously achieved.” ― Adrian Tchaikovsky, Children of Time"},{"quote":"“Does John Green have a Hollywood Star?A John Green does but he is not me. He was a composer who won five Academy Awards for scoring such movies as An American in Paris and West Side Story. Although today he is mostly forgotten which is a nice reminder that no matter what you do the tides of time will wash away your sandcastles. So there's no sense in reaching for some foolhardy notion of immortality when there is real work to be done with real people, right now.” ― John Green"},{"quote":"“What will you be known for after your death? What will the world say about you? The world only celebrates those who maximize their potentials to create and leave legacies behind for future generations to come. These ones, though they die, continue to live in the hearts of those they impacted. They live on because of their principles, their products, their inventions, and their achievements. One generation after another testify to the legacy that such men have left behind.” ― CLEMENT OGEDEGBE, YOUR POTENTIALS - THE SOURCE OF YOUR GREATNESS: ….Secrets to unleashing your full potentials and achieving greater heights in life."},{"quote":"“Any accomplishment rests far more in determination than ability, for determination is the greatest ability of all.” ― Craig D. Lounsbrough"},{"quote":"“To understand the heart and mind of a person, look not at what they have already achieved, but at what they aspire to achieve” ― Kahlil Gibran"},{"quote":"“Don't seek to become better than any other man, be just and be good.For God measures not individuals achievements nor goals,God will judge you by your heart, so everything you do,DO IT IN a hearty manner” ― Bradley B. Dalina"},{"quote":"“The leader’s joy is the success of change, the evidence of progress and the actualization of a better life.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Every single day you are able to convert is a day you have conquered” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“We can be thankful for what we’ve achieved, but I think it’s far, far more powerful to be thankful that we have the opportunity to achieve.” ― Craig D. Lounsbrough"},{"quote":"“A book is read one page at a time. A shelf is read one book at a time. A library is read one shelf at a time.” ― Terry Goodkind, Siege of Stone"},{"quote":"“To understand this new frontier, I will have to try to master one of the most difficult and counterintuitive theories ever recorded in the annals of science: quantum physics. Listen to those who have spent their lives immersed in this world and you will have a sense of the challenge we face. After making his groundbreaking discoveries in quantum physics, Werner Heisenberg recalled, \"I repeated to myself again and again the question: Can nature possibly be so absurd as it seemed to us in these atomic experiments?\" Einstein declared after one discovery, \"If it is correct it signifies the end of science.\" Schrödinger was so shocked by the implications of what he'd cooked up that he admitted, \"I do not like it and I am sorry I had anything to do with it.\" Nevertheless, quantum physics is now one of the most powerful and well-tested pieces of science on the books. Nothing has come close to pushing it off its pedestal as one of the great scientific achievements of the last century. So there is nothing to do but to dive headfirst into this uncertain world. Feynman has some good advice for me as I embark on my quest: \"I am going to tell you what nature behaves like. If you will simply admit that maybe she does behave like this, you will find her a delightful, entrancing thing. Do not keep saying to yourself, if you can possibly avoid it, 'But how can it be like that?' because you will get 'down the drain,' into a blind alley from which nobody has yet escaped. Nobody knows how it can be like that.” ― Marcus du Sautoy, The Great Unknown: Seven Journeys to the Frontiers of Science"},{"quote":"“None of our achievement matters, than how we have lived our lives.” ― Lailah Gfty Akita"},{"quote":"“Life is just full of disordered pieces of unachieved plans without solitude.” ― Sunday Adelaja, How To Become Great Through Time Conversion: Are you wasting time, spending time or investing time?"},{"quote":"“Every man wants to be appreciated, so do not just commend your secretary, commend your wife at home tooThe world judges people by money and status in the society, educational achievements, even racial background, this is unfortunate.” ― Sunday Adelaja, Create Your Own Net Worth"},{"quote":"“Mark it. The success of people may excite you. But the challenges they went through to achieve it will annoy you.” ― Israelmore Ayivor, Let's go to the Next Level"},{"quote":"“Success is sacrifice.” ― Lailah Gifty Akita"},{"quote":"“Leverage Everything” ― GE Paulus"},{"quote":"“For you to achieve and attain the results that ordinary people cannot attain, you must have the understanding that ordinary people don’t have” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“Godliness makes a man great.” ― Lailah Gifty Akita"},{"quote":"“People, who already have enough to eat, rest on their achievements and sometimes stop working hard” ― Sunday Adelaja, The Danger Of Monoculturalism In The XXI Century"},{"quote":"“In both generations, the black had a higher level of results on achievements in education, wage level, and employment” ― Sunday Adelaja, The Danger Of Monoculturalism In The XXI Century"},{"quote":"“True greatness does not arise from the achievements in my life. Rather, it is born out of an appreciation for my life.” ― Craig D. Lounsbrough"},{"quote":"“After she'd finished a doctorate in naturaopathic medicine in Arizona, she'd told me, she got a master's in acupuncture. While she was living in Durham, practicing at an alternative medicine cener, she lectured at Duke University School of Medicine and the University of North Carolina's School of Medicine. During this same time, I had some pants hemmed, as my younger siser liked to say, in response to the dazzling achievements of others.” ― Emily Nunn, The Comfort Food Diaries: My Quest for the Perfect Dish to Mend a Broken Heart"},{"quote":"“The brain was made to grow and it grows by solving problems and seeking out higher values and setting goals to achieve those ideals.” ― Saidi Mdala, Know What Matters"},{"quote":"“It is not the ultimate achievement that makes you extraordinary; it is what you become on the way to that achievement that people celebrate. This is what fills 295 pages of your 300 page (auto)biography!” ― Saidi Mdala, Know What Matters"},{"quote":"“If I only go as far as I can take myself, I’m not all that certain that I’ve gone much of anywhere at all. But once I dared to look outside of myself, I realized that God hands out unlimited passes to the anywhere of everywhere.” ― Craig D. Lounsbrough"},{"quote":"“When people understand that their achievements only depend on themselves and how much they struggle to reach them and not that another comes and makes them the miracle, to feel in debt to the devil, then, only then, will be able to think about the welfare common and not on the staff. Only then we wil overcome the social crisis in which we live!” ― Jasmina Alexander"},{"quote":"“In life we try to challenge ourselves for achievements. Sometimes we achieve it, others we fail. This year, I’m out to earn new achievements” ― Dean Mackin"},{"quote":"“An entrepreneur is a man who knows he can fail, but he does not accept to fail before he actually fails, and when he fails he learns from his errors and moves on.” ― Bangambiki Habyarimana, Pearls Of Eternity"},{"quote":"“Magic always happens when you direct your inner powers to the object you want to change.” ― Bangambiki Habyarimana, Pearls Of Eternity"},{"quote":"“The greatest purpose in life, the greatest achievement one could ever have in life, the greatest satisfaction one could ever get in life can only be found in the service of others.” ― Omoakhuana Anthonia"},{"quote":"“Did you know you could destroy dragons? Dragons are not actually real, they just roar to scare you away from your goals. In fact they are afraid of determined heroes, they take flight at their approach” ― Bangambiki Habyarimana, Pearls Of Eternity"},{"quote":"“If you wish to learn from the theoretical physicist anything about the methods which he uses, I would give you the following piece of advice: Don't listen to his words, examine his achievements. For to the discoverer in that field, the constructions of his imagination appear so necessary and so natural that he is apt to treat them not as the creations of his thoughts but as given realities.” ― Albert Einstein"},{"quote":"“All my life, I have taken satisfaction in finishing things in order that I may experience a sense of achievement, regardless of whether the thing was really worth achieving. ... Death, I suspect, will likely be unsatisfying because I will no longer be present to feel the achievement thereof.” ― Kathleen Rooney, Lillian Boxfish Takes a Walk"},{"quote":"“The real flight of this hawk is impending.Still,this bird is yet to be tested for real.Though I have leaped over the seas,well,the entire sky is still remaining to fly.And make sure that ,i am gonna do it with all my heart and all my soul.#loveyoourlife #liveyourlife #hvFUN” ― Arunima Sinha, Born Again on the Mountain: a story of losing everything and finding it back"},{"quote":"“One key quality of all global achievers is that, they keep improving day after day. They set standards that they keep surpassing year after year.” ― Israelmore Ayivor, Become a Better You"},{"quote":"“The truth is, when you have little to do, you do very little. But when you have much to do, you do much. So it should make sense that by taking on more than you can handle, you accomplish more than you ever dreamed you could. And so it is.” ― Richelle E. Goodrich, Slaying Dragons: Quotes, Poetry, & a Few Short Stories for Every Day of the Year"},{"quote":"“In our frenzied attempts to catch up with life, we run right past it. Once we have run past it, what we are in reality attempting to catch is ourselves.” ― Craig D. Lounsbrough"},{"quote":"“Any dream that I am absolutely confident I can achieve should immediately be discarded for the simple reason that it is simply too small.” ― Craig D. Lounsbrough"},{"quote":"“People who achieve marvelously in critical challenges are commended than people who achieve same things on the silver platter.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“When you believe it, you've created it, whatever it is” ― Bangambiki Habyarimana, Pearls Of Eternity"},{"quote":"“Every time someone starts a project he is considered nuts, until he beats all the odds and laughs the last.” ― Bangambiki Habyarimana, Pearls Of Eternity"},{"quote":"“The greatest gains that we will ever experience arise from the greatest sacrifices that we have ever known.” ― Craig D. Lounsbrough"},{"quote":"“the measure of achievements in life are directly related to the acquire knowledge, not to the social recognition.” ― Jaime Tenorio Valenzuela"},{"quote":"“Be happy, not contented.” ― Biju Paulose"},{"quote":"“when we work together, we achieve more. Character is not a concept that is simply spoken about, but actually manifests itself through our actions.” ― Jose A. Aviles, Peer Mentorship in High School: A Comprehensive Guide to Implementing a Successful Peer Mentorship Program in Your School"},{"quote":"“Regardless of all what you have done or the treasures you have acquired on earth, what counts before God is what you have invested in the Kingdom of God” ― Sunday Adelaja"},{"quote":"“It is not speed that matters, it's persistence.” ― Abhijit Naskar, The Film Testament"},{"quote":"“My worth is not based on the ‘work of my hands’ despite how feverishly I might work and how audaciously successful I might be. Rather, my worth is based exclusively on the astonishing fact that I am the ‘work of God’s hands.” ― Craig D. Lounsbrough"},{"quote":"“When you are happy with your achievements, you don’t curse people and circumstances that were not favorable... You feel superior that despite of the adversities, you won, you achieved, and you conquered.” ― Girdhar Joshi, Some Mistakes Have No Pardon"},{"quote":"“We live in a reputation economy. People are judged based on their online visible choices, behaviours, accomplishments and mistakes. Every comment you leave, person you connect to, photo you upload, or review you get, contributes to the permanent record of your online reputation.” ― Maarten Schäfer, Around The World in 80 Brands"},{"quote":"“One great concern that plagues very ambitious people is this: in the end, they’ll get all the precious things they ever dreamed of and every precious accomplishment most expected and conceived they’d achieve . . . but on that path of ambition, they’d lose precious moments with the most precious people they’ve come across. However, they forge ahead on that path hoping, somehow, they might make up for it, sometime, in future.” ― Ufuoma Apoki"},{"quote":"“If you don’t have the faith in principles and you don’t believe in the absolutism of the truth then you won’t be able achieve anything in life.” ― Sunday Adelaja"},{"quote":"“We need to practice for 10000 hours” ― Sunday Adelaja"},{"quote":"“To become a better you, don’t dream of becoming a superior over other people. Dream of becoming a superior over your previous achievements.” ― Israelmore Ayivor, Become a Better You"},{"quote":"“All great achievements are attained through mighty obstacles.” ― Abhijit Naskar, We Are All Black: A Treatise on Racism"},{"quote":"“To have the wisdom is rarely achieved by seeking the knowledge.” ― Will Advise"},{"quote":"“The height of your success will be measured with reference to the depth from which you started.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“But the most wonderful thing of all, our highest achievement and the one thing for which I pray we will always be remembered, is stuffing wads of polyester into an anatomically incorrect, cartoonish ideal of one of nature's most fearsome predators for no other reason than to soothe a child.” ― Rick Yancey, The Last Star"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“I intend to achieve my goals during my lifetime, but if I fail, I will not rest even in the afterlife” ― Bangambiki Habyarimana, The Great Pearl of Wisdom"},{"quote":"“...awkward passion is so often so very much more admirable than mere achievement.” ― Brian Doyle, The Plover"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“Celebrate your achievements, but never let them sink you into the pool of complacency.” ― Israelmore Ayivor, 101 Keys To Everyday Passion"},{"quote":"“I think that in our earlier history--the Gettysburg Address or something--there was the conscious sense that democracy was an achievement. It was not simply the most efficient modern system or something. It was something that people collectively made and they understood that they held it together by valuing it.” ― Marilynne Robinson"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“Faith gives you confidence, strength and hope; vital for any accomplishment” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“So many wants distract man from his divine purpose.” ― Lailah Gifty Akita"},{"quote":"“What is the recipe for successful achievement? To my mind there are just four essential ingredients: Choose a career you love, give it the best there is in you, seize your opportunities, and be a member of the team.” ― Benjamin F. Fairless"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"},{"quote":"“Leaders spend time reviewing their mistakes rather than having fantasies over their achievements! They look for every way to do the undone!” ― Israelmore Ayivor"},{"quote":"“True leaders spend time reviewing their mistakes rather than having fantasies over their achievements! They look for every way to do the undone!” ― israelmore ayivor, Leaders' Ladder"},{"quote":"“Almost everything a leader fails to achieve is anything he fails to try. What is not attempted is what is difficult to do.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Every great leader once fell down from a tall ladder. You don't become a star until you get the scar. Take that risk now.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Every flower blossoms in its sacred time.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Achievements take leaders' name everywhere. Character keeps those names wherever they reach. A leader with no trust soon fades no matter how far he goes.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Secret of success is found on your regular actions” ― Zamreen Zarook"},{"quote":"“Success is no mystery, but simply the result of consistently applying some basic principles. The reverse is just as true: Failure is simply a result of making a few mistakes repeatedly. All of this might sound too simplistic, but the fact is that most truths are very simple. I'm not saying they are easy, but they certainly are simple.” ― Shiv Khera, You Can Win : A Step by Step Tool for Top Achievers"},{"quote":"“Progress is hard, achievements are easy, and giving up is easier still.” ― Kevin Focke"},{"quote":"“Success is not a distant dream,it is a reality for those who sweat to achieve it,enjoy sleepless nights, take calculative steps through the day,and with self introspection keeps it humble with a smile.Then success gets loud with the achiever's mouth shut,while the world celebrates one's victory.” ― Henrietta Newton Martin"},{"quote":"“The ledger of my life can lean heavy with a prolific array of stellar investments, yet in the tallying I would be wise to remember that an investment that is not of God will leave a zero balance on the ledger of my life no matter how many different ways I try to add it up.” ― Craig D. Lounsbrough"},{"quote":"“In my opinion, at least, the splendid achievements of Alexander are the clearest possible proof that neither strength of body, nor noble blood, nor success in war even greater than Alexander's own... that none of these things, I say, can make a man happy, unless he can win one more victory in addition to those the world thinks so great---the victory over himself.” ― Arrian"},{"quote":"“Are we not all books waiting for someone to pick us up and read the pages that people missed?” ― Shannon L. Alder"},{"quote":"“You are responsible for who you become... Love yourself, Like your speed; Leave your scars; Live your skills!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“If you can accomplish any great task being absorbed in it and that too without any expectations, believe me, that one act of yours will make you a \"historical person\".” ― Deep Trivedi, The Pulse of Wisdom"},{"quote":"“Many people, who should have been rejoicing for what they've achieved, are rather regretting just because of one reason; they looked at what someone else was doing. Comparison eliminates contentment and then kills inner joy!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“You must passionately pursue all your dreams.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“If you can't reach your dreams,If you can't achieve your goals,If you can't meet your plans,Least be happy each daySuccess is not an annual achievement,It's a daily achievement.” ― Bradley B. Dalina"},{"quote":"“Your inability to do what you are noted for doing is a critical step to wading off your past glories of excellence!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“We call this a sweet life; to have your impact solutes dissolved in the life of people giving them a solution to their life problems... You can imagine how tasty that could be!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Belief is the essential ingredient for success, thus if you believe, you can achieve, for real you will achieve.” ― Oscar Auliq-Ice"},{"quote":"“If you do not achieve your God-given goals, it does not mean God has not given the power. It rather means you have taken His power for granted!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“Leaders do not die with their music on their tongues unsung. They provide services that make them unleash their God-given potentials!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“People will know you for who you are, but will remember you for what you have done. True leaders make long lasting impacts!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“Great answers are found in tough questions. Never give up because of how hard the seed it; it’s a proof that it carries sweeter fruits!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Dive deep and make your discovery.” ― Fennel Hudson, Wild Carp: Fennel's Journal No. 4"},{"quote":"“All forms of achievements are all a triumph of discipline.” ― Sunday Adelaja"},{"quote":"“To achieve in life is A hard story, But that shouldn’t scare you.” ― Oscar Auliq-Ice"},{"quote":"“When you succeed in life, You cannot be sure till you reach at the point you expect.” ― Oscar Auliq-Ice"},{"quote":"“Understand that great accomplishments require great effort. If a goal is achieved without effort, it is no accomplishment but a mere happening.” ― Richelle E. Goodrich, Slaying Dragons: Quotes, Poetry, & a Few Short Stories for Every Day of the Year"},{"quote":"“Hope gives us reasons to live and pursue our dreams, expecting greater possibilities.” ― Ellen J. Barrier, How to Trust God When All Other Resources Have Failed"},{"quote":"“The difference between a successful and an unsuccessful person is that, one has preserved his potentials while the other has processed his own!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Plan strategically and strike it once to win. You can achieve maximum dues with minimum dice if only you are willing to clearly calculate and throw your efforts with optimism!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Set a goal when you’re ready for it, make a plan, and stick with it.” ― Oscar Auliq-Ice"},{"quote":"“You cannot be accountable with the products of someone else's mind; no man is known for a skillful hunting by the number of bush meats gathered by another man!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“All life`s achievements proceed from the Author of life.” ― Sunday Adelaja"},{"quote":"“I remember all of it, not because I meditate on it. No. I remember it because with each step I make toward my goals, I am reminded of how they said I couldn't do it. The more I achieve, the more they are proved wrong, in my mind. It's like motivation. Attacks on your dreams are never forgotten because they become your fuel.” ― Innocent Mwatsikesimbe, The Reason"},{"quote":"“Everyone has to start somewhere. So get out there and start.” ― Oscar Auliq-Ice"},{"quote":"“To achieve in life is A hard story, you're starting to get the picture. It's hard work, and this is just the beginning.” ― Oscar Auliq-Ice"},{"quote":"“Divine purpose, divine fulfilment.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“If you strive towards significant achievements, count on great difficultieson the way to realization.” ― Eraldo Banovac"},{"quote":"“Listen to people from your heart, as if your life depended on it, and you will find that in turn people will listen to you with all of theirs.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“Take the challenge of your life.Reach out to your goals.There is no limit to what you can achieve.” ― Lailah Gifty Akita"},{"quote":"“The choices you make from this day forward will lead you, step by step, to the future you deserve.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“For me, exploration was a personal venture. I did not go to the Arabian desert to collect plants nor to make a map; such things were incidental. At heart I knew that to write or even to talk of my travels was to tarnish the achievement. I went there to find peace in the hardship of desert travel and the company of desert peoples. I set myself a goal on these journeys, and, although the goal itself was unimportant, its attainment had to be worth every effort and sacrifice... No, it is not the goal but the way there that matters, and the harder the way the more worth while the journey.” ― Wilfred Thesiger"},{"quote":"“I was so sure that I knew what they needed and what I wanted to sell them that I never stopped long enough to find out what it was they wanted to buy.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“Spend your time designing the greatest reputation a man could possess.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“It's amazing how people can find all the mistakes in the world concerning another person, but look into the mirror every day without making changes within. Stop looking down your nose at others, What does that achieve? We all can make room for improvements. Most of the time it starts with a little attitude adjustment.” ― Amaka Imani Nkosazana, Sweet Destiny"},{"quote":"“You may be tempted to regret being born when you are made to watch the videos of just what you will go through to achieve your dreams... But you are highly likely to wish you can live and live again and again if the size of your purposeful achievements is shown to you! Live on!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“We must humble ourselves before [others] so we may learn from what others have lived. It is only when we have added their expertise to our own that we can truly excel towards our most ambitious goals and reach our fullest potential.” ― A.J. Darkholme, Rise of the Morningstar"},{"quote":"“What you deserve will be down to you, and you alone.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“The higher you climb, the more Satan will take notice. Keep climbing! Heaven's gate has a lock.” ― Shannon L. Alder"},{"quote":"“Everything would have been for nothing just because I simply didn’t listen.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“I should become happier at what I do and leave others happier than before they’d met me.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“Finding happiness by delivering it.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“Destiny and fate are of one’s own making, and riches and happiness are rarely found at the end of an easily-traversed path.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“On his thirteenth birthday he had seen a film in which the central character was a painter who, unable to sell his work, grew cold and hungry as he went from one unsuccessful interview to the next; eventually he had become a vagrant, sleeping in the streets of the city where once he had walked in hope. Hawksmoor left the cinema in a mood of profound, terrified apprehension and, from that time, he was filled with a sense of time passing and with the fear that he might be left discarded on its banks. The fear had not left him, although now he could no longer remember from where it came: he looked back on his earlier life without curiosity, since it seemed to lack intrinsic interest, and when he looked forward he saw the same steady attainment of goals without any joy in their attainment. For him, the state of happiness was simply the state of not suffering and, if he cared for anything, it was for oblivion.” ― Peter Ackroyd, Hawksmoor"},{"quote":"“The challenges I have faced—among them material poverty, chronic illness, and being raised by a single mother—are not uncommon, but neither have they kept me from uncommon achievements.” ― Sonia Sotomayor, My Beloved World"},{"quote":"“Pride is a very dangerous disease that can turn your talent, asset, and achievements into a handicap.” ― Uzoma Nnadi"},{"quote":"“He praised his own achievements, not without cause but without end.” ― Seneca the Younger"},{"quote":"“Your achievements die with you.Your deeds live on as your legacy!” ― Manoj Vaz"},{"quote":"“The more optimistic you can be the more resilient you will be to whatever challenges life throws at you.” ― Oscar Auliq-Ice"},{"quote":"“Life isn't about just having dreams, it's all about transforming them into reality.” ― M.H. Rakib , The Cavalier"},{"quote":"“Conceive, believe and achieve.” ― Lailah Gifty Akita, The Alphabets of Success: Passion Driven Life"},{"quote":"“Our human inventions astound, our technological advancements are staggering,and we have amassed great wealthbut, it is only through Love that hearts are transformed, respect is fostered, and lasting peace achieved...” ― Kate Mullane Robertson"},{"quote":"“You are likely the greatest obstacle to achieving your own dreams.” ― Bryant McGill, Simple Reminders: Inspiration for Living Your Best Life"},{"quote":"“The ability to forgive is one of man's greatest achievements.” ― Bryant McGill, Simple Reminders: Inspiration for Living Your Best Life"},{"quote":"“Do not postpone your happiness to \"achievement\" of goals. It is not worth postponing your happiness, even for a moment...Learn to \"be happy\" first, and then go about achieving your goals...” ― Manoj Arora, Happiness Unlimited: How to be happy always"},{"quote":"“If s/he is intimidated by your achievements so far, s/he shouldn't be in your future because s/he cannot handle what is coming...” ― Assegid Habtewold, The 9 Cardinal Building Blocks: For continued success in leadership"},{"quote":"“Your track record, and great achievements may prompt people to invest their resources such as time and money, not their heart.” ― Assegid Habtewold, The 9 Cardinal Building Blocks: For continued success in leadership"},{"quote":"“Talents are seeds of greatness. With big dreams well dispensed in form of achievements, you can pick money from people’s pockets and they will never get the guts to call you a thief.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Don't let yourself stagnate or reach a plateau. Keep learning, keep improving. Be open to change. Your ability to constantly raise the bar higher and set standards will help you evolve and take you to the next level.” ― Roopleen"},{"quote":"“True friends are placed together for the purpose of accomplishing great achievements that help others.” ― Ellen J. Barrier"},{"quote":"“Pride is nothing more than false courage without long term solutions.” ― Shannon L. Alder"},{"quote":"“Development of Western science is based on two great achievements: the invention of the formal logical system (in Euclidean geometry) by the Greek philosophers, and the discovery of the possibility to find out causal relationships by systematic experiment (during the Renaissance). In my opinion, one has not to be astonished that the Chinese sages have not made these steps. The astonishing thing is that these discoveries were made at all.” ― Albert Einstein"},{"quote":"“Whilst people have answered questions, I have only heard my own voice thinking of the next question.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“The recurrence of a phenomenon like [Thomas] Edison is not very likely. The profound change of conditions and the ever increasing necessity of theoretical training would seem to make it impossible. He will occupy a unique and exalted position in the history of his native land, which might well be proud of his great genius and undying achievements in the interest of humanity.” ― Nikola Tesla"},{"quote":"“If this conviction had not been a strongly emotional one and if those searching for knowledge had not been inspired by Spinoza's Amor Dei Intellectualis, they would hardly have been capable of that untiring devotion which alone enables man to attain his greatest achievements.” ― Albert Einstein, Ideas and Opinions"},{"quote":"“Goals doesn't leave you like men, goals wait, they wait for their achievers.” ― Amit Kalantri"},{"quote":"“Most men have professions, yet few act like professionals.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“Don't drive a car in the dream, else you won't drive it on earth. Don't wish to become, else you won't become. Don't associate with fools, else your ancestors will be insulted. Don't be addicted to wine, else your pocket will be empty. Don't be drunk, else you'll be attacked.” ― Michael Bassey Johnson"},{"quote":"“The height of your achievements is determined by the depth of your self-belief, the strength of your resolve and the intensity of your efforts.” ― Roopleen"},{"quote":"“If there is one thing I know, it's that with every great achievement in our lives, there is an insecure idiot hiding around the corner waiting to take a baseball bat to it.” ― Dan Pearce, Single Dad Laughing: The Best of Year One"},{"quote":"“Speaking from the heart is simple. Listening wholeheartedly, however, is much, much more difficult and most rare.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“Success is like sausage, you'd be surprised what goes into it.” ― Tim Fargo"},{"quote":"“Desires and wishes don’t lead to success. Plans and efforts do. Create a vision, chalk out an action plan, put in your best efforts and give yourself a headstart in achieving your dreams.” ― Roopleen"},{"quote":"“If you woke before dawn one morning with the formula for a vaccine, which would cure the most ghastly disease currently known to man, releasing millions from an agonising death, would you roll over and resume sleeping until daylight?” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“In this world of half-jobs and liars, I will prevail.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“I have discovered fallen trees across my path and have possessed neither the strength to move them nor the patience or tenacity to find an alternative way round. I have simply returned to where I came from, and told myself there had been no other choice.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“People are only proud of your achievements and success not your struggles.” ― M.F. Moonzajer"},{"quote":"“An accumulation of pennies is a fortune. Day-to-day practice is perfection. A dream realized is nothing more than many steps taken toward the borders of once-impossible.” ― Richelle E. Goodrich, Making Wishes: Quotes, Thoughts, & a Little Poetry for Every Day of the Year"},{"quote":"“If every book was judged by its cover, very few would be read; education would be limited, and fewer movies would be made.” ― Ellen J. Barrier, The Price We Must Pay for Our Father's Sins"},{"quote":"“The only time you have is the where and when of right now. There will always be good times, bad times, hard times, and complete disasters. However, there is no other option but to be where you are, when you are. That is a universal truth for everyone. The important thing is how you respond, what you decide to do, and when you decide to do it.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“You’ve got to be driven to become successful.” ― Chris Murray, The Extremely Successful Salesman's Club"},{"quote":"“A little here and a little there will always accumulate, so why be surprised when steady, small steps take you to great places?” ― Richelle E. Goodrich, Making Wishes: Quotes, Thoughts, & a Little Poetry for Every Day of the Year"},{"quote":"“Put love in everything you do and you’ll find joy, happiness and success.” ― Dee Dee Artner"},{"quote":"“I am perhaps more proud of having helped to redeem the character of the cave-man than of any other single achievement of mine in the field of anthropology.” ― Henry Fairfield Osborn"},{"quote":"“If you achieve a success not achieved by anyone else and not possible to achieve by anyone else then you are the hero of your generation.” ― Amit Kalantri"},{"quote":"“In regards to climbing the ladder of success, there is a better future, with a greater purpose. One can find it, only if he or she searches for it.” ― Ellen J. Barrier"},{"quote":"“A person does not have to be religious to reach the top of the Ladder of Success; but every one that step onto the Ladder of Success, must have hope.” ― Ellen J. Barrier, How to Trust God When All Other Resources Have Failed"},{"quote":"“Who you are should not be defined by your achievements.” ― Bill Courtney, Against the Grain: A Coach's Wisdom on Character, Faith, Family, and Love"},{"quote":"“We are tempted to believe that certain achievements and possessions will give us enduring satisfaction. We are invited to imagine ourselves scaling the steep cliff face of happiness in order to reach a wide, high plateau on which we will live out the rest of our lives; we are not reminded that soon after gaining the summit, we will be called down again into fresh lowlands of anxiety and desire.” ― Alain de Botton, Status Anxiety"},{"quote":"“Other people his age had houses and washing machines, cars and television sets, furniture and gardens and mountain bikes and lawnmowers: he had four boxes of crap, and a set of matchless memories.” ― Robert Galbraith, The Cuckoo's Calling"},{"quote":"“Try not to be a man or woman of success, but rather a man or woman of inspiration. If you’re successful, they will flock to you for money or fame, but if you’re inspirational, they will flock to you because they love your soul and how you change theirs.” ― Shannon L. Alder"},{"quote":"“Believers are achievers, therefore believe and achieve!• Believe that you are responsible for your own accomplishments God deposited in you!• Believe that success is not luck; it is the result a deliberate effort to do a hard work!• Believe that prayer works through faith and action!• Believe that great people took great steps. Weak people took weak steps!• Believe that you can do all things through Christ who strengthens you!” ― Israelmore Ayivor"},{"quote":"“I think when you begin to think of yourself as having achieved something, then there's nothing left for you to work towards. I want to believe that there is a mountain so high that I will spend my entire life striving to reach the top of it.” ― Cicely Tyson"},{"quote":"“That I always had space to run and that I had the opportunity to play with my imagination. I also loved that my mum drew and painted with me. I always remember that my parents loved me, and that is essential when you're a kid; they always showed me how proud they were of my achievements. It's also very important when parents put their kids' drawings on the refrigerator.” ― Taylor Swift"},{"quote":"“You can't be creative without criticism. If your life is without critics then maybe you are painting your life's masterpiece with only a broken brown crayon.” ― Shannon L. Alder"},{"quote":"“Believe it; 25 years from now or less, you will be voted for or appointed by the actions you are taking today! Guess what the vote will mean. Will it be an election for you to occupy the edifice of failure or to be the administrator in the kingdom of success? Rise up and optimize your potentials!” ― Israelmore Ayivor"},{"quote":"“When the mind becomes so completely absorbed in perfect health that all sickness is forgotten, all the powers of mind will proceed to create health, and every trace of sickness will soon disappear. When the mind becomes so completely absorbed in higher attainments and in greater achievements that all thought of failure is forgotten, all the forces of mind will begin to work for the promotion of those attainments and achievements. The person will be gaining ground every day, and greater success will positively follow.” ― Christian D. Larson"},{"quote":"“Multiply your potentials with your plans and it will be equal to your purpose of existence. Your potentials are your seeds of greatness.” ― Israelmore Ayivor"},{"quote":"“ما قد يبدو لك خسارة قد يكون هو بالتحديد الشيء الذي سبصبح فيما بعد مسؤولا عن إتمام أعظم إنجازات حياتك” ― أحلام مستغانمي - الأسود يليق بك"},{"quote":"“A plan is the transport medium which conveys a person from the station of dreams to the destination of success. Goals are the transport fees.” ― Israelmore Ayivor"},{"quote":"“Many great ideas, great love stories, and great achievements are born from a healthy irrationality.” ― Steve Maraboli, Unapologetically You: Reflections on Life and the Human Experience"},{"quote":"“We are what we know and what we are good at. Whenever what we know and what we are good at increase, our position increases and our goals are achieved ” ― د.عبدالكريم بكّار"},{"quote":"“Books open and broaden our minds allowing us to challenge ourselves to become more than we are, by setting positive goals for ourselves, and overcoming doubts about our ability to receive the education we want to achieve.” ― Ellen J. Barrier"},{"quote":"“It was very quiet at the hotel, as if there had been a death in the family. When you have quit the Tour, nobody really knows what to say or do. (...) Everything I'd previously achieved meant nothing; all I was now was a pro rider who couldn't finish the Tour de France.” ― David Millar, Racing Through the Dark"}]
