[{"quote":"“If you owe your bank a hundred pounds, you have a problem. But if you owe a million, it has.” ― John Maynard Keynes"},{"quote":"“He tried to read an elementary economics text; it bored him past endurance, it was like listening to somebody interminably recounting a long and stupid dream. He could not force himself to understand how banks functioned and so forth, because all the operations of capitalism were as meaningless to him as the rites of a primitive religion, as barbaric, as elaborate, and as unnecessary. In a human sacrifice to deity there might be at least a mistaken and terrible beauty; in the rites of the moneychangers, where greed, laziness, and envy were assumed to move all men's acts, even the terrible became banal.” ― Ursula K. Le Guin, The Dispossessed: An Ambiguous Utopia"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“Pick a leader who will keep jobs in your country by offering companies incentives to hire only within their borders, not one who allows corporations to outsource jobs for cheaper labor when there is a national employment crisis. Choose a leader who will invest in building bridges, not walls. Books, not weapons. Morality, not corruption. Intellectualism and wisdom, not ignorance. Stability, not fear and terror. Peace, not chaos. Love, not hate. Convergence, not segregation. Tolerance, not discrimination. Fairness, not hypocrisy. Substance, not superficiality. Character, not immaturity. Transparency, not secrecy. Justice, not lawlessness. Environmental improvement and preservation, not destruction. Truth, not lies.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“In fact this is precisely the logic on which the Bank of England—the first successful modern central bank—was originally founded. In 1694, a consortium of English bankers made a loan of £1,200,000 to the king. In return they received a royal monopoly on the issuance of banknotes. What this meant in practice was they had the right to advance IOUs for a portion of the money the king now owed them to any inhabitant of the kingdom willing to borrow from them, or willing to deposit their own money in the bank—in effect, to circulate or \"monetize\" the newly created royal debt. This was a great deal for the bankers (they got to charge the king 8 percent annual interest for the original loan and simultaneously charge interest on the same money to the clients who borrowed it) , but it only worked as long as the original loan remained outstanding. To this day, this loan has never been paid back. It cannot be. If it ever were, the entire monetary system of Great Britain would cease to exist.” ― David Graeber, Debt: The First 5,000 Years"},{"quote":"“Suckers think that you cure greed with money, addiction with substances, expert problems with experts, banking with bankers, economics with economists, and debt crises with debt spending” ― Nassim Nicholas Taleb, The Bed of Procrustes: Philosophical and Practical Aphorisms"},{"quote":"“When the capital development of a country becomes a by-product of the activities of a casino, the job is likely to be ill-done” ― John Maynard Keynes"},{"quote":"“Pick a leader who will not only bail out banks and airlines, but also families from losing their homes -- or jobs due to their companies moving to other countries. Pick a leader who will fund schools, not limit spending on education and allow libraries to close. Pick a leader who chooses diplomacy over war. An honest broker in foreign relations. A leader with integrity, one who says what they mean, keeps their word and does not lie to their people. Pick a leader who is strong and confident, yet humble. Intelligent, but not sly. A leader who encourages diversity, not racism. One who understands the needs of the farmer, the teacher, the doctor, and the environmentalist -- not only the banker, the oil tycoon, the weapons developer, or the insurance and pharmaceutical lobbyist.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“By this means the government may secretly and unobserved, confiscate the wealth of the people, and not one man in a million will detect the theft.” ― John Maynard Keynes, The Economic Consequences of the Peace"},{"quote":"“For nearly four years you have had an Administration which instead of twirling its thumbs has rolled up its sleeves. We will keep our sleeves rolled up. We had to struggle with the old enemies of peace--business and financial monopoly, speculation, reckless banking, class antagonism, sectionalism, war profiteering. They had begun to consider the Government of the United States as a mere appendage to their own affairs. We know now that Government by organized money is just as dangerous as Government by organized mob.” ― Franklin D. Roosevelt"},{"quote":"“...If you look at mainstream economics there are three things you will not find in a mainstream economic model - Banks, Debt, and Money. How anybody can think they can analyze capital while leaving out Banks, Debt, and Money is a bit to me like an ornithologist trying to work out how a bird flies whilst ignoring that the bird has wings...” ― Steve Keen"},{"quote":"“The bankers and financiers are badly overplaying their hands, again, and people are starting to catch on to the scam.Real wealth is tangible things produced with tangible effort. Loans made out of thin-air 'money' require no effort and are entirely ephemeral. But if those loans are used to acquire real ownership of real assets, then something has been exchanged for nothing and one party is getting screwed.” ― Chris Martenson"},{"quote":"“When you need to borrow money the Mob seems like a better deal I think. 'You don't pay me back I break both yer legs.' Is that all? You won't take my house or wreck my credit rating? Fine where do I sign. Legs? Fine. You don't even have to sign anything. ” ― craig ferguson"},{"quote":"“all loans, in the eyes of honest borrowers, must eventually he repaid. All credit is debt. Proposals for an increased volume of credit, therefore, are merely another name for proposals for an increased burden of debt. They would seem considerably less inviting if they were habitually referred to by the second name instead of by the first.” ― Henry Hazlitt, Economics in One Lesson"},{"quote":"“The banking institutions, my friends, are sailing under false colours. They are running with the hare and hunting with the hounds. And we should never forget it.” ― Karl Wiggins, 100 Common Sense Policies to make BRITAIN GREAT again"},{"quote":"“The crash did not cause the Depression: that was part of a far broader malaise. What it did was expose the weaknesses that underpinned the confidence and optimism of the 1920s - poor distribution of income, a weak banking structure and insufficient regulations, the economy's dependence on new consumer goods, the over-extension of industry and the Government's blind belief that promoting business interests would make America uniformly prosperous.” ― Lucy Moore, Anything Goes: A Biography of the Roaring Twenties"},{"quote":"“Not even ten additional years of slavery could have done so much to throttle the thrift of the freedmen as the mismanagement and bankruptcy of the series of savings banks chartered by the Nation for their especial aid.” ― W.E.B. Du Bois, The Souls of Black Folk"},{"quote":"“The bank - or the Company - needs - wants -insists - must have - as though the bank or the Company were a monster, with thought and feeling, which had ensnared them... The banks were machines and masters all at the same time...They breathe profits; they eat the interest on money. If they don't get it they die... It is a sad thing, but it is so. It is just so.” ― John Steinbeck, The Grapes of Wrath"},{"quote":"“Von Pein’s family was a little known, but highly influential entity within American banking circles. Banking Royalty, some called it. His grandfather had been one of the chief orchestrators of the Federal Reserve Act of 1913, which effectively took ownership of the bank from the American people.” ― James Morcan, The Orphan Factory"},{"quote":"“Banks do not create money for the public good. They are businesses owned by private shareholders. Their purpose is to make a profit.” ― John Rogers, Local Money: What Difference Does It Make?"},{"quote":"“Earn Nicely, spend wisely and you will live happily.” ― Oscar Auliq-Ice"},{"quote":"“New Golden Rule of Fractional Reserve Banking: He who creates the \"fool's gold\" controls the fools.” ― Orrin Woodward"},{"quote":"“It's good to have a special price to pay for the future and it will pay you in return, in the exact way you would wish to be paid.” ― Oscar Auliq-Ice"},{"quote":"“International big business has made revolutions before now to safeguard its interests. At one time it made them … in the name of Liberty, Equality and Fraternity. Now, with Socialism to fight, it makes them in the name of Law and Order and Sound Finance. Assassination? If an assassination is going to be good for business, then there will be an assassination.” ― Eric Ambler , The Mask of Dimitrios"},{"quote":"“Eric Daniels, the boss at Lloyds TSB for example, was paid less than Goggin in 2007 despite delivering three and a half times Bank of Ireland's profits that year. Goggins' total package was 50 percent more than that of Andy Hornby of HBOS, who collected €2.6 million in 2007. The Scottish giant made €6.988 billion that year compared to Bank of Ireland's €1.584 billion.” ― Shane Ross, The Bankers: How The Banks Ruined The Irish Economy"},{"quote":"“A bank is but honesty with a premium. At least this is what it is supposed to be.” ― Lamine Pearlheart, The Sunrise's Commandment"},{"quote":"“The main mark of modern governments is that we do not know who governs, de facto any more than de jure. We see the politician and not his backer; still less the backer of the backer; or, what is most important of all, the banker of the backer.” ― JRR Tolkein"},{"quote":"“Are you afraid to buy our Verified Payoneer Accounts service will be Dropped? Don’t Worry, We are not like the rest of the fake PVA Accounts providers. We provide 100% Non-Drop PVA Accounts, Permanent PVA Accounts, and Legit PVA Accounts Service. We’re working with the largest team and we’re instant start work after your placing order. So, Buy our Service and enjoy it.Our Service Always Trusted Customers sufficient Guarantee✔ 100% Customers Satisfaction Guaranteed.✔ 100% Non-Drop Verified Payoneer Accounts✔ Active Verified Payoneer Accounts✔ Very Cheap Price.✔ High-Quality Service.✔ 100% Money-Back Guarantee.✔ 24/7 Ready to Customer Support.✔ Extra Bonuses for every service.✔ If you want to buy this product, you must Advance Payment. If you want to more information contact now. 24 Hours Reply/Contact Email: pvasellit@gmail.com Telegram: @pvasellit Skype: Pvasellit WhatsApp: +1 (365) 829-0969” ― Buy Verified Payoneer Account"},{"quote":"“,,,,, Skype: Pvasellit,,,,,,,,,,,,,,,,------Telegram: @pvasellit------------;;;;;;;;Email: pvasellit@gmail.com.....,,,,,,,,WhatsApp: +1 (365) 829-0969....” ― Buy Verified Payoneer Account"},{"quote":"“Importance of Buy Verified PayPal AccountsBuy verified Paypal accounts online transactions are a routine part of life. Whether you’re selling handmade crafts on Etsy or purchasing the latest tech gadgets from eBay, having a verified PayPal account can be a game changer. One might wonder, why is it so crucial? Buy verified PayPal accounts provides several benefits that can enhance your online business experience:” ― 1"},{"quote":"“Within the vast expanse of a nation's economic landscape, the act of borrowing money from a bank assumes a pivotal role in shaping the destinies of individuals and the collective.” ― Rove Monteux, What is Wrong with Society Today"},{"quote":"“Witness the government's inability to control the banking system or the continuing spree of vast bonus payments with little justification or scrutiny.” ― Gordon Roddick"},{"quote":"“The more I ponder, I wonder if this isn't a searing, modern example of the peasants' historic inclination to doff their caps and tug their forelocks. To take their punishment and to remain silent. The banks tell us to believe the hype, the spin, to praise their brilliance and sophistication. They're smart because they say they are - and we accept they are because they say they are.” ― Chris Blackhurst, Too Big to Jail: Inside HSBC, the Mexican Drug Cartels and the Greatest Banking Scandal of the Century"},{"quote":"“If you own the bank you can pay your adversaries to fight for you.” ― Sharky Rich"},{"quote":"“For a moment, Poldo’s mind flashed back to when he was a young boy in his family workshop, when his father had sat him down and told him that if nothing else, he could take pride in being a good person. Since then, he’d discovered that being a good person was the last resort of self-esteem.In the upper echelons of Andarun’s financial industry, people prided themselves on the name of the firm they worked for, the size of the deals they closed, the title on their business card, and anything else that could be quickly boiled down to a sum of gold. With so much to take pride in beyond integrity, many bankers put little stock in it.” ― J. Zachary Pike, Son of a Liche"},{"quote":"“The problem with keeping money in a bank is that in the blink of a tiger’s tail it will turn on you: what’s yours becomes theirs, what was your sweat and labour and sold off portions of a lifetime becomes a stranger’s.” ― Paolo Bacigalupi, The Windup Girl"},{"quote":"“Nowhere could hold a candle to England with its big skies and making do people still fighting World War Two with humour and a stiff upper lip.” ― Clifford Thurlow, How to Rob the Bank of England: Keith Cheeseman Reveals the True Story of Britain’s Biggest Ever Robbery"},{"quote":"“The malignant Tumor of the banking Organism, the Termite Infestation in this wooden System, the insatiable Lion in an Oligarchy ruled by Boars..” ― Sino Melo"},{"quote":"“The Day will come on which Humanity will be surprised how the banking System could work for so long.” ― Sino Melo"},{"quote":"“Understanding Egypt's financial landscape is the first step toward a successful banking career.” ― Mohamed Dosou, How to Find Your BANK CALL!: Your ultimate guide to launching a successful banking career in Egypt’s dynamic financial sector."},{"quote":"“Specializing in high-demand fields like digital banking can set you apart.” ― Mohamed Dosou, How to Find Your BANK CALL!: Your ultimate guide to launching a successful banking career in Egypt’s dynamic financial sector."},{"quote":"“Essential qualifications and soft skills are key to thriving in Egypt's banking industry.” ― Mohamed Dosou, How to Find Your BANK CALL!: Your ultimate guide to launching a successful banking career in Egypt’s dynamic financial sector."},{"quote":"“After the predicted disaster occurred, an “emerging consensus” developed among economists “on the need for macroprudential supervision” of financial markets, that is, “paying attention to the stability of the financial system as a whole and not just its individual parts.” Two prominent international economists added that “there is growing recognition that our financial system is running a doomsday cycle. Whenever it fails, we rely on lax money and fiscal policies to bail it out. This response teaches the financial sector: take large gambles to get paid handsomely, and don’t worry about the costs—they will be paid by taxpayers” through bailouts and lost jobs, and the financial system “is thus resurrected to gamble again—and to fail again.” The system is a “doom loop,” in the words of the official of the Bank of England responsible for financial stability.” ― Noam Chomsky, Hopes and Prospects"},{"quote":"“Every citizen has right to access banking in his state language.” ― Dipti Dhakul,"},{"quote":"“In banking, compliance is not optional. It’s the foundation. And ignoring it? That’s not a lapse — it’s malpractice.” ― Dipti Dhakul,"},{"quote":"“The bank was raising a loan of two million pounds for the government of Russia. It had issued 100-pound bonds which paid five pounds interest per year; but they were selling the bonds for 93 pounds, so the true interest rate was over five and three-eighths. Most of the bonds had been bought by other banks in London and Paris, but some had been offered to the general public, and now the applications would have to be counted.\"Let's hope we have more applications than we can fulfill,\" Mulberry said.\"Why?\"\"That way the unlucky applicants will try to buy the bonds tomorrow on the open market, and that will drive the price up perhaps to 95 pounds and all our customers will feel they've bought a bargain.\"Hugh nodded. \"And what if we have too few applications?\"\"Then the bank, as underwriter, has to buy the surplus-at 93 pounds. And tomorrow the price may go down to 92 or 91 pounds, and we will have made a loss.” ― Ken Follett, A Dangerous Fortune"},{"quote":"“The banker has an unlimited supply of fiat to buy a limited supply of commodities.” ― Gun Gun Febrianza"},{"quote":"“Normally, .when the bank launched, say, a million pounds' worth of bonds, it agreed to buy any unsold bonds itself, thereby guaranteeing that the borrower would receive the full million. In return for that guarantee, the bank took a fat percentage. The alternative method was to offer the bonds for sale with no guarantee. The bank took no risk and received a much lower percentage, but if only ten thousand of the million bonds were sold, the borrower would get only ten thousand pounds. The risk remained with the borrower” ― Ken Follett, A Dangerous Fortune"},{"quote":"“Bitcoin is Digital money that no government or bank controls. Your money, your rules — no need to trust fragile paper systems.” ― Gun Gun Febrianza"},{"quote":"“Bitcoin is the newest generation of currency in the 21st century that is changing the way people view money.” ― Gun Gun Febrianza"},{"quote":"“Get Verified PayPal Accounts from Smmgrowservice – Trusted Source in 2025If you want more information just contact me now.24 Hours Reply/Contact➤Telegram: @smmgrowservice➤WhatsApp: +1 (812) 641-1743➤Email: smmgrowservice@gmail.comLooking to ensure secure and hassle-free online transactions in 2025? Buy Verified PayPal Accounts From Smmgrowservice In 2K25 and experience seamless digital payments with enhanced credibility. As online platforms continue to tighten their verification policies, having a fully verified PayPal account becomes essential for freelancers, e-commerce sellers, and marketers. Smmgrowservice stands out by offering accounts that are pre-verified with real credentials, multi-layered security, and instant activation. One unique benefit is their regional customization—users can choose accounts based on specific countries, enabling smoother global operations. Whether you're scaling a startup or managing international payments, this service helps you skip the delays and dive straight into business.Buy Fully USA, UK, CA Verified PayPal AccountsWelcome to smmgrowservice.com website, your trusted website for fully verified PayPal accounts in the USA, UK, and Canada. We offer personal and business accounts ready for use, verified and secure.Features of PayPal Accounts-»Real Phone Number Verified»Old PVA Gmail Account Associated With PayPal»Personal and Business Accounts Are Available»Photo ID Verified»EIN Verified»Address Verified»High Profile SSN Details Confirmed»Bank Verified»Visa Card VerifiedWhat Will We Give You-»Email Login Access»PayPal Login Access»Phone Number Access»Personal/Business Details»Photo ID»Address Verification Documents»SSN Photo ID»Bank Account Login Access»Card DetailsWhat We Offer-»30 Days Unlimited Free Replacement»Money Back Guarantee Till 30 Days»If PayPal Ask You For More Documents We Will Give You It With Free»Order Exchange AvailableWhat are the basic steps to create a personal PayPal account?Creating a personal PayPal account is a straightforward process that provides users with a secure and convenient way to send and receive money online. The basic steps to create a personal PayPal account begin by visiting the PayPal website or downloading the app. First, you will need to click on the \"Sign Up\" button and choose \"Personal Account\" as your account type. Afterward, you’ll be prompted to enter your email address and create a strong password to ensure the security of your account. Next, you will need to provide your personal details, such as your name, address, and phone number. After verifying your identity through a confirmation email or SMS, you'll link a payment method like a debit/credit card or bank account. Finally, to complete the setup, PayPal may ask you to verify your identity by providing a government-issued ID or answering security questions. By following these steps, you’ll be ready to use PayPal for online transactions, payments, and transfers securely.” ― Top Source for Verified PayPal Accounts: Smmgrowservice Review (2025)"},{"quote":"“Bitcoin is a fair money ecosystem that is algorithmically free from human error and political antagonism.” ― Gun Gun Febrianza"},{"quote":"“... A bank run never involves just one bank, however large. ... Bank runs are not about capital ratios and liquidity. They're about confidence and psychology.” ― James Rickards, MoneyGPT: AI and the Threat to the Global Economy"},{"quote":"“This ... he largest financial bailout in history ... was not just a bailout of SVB [Silicon Valley Bank]. It was a bailout of over fifty thousand SVB depositors with over $170 billion in deposits. It was a bailout of SVB's customers, it's employees, their suppliers, and the entire high-tech startup ecosystem in Silicon Valley and around the world.” ― James Rickards, MoneyGPT: AI and the Threat to the Global Economy"},{"quote":"“This ... the largest financial bailout in history ... was not just a bailout of SVB [Silicon Valley Bank]. It was a bailout of over fifty thousand SVB depositors with over $170 billion in deposits. It was a bailout of SVB's customers, it's employees, their suppliers, and the entire high-tech startup ecosystem in Silicon Valley and around the world.” ― James Rickards, MoneyGPT: AI and the Threat to the Global Economy"},{"quote":"“Bitcoin value is created from collective belief and network effects rather than atoms or armies.” ― Gun Gun Febrianza"},{"quote":"“Money is fundamentally a social coordination technology, not a physical thing. It exists in the collective human mind as a solution to trust and coordination problems.” ― Gun Gun Febrianza"},{"quote":"“What is the lawsuit against SoFi??????One of SoFi’s most high-profile legal actions in recent years centers around its challenge to the federal government’s pause on student loan repayments 1-(850)-[427]-[7956]. In March 2023, SoFi Bank N.A. filed a lawsuit against the U.S. Department of Education (ED), arguing that the extension of the student loan payment moratorium was unlawful and causing financial harm to its business 1-(850)-[427]-[7956].AP News 1-(850)-[427]-[7956]+2 Bloomberg 1-(850)-[427]-[7956]SoFi’s main claims included: 1-(850)-[427]-[7956]Lack of Legal Basis: SoFi contended that the latest extension of the payment pause did not properly stem from pandemic relief grounds and exceeded the authority granted by the HEROES Act 1-(850)-[427]-[7956].AP News 1-(850)-[427]-[7956]+1 1-(850)-[427]-[7956]Financial Injury: It argued that the moratorium reduced borrower incentives to refinance or use SoFi’s lending services, thereby harming its revenue and profitability 1-(850)-[427]-[7956].Bloomberg 1-(850)-[427]-[7956]+1 1-(850)-[427]-[7956]Procedural Deficiencies: The company asserted that the government failed to follow administrative rules—like seeking public comment—thus violating the Administrative Procedure Act (APA) 1-(850)-[427]-[7956].AP News 1-(850)-[427]-[7956]+1 1-(850)-[427]-[7956]In response, the Biden administration filed a motion asking a court to dismiss the lawsuit 1-(850)-[427]-[7956]. Among the arguments, the government claimed SoFi lacked standing because its interests conflicted with the statutory goals behind the student relief measures 1-(850)-[427]-[7956]. It also defended the legality of the pause under the HEROES Act authority 1-(850)-[427]-[7956].NASFAA 1-(850)-[427]-[7956]However, as the legal and political landscape shifted, SoFi eventually dropped the lawsuit in June 2023 1-(850)-[427]-[7956]. The company cited a debt-ceiling deal that included clear timelines for the resumption of student loan repayments, thereby reducing the basis for its claims 1-(850)-[427]-[7956].NASFAA 1-(850)-[427]-[7956]+1 1-(850)-[427]-[7956]⚖️ Other Legal Actions Against SoFi 1-(850)-[427]-[7956]In addition to the payment-pause case, SoFi has faced other legal scrutiny 1-(850)-[427]-[7956]. For example, it agreed to a $1.1 million settlement after regulators (FINRA) found it had failed to properly vet new brokerage accounts from December 2018 to April 2019, which led to approximately $2.5 million in fraud 1-(850)-[427]-[7956].Barron's 1-(850)-[427]-[7956]Also noteworthy is a class-action lawsuit alleging SoFi discriminated against immigrants—specifically those under DACA or conditional green card status—by denying them access to loans despite having legal status in the U.S 1-(850)-[427]-[7956].” ― MH"},{"quote":"“The direct cause of massive unemployment is labour market inflexibility. In fact, state intervention in the labour market and union coercion, made possible by the privileges the legal system confers on unions, results in a series of regulations which make the labour market one of the most rigid. Furthermore, due to the artificial costs labour legislation generates, the discounted value of a worker's real marginal productivity tends to fall short of the total labour cost the entrepreneur incurs in hiring the worker. This leads to markedly high unemployment, which will affect all workers whose expected marginal productivity yields a discounted value lower than the cost involved in employing them. Therefore they will be dismissed or not hired at all.” ― Jesús Huerta de Soto, Money, Bank Credit, and Economic Cycles"},{"quote":"“$300.00 – $499.00Price range: $300.00 through $499.00Buy Verified Stripe AccountsBuy Verified Stripe AccountsStripe is a technology company that provides a verified Stripe API suite to support global expansion, are you looking for the best platform to buy a verified Stripe account? Then pvaitsmo buy an account on a verified strip for personal business purposes. And discuss all the steps you need to take to get paid instantly. And provide fully verified USA accounts.Fully verified accounts with completed KYCInstant setup and ready for use2Reliable and secure for payment processingIdeal for businesses, freelancers, and startups Features of our Verified Stripe Accounts-✅Premium quality authentic and real account✅Instant PayOut option✅SSN, Bank Verified, and Genuine account✅Email, SSN, Card Verified, and Bank attached✅ID, Driving License, and Passport scan copy with account✅24/7 active customer supportIf you face any problem you can contact us. we are online 24/7 hoursTelegram:@pvaitsmoWhatsApp: ‪‪+1(205)261-8415Email: pvaitsmo@gmail.com” ― Buying Verified Stripe Accounts 100% KYC Instant Best Sale"},{"quote":"“What businesses need from a bank is significantly different from what individuals need from a bank.” ― Hendrith Vanlon Smith Jr, CEO of Mayflower-Plymouth"},{"quote":"“Banking is transforming. What a bank will be in 2030 is going to be significantly different from what a bank has been for the past few hundred years.” ― Hendrith Vanlon Smith Jr, CEO of Mayflower-Plymouth"},{"quote":"“At their core, banks sell the utility of resources and the stewardship of resources.” ― Hendrith Vanlon Smith Jr, CEO of Mayflower-Plymouth"},{"quote":"“I think decentralized finance and traditional banking are going to experience a kind of hybridization within the next few decades; a blending together that results in something greater than the sum of its parts.” ― Hendrith Vanlon Smith Jr, CEO of Mayflower-Plymouth"},{"quote":"“Data is one of the most valuable resources of a bank.” ― Hendrith Vanlon Smith Jr, CEO of Mayflower-Plymouth"},{"quote":"“The Decentralization of Finance is really good for humanity and it’s ultimately a win for each and every one of us. Because now that we can circumvent banks, exchanges and brokerage companies by using smart contracts on the blockchain… every person, every family, and every business will experience more more liberty, more freedom, more opportunities, more abundance, more power, and more wealth.” ― Hendrith Vanlon Smith Jr"},{"quote":"“The Decentralization of Finance is really good for humanity. Now that we circumvent can banks, exchanges and brokerages by using smart contracts on the blockchain… every person, every family, and every business will experience more freedom, more liberty, more opportunities, more power, more abundance, and more wealth. So DeFi is a win for humanity.” ― Hendrith Vanlon Smith Jr"},{"quote":"“The Decentralization of Finance is really good for humanity and it’s ultimately a win for each and every one of us. Because now that we can circumvent banks, exchanges and brokerage companies by using smart contracts on the blockchain… every person, every family, and every business will experience more liberty, more freedom, more opportunities, more abundance, more power, and more wealth. This makes way for more opportunities around financial wellness, permaculture investing, more effective crowdfunding, better ownership and equity arrangements, and more.” ― Hendrith Smith"},{"quote":"“In contrast to Ricardo’s expectation that banking would retain its early focus on international commerce — and hence,on industrial capital formation to provide foreign markets with British exports in exchange for raw materials — banking has found real estate to be the key, along with its traditional market in creating monopolies and trusts. Some 80% of bank loans in the United States and Britain are mortgages, and consequently they account for 70% of the economy’s interest payments.” ― Michael Hudson, The Bubble and Beyond"},{"quote":"“Morally and practically, the Freedmen’s Bank was part of the Freedmen’s Bureau, although it had no legal connection with it. With the prestige of the government back of it, and a directing board of unusual respectability and national reputation, this banking institution had made a remarkable start in the development of that thrift among black folk which slavery had kept them from knowing. Then in one sad day came the crash,—all the hard-earned dollars of the freedmen disappeared; but that was the least of the loss,—all the faith in saving went too, and much of the faith in men; and that was a loss that a Nation which to-day sneers at Negro shiftlessness has never yet made good. Not even ten additional years of slavery could have done so much to throttle the thrift of the freedmen as the mismanagement and bankruptcy of the series of savings banks chartered by the Nation for their especial aid.” ― W.E.B. Du Bois, The Souls of Black Folk"},{"quote":"“Tomorrow's banks will be decentralized applications of software built on cryptography, blockchain technology and smart contracts. Theyll be platforms for saving, lending, investing, moving and spending that are much more equitable and sensible than they were in the 20th century and ironically it'll be more aligned to what banks were like in much earlier civilizations. So when I talk about banks being to the economy what the heart is to the human body - this is really what I'm talking about. I'm not necessarily talking about the ICBC. The ICBC or Bank of America may play an important role, but so could thousands of small local banks or small apps on a Blockchain.” ― Hendrith Vanlon Smith Jr"},{"quote":"“Defi means Decentralized lending and borrowing among other things. Each node in this Defi network is the new meaning of a bank. That means that instead of there being just a few big banks, there will be a multitude of banks embedded in every aspect of society. Every type of business and every type of organization will have a bank and every type of business and every type of organization will offer financial services.” ― Hendrith Vanlon Smith Jr, CEO of Mayflower-Plymouth"},{"quote":"“When you gain, they (banks) gain. When you lose, they’re indifferent.” ― Anas Hamshari, Businessman With An Affliction"},{"quote":"“Money is a tool of control invented by the Archons and implemented by your banking families.” ― Sol Luckman, Cali the Destroyer"},{"quote":"“Even as a former Banker I can see that the Blockchain and Ethereum are challenging the role of traditional banks. I think at some point, traditional banks will become irrelevant and ultimately non existent. Instead, the global standard of how people manage finances will be centered around the blockchain and apps built on Ethereum. Because of this, people and businesses will experience much more financial freedom. And that’s a good thing. So let these big banks collapse - something far better is going to replace them.” ― Hendrith Vanlon Smith Jr"},{"quote":"“Banks were once an extremely valuable part of the economy and did a lot of good in advancing civilization. Banks played a pivotal role in financing big projects like roads, bridges, factories, stadiums, etc. Banks were to the economy what the heart is to the human body. But that has ended.Traditional banks have become extra toxic entities in the economy. It’s partially the fault of excessive government regulations that have made everything dysfunctional and it’s partially the fault of greedy bankers putting profits above customers and shareholders above society... But nonetheless, banks today offer very little benefit to their clients. They pay barely anything in interest. They offer barely anything in growth. They move money too slowly. They’re too restrictive. They’re selling the same boring products and services they did a hundred years ago. And they have too much power over peoples accounts. Soon, the many new companies and applications that emerge on the Ethereum infrastructure will eliminate the need for traditional banks and eliminate their value proposition by providing people with superior value. Everything from growth to asset management to lending can be done even better on the Ethereum infrastructure by anyone.” ― Hendrith Vanlon Smith Jr"},{"quote":"“For economy is not just numbers and charts, But the beating heart of human hearts, A chance for progress, a chance for all, To rise and flourish, standing tall.” ― Oscar Auliq-Ice"},{"quote":"“I never keep my money in just one bank. They can disappear overnight and it can be a long time before you may get your money back.” ― Steven Magee"},{"quote":"“I never robbed a bank that didn't deserve it.” ― Koikka"},{"quote":"“The point is, ladies and gentleman, that greed -- for lack of a better word -- is good.Greed is right.Greed works.Greed clarifies, cuts through, and captures the essence of the evolutionary spirit.Greed, in all of its forms -- greed for life, for money, for love, knowledge -- has marked the upward surge of mankind.” ― Gordon Gekko, Wallstreet 1987"},{"quote":"“At one time, I worked for a 401k retirement Plan company that handled retirement plans for Transamerica, Vanguard, and all others 401k and IRA corporations operating in America. I can tell you, first hand, that retirement plans are a scam designed to make investors money without spending a dime of their own money.” ― James Thomas Kesterson Jr"},{"quote":"“The fall of the Roman Empire was caused by what will eventually cause the fall of the United States of America - 'Fractional Reserve Banking'.” ― James Thomas Kesterson Jr"},{"quote":"“Innovations are very cruel by nature. They destroy the old ones to create space for themselves.” ― Sukant Ratnakar, Quantraz"},{"quote":"“My dear General, the Belgian state, will shortly issue a government loan of fifty million, France is writing one of two and a half billion, please ask Lambert to inform you of the condition of the French operation, as for the Belgian loan, leave it to me to try and get information from the ministers, but don't say anything to Lambert, if the French government loan yields 5 or 6 percent I will invest a large sum in it, if the interest is lower then I won't subscribe to it.” ― Leopold II"},{"quote":"“I have never made much money, but this hasn't bothered me. I don't care what I'm paid. I have never had a shared bank account. I do not keep track of how much money is in my bank account. I am not stingy, I admire money well spent. I am not saving for my retirement. I have lived for several years without insurance.” ― Édouard Levé, Autoportrait"},{"quote":"“Legislation has created usury; and the Mutual Bank can destroy it. Usury is a result of the legislation which establishes a particular commodity as the sole article of legal tender; and, when all commodities are made to be ready money through the operation of Mutual Banking, usury will vanish.” ― William Batchelder Greene, Mutual Banking"},{"quote":"“We have the power to determine the future of banking, politics, and society.” ― Jessica Marie Baumgartner"},{"quote":"“Gilbert had cut his teeth working for international financiers in Newhaven, where he learned the trade of rubbing two coins together to produce a third. He could have chosen a life of comfort and security by staying the employee of one of the large firms, but why settle for comfort when he had a chance at luxury?‘Settling’ only entered Gilbert’s vocabulary when it came to two things: lawsuits and land claims.” ― Cal Black, No Land For Heroes"},{"quote":"“If one large bank has collapsed, more may be coming.” ― Steven Magee"},{"quote":"“the true Zürich is the city of Zwingli, Protestant work ethics and endless money that flows through the streets lubricating its more than well-functioning economy. The city of banking, reinsurance, assent management and home to way too many corporate & tax lawyers.” ― Ryan Gelpke, 2017: Our Summer of Reunions: Braai Seasons with Howl Gang (Howl Gang Legend)"},{"quote":"“Advances in digital banking will not eliminate the branch, they will allow for more creative ways to help clients achieve financial wellbeing.” ― Hendrith Smith, Essays on The Banking Industry"},{"quote":"“If Congress has the right under the constitution to issue paper money, it was given them to be used by themselves, not to be delegated to individuals or corporations.” ― Andrew Jackson"},{"quote":"“Banking was conceived in iniquity and was born in sin. The bankersown the earth. Take it away from them, but leave them the power tocreate deposits, and with a flick of the pen they will create enoughdeposits to buy it back again. However, take it away from them, and allthe great fortunes like mine will disappear and they ought to disappear,for this would be a happier and better world to live in. But, if you wishto remain the slaves of the bankers and pay the cost of your own slavery,let them continue to create deposits.” ― Josiah Stamp"},{"quote":"“The purpose of a centralized financial system or any other system, is not to exploit people, but to ensure stability in the society.” ― Abhijit Naskar, The Gospel of Technology"},{"quote":"“Blockchain itself is not dangerous, but if we start using decentralized blockchain as a complete substitute for our traditional transaction methods, then I am afraid, it would destroy the very human foundation of our financial system.” ― Abhijit Naskar, The Gospel of Technology"},{"quote":"“Monopoly Capitalism, Zionism, Communism, Nazism & Fascism: ALL came out of the Rothschild Offices in Frankfurt, Germany.” ― Eustace Clarence Mullins"},{"quote":"“Although the Muslim commercial web possessed many advanced features, including bills of exchange, sophisticated lending institutions, and futures markets, no Islamic state ever established the bedrock financial institution of the modern world: a national or central bank” ― William J. Bernstein, A Splendid Exchange: How Trade Shaped the World"},{"quote":"“We have, in this country, one of the most corrupt institutions the world has ever known. I refer to the Federal Reserve Board. This evil institution has impoverished the people of the United States and has practically bankrupted our government. It has done this through the corrupt practices of the moneyed vultures who control it.” ― Louis T. McFadden"},{"quote":"“Cryptocurrency is freedom, Banking is slavery” ― Arif Naseem"},{"quote":"“No matter whom the people elect, you always get JP Morgan and Goldman Sachs in charge. the shit going on is unbelievable. all to save massively overpriced assets.” ― Anonymous"},{"quote":"“The scheme began to unravel following the Panic of 1873 when railroad investments failed. The bank experienced several runs at the height of the panic. The panic would not have affected the bank if it had been a savings bank, but by 1866, the business of the bank had become…reckless speculation, over-capitalization, stock manipulation, intrigue and bribery, and downright plundering…. In a last ditch effort to save the bank, the Trustees appointed Frederick Douglas as Bank President in March of 1874. Douglass did not ask to be nominated and the Bank Board knew that Douglass had no experience in banking, but they felt that his reputation and popularity would restore confidence to fleeing depositors….Douglas lent the bank $10,000 of his own money to cover the bank’s illiquid assets….Douglass quickly discovered that the bank was full of dead men’s bones, rottenness and corruption. As soon as Douglass realized that the bank was headed towards certain failure, he imposed drastic spending cuts to limit depositors’ losses. He then relayed this information to Congress, underscoring the bank’s insolvency, and declaring that he could no longer ask his people to deposit their money in it. Despite the other Trustees’ attempts to convince Congress otherwise, Congress sided with Douglass, and on June 20, 1874, Congress amended the Charter to authorize the Trustees to end operations. Within a few weeks’ time, the bank’s doors were shut for good on June 29, 1874, leaving 61,131 depositors without access to nearly $3 million dollars in deposits. More than half of accumulated black wealth disappeared through the mismanagement of the Freedman’s Savings Bank. And what is most lamentable…is the fact that only a few of those who embezzled and defrauded the one-time liquid assets of this bank were ever prosecuted….Congress did appoint a commission led by John AJ Cresswell to look into the failure and to recover as much of the deposits as possible. In 1880, Henry Cook testified about the bank failure and said that bank’s depositors were victims of a widespread universal sweeping financial disaster. In other words, it was the Market’s fault, not his. The misdeeds of the bank’s management never came to light.” ― Mehrsa Baradaran, The Color of Money: Black Banks and the Racial Wealth Gap"},{"quote":"“the ones who are running the world economy have protected themselves very strongly from market discipline. the neo-liberal system is an attack, in my view, both on the market, and on democracy.” ― Noam Chomsky"},{"quote":"“The degree to which you value the currency in your possession; is a reflection of your daily potential good or bad investment choices.” ― Wayne Chirisa"},{"quote":"“With a gun a man can rob a bank, with a bank a man can rob the world.” ― Carter Glass"},{"quote":"“The academic auspices under which we meet this afternoon, prompt me to introduce my remarks with a literary reference. I recall for you a few lines of Shakespeare, from Hamlet where Polonius bids farewell to his son Laertes:\"Neither a borrower nor a lender be,For loan oft loses both itself and friendAnd borrowing dulls the edge of husbandry.\"This was undoubtedly necessary advice from a father to a son about to leave for France. but it is clear that Polonius was neither a banker nor a Californian. If he had been a banker, he might have commented on the merits of good collateral as compared to the possible loss of a few friends. And if he had been a Californian, caught in the vigor of a growth economy, the idea of not being a borrower would never have occurred to him. Therefore, it should not be surprising that a California banker has come to say something on behalf of debt.” ― Rudolph a. Peterson, Debt in a New Environment"},{"quote":"“Currency is like God, it exists as long as people believe in it.” ― Abhijit Naskar, The Gospel of Technology"},{"quote":"“Pure english (3 o'clock or 9 o'clock), when shot perpendicular into a rail, creates a rebound of 22 1/2 degrees. Each additional hour clockwise on the same side of the cue ball moves the result one diamond counter-clockwise on the table (and vice-versa).” ― Dale F. Brandt"},{"quote":"“I don't know how you'll be getting your money into my bank account, but don't make me do too much work for it.” ― Dmitry Dyatlov"},{"quote":"“Economics is a knack of managing unlimited demand with limited supply.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Nobody fails as often as an economist, a meteorologist, and a fortuneteller.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Statistics surpasses sentiments.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Economics qualifies the test of education but fails the test of emotions.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Economics is not as simple as philosophy and not as complex as mathematics.” ― Amit Kalantri, Wealth of Words"},{"quote":"“The efficient execution of industrial and administrative activities by the people promises an enduring economy for the province.” ― Amit Kalantri, Wealth of Words"},{"quote":"“An economist doesn't know how to make money, but he claims to know what to do with it once someone else makes money.” ― Amit Kalantri, Wealth of Words"},{"quote":"“An economy where even a few people cannot afford a snack, shelter, and survival is a failed economy.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Menabung adalah tindakan yang paling baik untuk bisa mendapatkan keuntungan di masa mendatang. Lakukan tabungan setiap hari agar masa pensiun bisa santai.” ― indah, Here Comes The Train"},{"quote":"“If every bank is a planet; LIBOR is the sun in the solar system of banking solidarity.” ― Vikrmn: CA Vikram Verma, LIBOR Plan B"},{"quote":"“LI(e)-BOR; not banking on bankers.” ― Vikrmn: CA Vikram Verma"},{"quote":"“RFR; the new lease of life, to banking leases, loans and more.” ― Vikrmn: CA Vikram Verma, LIBOR Plan B"},{"quote":"“Pick a leader who will make their citizens proud. One who will stir the hearts of the people, so that the sons and daughters of a given nation strive to emulate their leader's greatness. Only then will a nation be truly great, when a leader inspires and produces citizens worthy of becoming future leaders, honorable decision makers and peacemakers. And in these times, a great leader must be extremely brave. Their leadership must be steered only by their conscience, not a bribe.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“Now I don't know much about finances, but I do know not to trust these smooth-faced wolves in sheep’s clothing. We trust these confidence tricksters because they know best, right? They'll be able to advise us, won't they? Yeah, they know best all right. They throw legal dust in our eyes, always keeping something back and dressing up their untruths with promises and alluring pound-note signs. But all the time they're making a killing out of us. A FUCKING KILLING!” ― Karl Wiggins, 100 Common Sense Policies to make BRITAIN GREAT again"},{"quote":"“The need for physical spaces dedicated to financial wellbeing are no more in threat of extinction than the need for physical spaces dedicated to physical wellbeing.” ― Hendrith Smith, Essays on The Banking Industry"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“After bursting open a door of idiotic obstinacy with a weak rattle in its throat, you fell into Tellson’s down two steps, and came to your senses in a miserable little shop, with two little counters, where the oldest of men made your cheque shake as if the wind rustled it, while they examined the signature by the dingiest of windows, which were always under a shower-bath of mud from Fleet-street, and which were made the dingier by their own iron bars proper, and the heavy shadow of Temple Bar.” ― Dickens Charles, A Tale of Two Cities"},{"quote":"“Capitalism is Altruistic, and it requires a certain altruism of each of us.” ― Hendrith Smith, Essays on Capitalism & The U.S. Economy"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"},{"quote":"“It tugged at his soul not to talk to other writers about his work. He loved the bank, keeping it secure and compliant with the laws and regulations. People assumed these things happened by magic. They did not. Hauer never talked about it outside the office. He didn't want to make the other writers uncomfortable. If he developed a reputation as someone who brought his work with him to writers conferences they would all turn away, to sip and swizzle their drinks without him.” ― Charlie Close, Before the Ripcord Broke: Stories"},{"quote":"“Success from the financial and from the prestige point of view . . . is not enough; what matters even more is . . . adherence to high moral and aesthetic standards.\" — as quoted in \"High Financier\" by Niall Ferguson” ― Siegmund Warburg"},{"quote":"“Making a product is just an activity, making a profit on a product is the achievement.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Like all financial schemes, the Mississippi Scheme was constructed upon the volatile foundation of confidence. For the public to continue to use the Banque Royale’s banknotes, it had to remain confident that those banknotes would retain and represent their stated face value. And for the public to continue to invest in Mississippi Company shares, it had to remain confident that the prospects of the Mississippi Company justified the market price of the shares.” ― Gavin John Adams, John Law: The Lauriston Lecture and Collected Writings"},{"quote":"“Monetary policy does not work like a scalpel but more like a sledgehammer.” ― Liaquat Ahamed"},{"quote":"“Banks should actively encourage companies that are doing a good job on environmental and social fronts. Banking for community development is the banking of future.” ― Saurabh Gupta Earth5R"},{"quote":"“Während der Wissenschaftler stets um den rechten Weg bemüht ist und ihm jeder noch so kleine Fehler ein Dorn im Auge ist, erlaubt sich der Künstler, die ausgetretenen Pfade zu verlassen, die Sache bewusst komplett anders anzupacken und aus den Fehlern zu lernen.” ― Collin Coel, Vertrauen im Investmentgeschäft"},{"quote":"“Warren Buffett wird nicht müde zu betonen, dass es an ihm ist, sich selbst die Verwaltung des kleinsten Geldbetrages sehr angelegen sein zu lassen. Und eben darin bekundet sich jenes Verantwortungsbewusstsein, mit dem Staat zu machen ist.” ― Collin Coel, Vertrauen im Investmentgeschäft"},{"quote":"“Es reicht, über die Geschäfte des Unternehmens im Bilde zu sein, dank erwiesener Ertragskraft, hoher Kapitalrenditen, niedriger Schulden und exquisiter Produkte beruhigt der Zukunft entgegenzusehen, die Gewissheit zu haben, dass fähige Manager am Drücker sitzen, und in ein Unternehmen zu investieren, das generell hoch im Kurs steht.” ― Collin Coel, Vertrauen im Investmentgeschäft"},{"quote":"“In a very humbling process, the Swiss have had to admit to their faults and compromise on secrecy, changing the law and releasing the names of bank clients to please the US, as well as signing a dozen double taxation agreements in six months to please the OECD.” ― Clare O'Dea, The Naked Swiss: A Nation Behind 10 Myths"},{"quote":"“I take from the poor and give to the rich. They just happen to be the same individuals. Poor and stupid before they learn from me and pay with their time and money, but rich and successful after they do. The truly miserable, however, don't know how poor they are, and I want nothing from them.” ― Robin Sacredfire"},{"quote":"“Every time you use a banknote; every time you use a modern coin; every time you use a credit card or debit card; every time you use internet banking; every time you use any modern crypto currency; every time you use a gift voucher; every time you use a poker chip; in fact, every time you enter into any form of transaction that does not rely on bartering, each such transaction has its ideological origins in John Law’s idea that money need have no intrinsic value.” ― Gavin John Adams, John Law: The Lauriston Lecture and Collected Writings"},{"quote":"“Most of the supposed wealth held by American banks at that point had become so wholly imaginary, so weightless and impalpable, that any amount of it could be transferred instantly to Ecuador, or anyplace else capable of receiving a written message by wire or radio.” ― Kurt Vonnegut, Galápagos"},{"quote":"“Most of the women are such a bank that receives only but does not give back.” ― Ehsan Sehgal"},{"quote":"“O cara trabalha a vida inteira e dá o dinheiro dele para outra pessoa administrar, e essa pessoa ganha uma taxa de administração para tomar conta dele, se ela perder o teu dinheiro, foda-se, a taxa de administração continua ali.Mano, você emprestaria sua esposa para o Kid Bengala comer por um fim de semana e ainda daria 20 mil para ele pelo serviço? Buy side é isso aí, a pessoa comum e mal informada, acha que não percebe de investimentos e acaba botando o seu tão suado dinheiro, na mão de um zé ruela que é socialmente aceite só porque é bem vestido, tem um MBA lá fora e sobrenome estrangeiro.” ― Raiam Santos, Wall Street: O Livro Proibido [Ebook]"},{"quote":"“I wish life was like banking,' I said. 'I don't mean it's straightforward. Some of it's incredibly complicated. But you can understand it in the end, if you try hard enough. Or there's someone, somewhere, who understands it, even if only afterwards, after it's too late. The trouble with life, it seems to me, is that it can turn out to be too late and you still haven't understood it.” ― Julian Barnes, Talking It Over"},{"quote":"“Myth: Feeding the banking sector gobs of welfare cash will bring about a recovery. Fact: Our leaders are only dedicated to preserving power” ― Ziad K. Abdelnour, Economic Warfare: Secrets of Wealth Creation in the Age of Welfare Politics"},{"quote":"“Those who say don't know, those who know don't say” ― Michael Lewis"},{"quote":"“Savers have to be punished so debtors can be saved.Why? Because if debtors are rescued, that makes it possible for more debts to be issued in the future.And why is that important? Because the banking system needs ever more loans in order to survive.” ― Chris Martenson"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“The trouble is, nobody knows exactly how the world really works. We are all fallible people with limited knowledge. It is only through Biblical revelation from the One who knows how the world really works because He made it and actively sustains it that anyone can come to a competent understanding of the world.” ― Gary North, Honest Money: Biblical Principles of Money and Banking"},{"quote":"“Have you met a banker, who is not interested in money? He loves the game, not the cash! You should bet on him.” ― Csaba Gabor"},{"quote":"“In 1987 Senator Jesse Helms, stated \"it is no secret that the international bankers profiteer form sovereign state debt. The New York banks have found important profit centers in lending to countries plunged into debt by Socialist regimes. Under Socialist regimes, countries go deeper and deeper into debt because Socialism as an economic system does not work. International bankers are sophisticated enough to understand this phenomenon and they are sophisticated enough to profit from it.” ― Mark M. Rich, The Hidden Evil: The Financial Elite's Covert War Against the Civilian Population"},{"quote":"“Money should be ones demand and not command, one should not become a slave of Money because we made money to help us trade and not to make us, we're already made even without money.” ― Oscar Auliq-Ice"},{"quote":"“He never addressed it as infidelity. To Jordan Belfort and his men, sex with a Blue Chip was a reflex of sorts – a kind of spasm or procedure or 'niche-service', useful as a form of stress relief; as the girls were never regarded as fully human, there were no problems. There were, the brokers felt, certain liberties to which men of power were entitled.” ― Antonella Gambotto-Burke, Mouth"},{"quote":"“Intellectually and compassionately explaining the reason freedom works is required for credibility.” ― Ron Paul, End the Fed"},{"quote":"“The Lebanese banking system helps Iran, Syria & Hezbollah evade sanctions.” ― Ziad K. Abdelnour, Ending Syria's Occupation of Lebanon: The U.S. Role"},{"quote":"“Keep your eyes on the price when spending, don't regret later to find that you have nothing for tomorrow.” ― Oscar Auliq-Ice"}]
