[{"quote":"“Once you embrace your value, talents and strengths, it neutralizes when others think less of you.” ― Rob Liano"},{"quote":"“Unrequited love is the only emotion that allows sane people to taste the “life sentence” of someone with bipolar disorder. The longer they hang onto a lost cause the more unstable they look to everyone else. They contradict their own belief systems and statements, by circling the drain with two competing emotions—love and hate.” ― Shannon L. Alder"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“Any day above ground is a good day. Before you complain about anything, be thankful for your life and the things that are still going well.” ― Germany Kent"},{"quote":"“You can make heaven out of hell, or hell out of heaven. The choice is yours.” ― Shannon L. Alder"},{"quote":"“There is too much negativity in the world. Do your best to make sure you aren't contributing to it.” ― Germany Kent"},{"quote":"“Stay positive. Sometimes you don't even realize you're blocking your own blessings by thinking negatively and holding on to the past. Learn to let go.” ― Germany Kent"},{"quote":"“The idea is quite simple, stay a light year away from people who make you feel less about yourself.” ― Mohith Agadi"},{"quote":"“Every time you speak, you are either building up yourself for the better or you are limiting yourself for the worse. Words carry power, therefore before you speak out, speak in... and test your words!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Don't pay attention to people Who tell you can't do it at lenght. Trusting your own instincts Can lead to what's quintessential. Make their limitation be your strenght. You might as well contradict them And then reach your full potential.” ― Ana Claudia Antunes, A-Z of Happiness: Tips for Living and Breaking Through the Chain that Separates You from Getting That Dream Job"},{"quote":"“Opportunities can become obstacles, same way obstacles can become opportunities; it all depends on how they are being interpreted by the mind of a person.” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“And maybe life isn't as hard as it seems to beEvery day could be a mess , but darling, you seeOne of the few places you will always find peaceOwes its breeze to the constant chaos in the sea...” ― Sanhita Baruah"},{"quote":"“Shine like the sun in a gloomy sky.” ― Debasish Mridha"},{"quote":"“Every morning, appreciate the golden glowing sun for giving you life. Every evening, appreciate yourself for making the world a little more joyful with your lovely presence.” ― Debasish Mridha"},{"quote":"“Quit searching for essence in everything you've gotten wrong. It's right there in everything you've gotten right. Just get better at it.” ― Chinonye J. Chidolue"},{"quote":"“Always strive to be a collaborative self-starter with an optimistic outlook.” ― Germany Kent"},{"quote":"“Find that POSITIVE to hold on to when you're losing control. It will help ground you and bring you clarity.” ― Nancy B. Urbach"},{"quote":"“Invite peaceful space into your life and remove negative energy.” ― Nancy B. Urbach"},{"quote":"“On a cloudy day, be the sun in someone’s sky.” ― Debasish Mridha"},{"quote":"“Nothing can contaminate the purity of my love—not even the dirt of hateful thoughts.” ― Debasish Mridha"},{"quote":"“Still, be positive when things go wrong. It is the Lord that sees your heart in times like these. Hold on to Jesus!” ― Jennifer Aquillo"},{"quote":"“I decided that any food that I didn’t cook myself was good food.” ― Mark Higbee, Zendreo Chronicles The Legendary Zehn Mortalix"},{"quote":"“No obstacle is big enough for optimism.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Optimism outsmart all obstacles.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Inner peace is more important than reacting to other's expectations.” ― Nancy B. Urbach"},{"quote":"“The future may not be clear, but if you take it one step at a time you will make it through the fog.” ― Nancy B. Urbach"},{"quote":"“Your scars do not define you.” ― Nancy B. Urbach"},{"quote":"“Good things tend to come in waves. Keep your head up, they could come today...” ― B.K. Sweeting"},{"quote":"“THE BEST WAY TO OVERCOME NEGATIVE THOUGHTS IS TO BE POSITIVE” ― P.S. Jagadeesh Kumar"},{"quote":"“I am sure we all know this: Efficiency is doing things right & Effectiveness is doing the right things. But, it doesn’t mean doing pointless things perfectly, efficiently or effectively..Let’s be honest, Sweetheart. Sometimes we all are just stuck in juggling with balls. This weekend, take a moment to step back & ask yourself: “Is this REALLY the best way to spend my time?”Please, don’t waste your energy on stuff that doesn’t matter..Darling listen – This weekend, try to be your best version by being effective & efficient in real sense...Stay firm in prayers, be positive, fight for what is yours & wait for your time to come. May you make this weekend amazing & unforgettable! Blessings!” ― Rajesh Goyal, राजेश गोयल"},{"quote":"“The more you rationalize, the more you move farther away from your authentic self.” ― Shannon L. Alder"},{"quote":"“Your mental make-ups are the contents of your everyday thinking; they carry a charge that can either transform, reform or destroy you. Watch your thoughts, they determine your life!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“Be positive in your thoughts, passionate in your words and purposeful in your actions. Clean thoughts, Cool words and Clear actions are the impressions that appeal to success.” ― Israelmore Ayivor"},{"quote":"“Stop and say something good about yourself! Believe what you have just said! Pray for what you have just believed! Have faith for what you just prayed for! Work out that faith! ...and surely goodness and mercy shall follow you!” ― Israelmore Ayivor"},{"quote":"“Vulnerability + Action + Positive Thinking = Courage” ― Shannon L. Alder"},{"quote":"“If you think it is possible, it will be possible. If you think it is impossible, the imposible will be possible. Whatever you think; whether posible or impossible will forever be possible to happen.” ― Israelmore Ayivor"},{"quote":"“Happiness depends less on what happens to us and more on how we view the past positively, enjoy the moment and create the future.” ― Shannon L. Alder"},{"quote":"“Dreams do not bear fruits unless the weather conditions are favourable. Your positive mentality makes your dreams germinate; your actions make them to bear fruits. Take positive actions. Be positively minded.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“God never ends anything on a negative; God always ends on a positive. Because what is negative about going home?” ― Shannon L. Alder"},{"quote":"“The Lord is your shepherd; don’t ever say “I am lost”. He leads you to green pastures; don’t ever say “I am broke”. Let the weak shout; “ I am very very very strong”!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“Don't live by your thoughts only; live by your words also. Whatever plans you think about, affirm it in your mouth first, declare it and you will succeed in working it out! Words can be powerful!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“Positive attitude enables you to go with passion and see possibility in every challenging circumstance. It was by that, that great achievers picked up metal scraps on the floor and saw machines built from it.” ― Israelmore Ayivor, Michelangelo | Beethoven | Shakespeare: 15 Things Common to Great Achievers"},{"quote":"“Every time you read into something you miss the soul, while searching for the motive.” ― Shannon L. Alder"},{"quote":"“Sometimes life may take you down an unexpected path, but keep an open mind, for that may be the exact path you're supposed to be on at that particular point in time.” ― Alicia Emamdee, Aloha Self-Esteem?"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“Positive words come from positive thoughts. It implies, when you open your mouth to talk for people to listen, you have opened your mind for them to read. Think positively; talk positively!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“Positive expectations create a positive life.” ― Debasish Mridha"},{"quote":"“A positive attitude creates a passion that wakes a leader up. To the leader, attitude is more powerful than an alarm clock. Positive attitude in true leadership is what makes an alarm clock unnecessary!” ― Israelmore ayivor, Leaders' Watchwords"},{"quote":"“Life sometimes seem difficult to live and too negative. But, with Allah Almighty every difficult and negative aspect of life becomes enthusiastically easy to live and too positive.” ― Salsabeel"},{"quote":"“You will remain where you are...,until you change your mindset.” ― A.Steve-Ifeoluwa"},{"quote":"“Every morning, wake up with the warmth and the light of the rising sun in your heart.” ― Debasish Mridha"}]
