[{"quote":"“Whenever I am in a difficult situation where there seems to be no way out, I think about all the times I have been in such situations and say to myself, \"I did it before, so I can do it again.” ― Idowu Koyenikan, Wealth for All: Living a Life of Success at the Edge of Your Ability"},{"quote":"“When you work on something that only has the capacity to make you 5 dollars, it does not matter how much harder you work – the most you will make is 5 dollars.” ― idowu koyenikan, Wealth for All: Living a Life of Success at the Edge of Your Ability"},{"quote":"“Today is a new day and it brings with it a new set of opportunities for me to act on.I am attentive to the opportunities and I seize them as they arise.I have full confidence in myself and my abilities.I can do all things that I commit myself to.No obstacle is too big or too difficult for me to handle because what lies inside me is greater than what lies ahead of me.I am committed to improving myself and I am getting better daily.I am not held back by regret or mistakes from the past.I am moving forward daily.Absolutely nothing is impossible for me.” ― Idowu Koyenikan, Wealth for All: Living a Life of Success at the Edge of Your Ability"},{"quote":"“Failure is constructive feedback that tells you to try a different approach to accomplish what you want.” ― Idowu Koyenikan, Wealth for All: Living a Life of Success at the Edge of Your Ability"},{"quote":"“No one learns as much about a subject as one who is forced to teach it.” ― Peter Drucker"},{"quote":"“Acquiring wisdom is great but it is not the goal, applying it is.” ― idowu koyenikan, Wealth for All: Living a Life of Success at the Edge of Your Ability"},{"quote":"“Sometimes it is good to be in uncomfortable situations because it is in finding our way out of such difficulties that we learn valuable lessons.” ― Idowu Koyenikan, Wealth for All: Living a Life of Success at the Edge of Your Ability"},{"quote":"“What is considered impossible is someone else’s opinion. What is possible is my decision.” ― idowu koyenikan, All You Need Is a Ball: What Soccer Teaches Us about Success in Life and Business"},{"quote":"“Seek opportunities to show you care. The smallest gestures often make the biggest difference.” ― John Wooden"},{"quote":"“The job of an educator is to teach students to see vitality in themselves” ― Joseph Campbell"},{"quote":"“A coach is someone who can give correction without causing resentment.” ― John Wooden"},{"quote":"“Teach them the quiet verbs of kindness, to live beyond themselves. Urge them toward excellence, drive them toward gentleness, pull them deep into yourself, pull them upward toward manhood, but softly like an angel arranging clouds. Let your spirit move through them softly.” ― Pat Conroy, The Prince of Tides"},{"quote":"“Coaching 101: First you build the team, and then you build the torture chamber for underperformers.” ― Jarod Kintz, This Book Has No Title"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“In honor of Oprah Winfrey: Even greater than the ability to inspire others with hope is the power to motivate them to give as much to the lives of others as they would give to their own; and to empower them to confront the worst in themselves in order to discover and claim the best in themselves.” ― Aberjhani, Journey through the Power of the Rainbow: Quotations from a Life Made Out of Poetry"},{"quote":"“Nothing is born into this world without labor.” ― Rob Liano"},{"quote":"“Open your eyes that you might see that all things are possible through you (with God's help)” ― Robert A. Schuller"},{"quote":"“Greatness, whether athletic or otherwise, doesn’t come from those content on just being but from those who seek being the difference.” ― Kirk Mango"},{"quote":"“Athletes need to enjoy their training. They don't enjoy going down to the track with a coach making them do repetitions until they're exhausted. From enjoyment comes the will to win.” ― Arthur Lydiard"},{"quote":"“Things that aren't important, that have nothing to do with winning and losing, don't have to be a rule.” ― Peter Richmond, Badasses: The Legend of Snake, Foo, Dr. Death, and John Madden's Oakland Raiders"},{"quote":"“Decision making and problem solving are not the same. To solve a problem, one needs to find a solution. To make a decision, one needs to make a choice.” ― Michael J. Marx, Ethics & Risk Management for Christian Coaches"},{"quote":"“Don't stop at the first obstacle; have endurance to keep on going and you will succeed.” ― Robert A. Schuller"},{"quote":"“There was a time we laughed at the old guys up on the hill. The ones who graduated a couple of years before us, and who would hang around the school and the ballpark still, and would sit on the hoods of their cars and tell us how when they were seniors they did it better, faster, and further. We laughed, because we were still doing it, and all they could do was talk. If our goals were not met, there was next year, but it never occurred to us that one day there would not be a next year, and that the guys sitting on the hoods of their cars at the top of the hill, wishing they could have one more year, willing to settle for one last game, could one day be us.” ― Tucker Elliot"},{"quote":"“Coachable people seek out those who speak truth to them, even if it is a painful truth, because it protects them and it makes them a better person and leader.” ― Gary Rohrmayer"},{"quote":"“Joyfully we undertake our daily work.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Relationships be it dating or marriage, can be viewed as the needle and thread. You cannot sew a fabric with just the needle or the thread. You will need both to get started. It takes patience to thread the needle. The more you learn the technique, the better you will get at it in the future. The same applies to your relationship. Be patient with each other.” ― Kemi Sogunle, Love, Sex, Lies and Reality"},{"quote":"“Learning is retarded in conditions of high anxiety and low acceptance. For most tasks, people have the intellectual knowledge to perform well; they just have a hard time acting on what they know.” ― Tim Gallwey"},{"quote":"“Play and productivity are no longer two separate worlds that rarely meet. They can come together like happy fistfuls of Play-Doh, beautifully blending to reveal the brand-new colors of a meaningful life. You get to play AND do. Play matters. Your life matters. It's time to manifest.” ― Marney K. Makridakis"},{"quote":"“Accessible, tailored coaching is a collaborative journey of growth—in leadership and organizational excellence, it expands perspectives, aligns actions with values, and empowers pursuit of unique potential.” ― Farshad Asl"},{"quote":"“The art of scaling: The art of scaling is subtraction, not addition. The art of scaling is alignment through amplified purpose.The art of scaling is when your idea works even when you’re not there to push it. The art of scaling removes everything slowing you down.” ― Richie Norton"},{"quote":"“Many people have accused me of having a Coach Face. I may not be able to get you to improve your golf game, but I sure will have fun verbally abusing you while you play.” ― Jarod Kintz, To be good at golf you must go full koala bear"},{"quote":"“The ability to self-regulate is important when dealing with stress. The demands of competition, the noise from the stands, and the team dynamics will cause stress for athletes. These stressors will be compounded by the athlete’s personal life and the stress they carry into these performance situations. Overall, athletes will get gripped by stress, whether in a championship game or a mundane practice.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“Breathing is not just a physiological process, it’s a tool for self-regulation and enhanced performance. Individuals can improve their learning, recovery, and overall well-being by understanding how to use breathing techniques effectively.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“Research has also shown that basketball players who miss the first free throw shoot a higher percentage on the second free throw if they receive a high-five for support and encouragement. This phenomenon highlights the power of social touch in creating an environment of connection, security, and playfulness rather than one focused solely on survival.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“Never lose sight of how important you are to others.” ― Julie Fairhurst"},{"quote":"“Some people make their own opportunities. Others need someone to help them know what they want.” ― C.B. Lansdell, The Tidelings of Dras Sayve: A Novelette"},{"quote":"“Ein Nein ist ein Ja zu etwas anderem.” ― Sabine Ramsperger, Raus aus dem Schlamassel"},{"quote":"“If being coachable is to “take advice,” then to be uncoachable is to “reject advice.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“Leaders who grasp a greater understanding of spiritual authority are leaders who come to the coaching relationship with openness, not suspicion, with hope, not hesitancy, and with readiness to be empowered by God and not simply to receive tactical advice.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“A coachable leader knows that every great leader is a strong follower.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“The bottom line is that coachable people are those who consistently take action in order to reach a goal. If a leader is just going to talk and not act consistently, then the leader isn’t ready for coaching and probably not for leadership either.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“Every leader will hit a series of plateaus in their life. The key is to not stay there because settling on a plateau can easily lead to an elongated season of comfort. Being comfortable is one of the leader’s worst enemies.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“Leaders who are ready to be coached bring energy, passion, and vision to the coaching relationship so that they can set life-stretching goals and launch significant organizational changes.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“Coachability is the ability to accept feedback and take advice with courage and the emotional awareness that allows us to grow, mature, and succeed.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“Coachable people seek out those who speak truth to them, even if it is a painful truth, because it protects them, and it makes them a better person and leader.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“Coachable leaders are ready and willing to make the needed changes and adjustments in their lives.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“As we continue to focus on being a coachable leader, we discover that these leaders get better and better at telling the truth to themselves and those who are coaching them. They have learned how to make reality their friend.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“Coachable leaders stick with it even when the going gets tough. They push through the quitting points with a level head.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“Coachable leaders come to a coaching session with an unquenchable desire to improve. They want to improve themselves, their leadership, their relationships, and their ministries or organizations. They reject the status quo, they refuse mediocrity, and they recognize plateaus and push beyond them.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“Much of the work in the coaching process is helping leaders to completely let go of the weight of personal failures, bad ideas, immaturity, and poor execution and helping them to experience the freedom to attack the future knowing God is for them and not against them.” ― Gary P Rohrmayer, Ten Marks of a Coachable Leader"},{"quote":"“A hallmark of wisdom is knowing when it's time to abandon some of your most treasured tools- and some of the most cherished parts of your identity.” ― Adam Grant, Think Again, Atomic Habits and Thinking, Fast and Slow 3 Books Collection Set"},{"quote":"“Valmentajan tärkein tehtävä pelikaudella: luova pelin johtaminen, eli pelaajien peluuttaminen oikein. Individualistinen ajattelu, kollektiivinen ajattelu: mitä paremmat yksilöt, sitä suurempi liikkumavara eri tilanteissa.” ― Alpo Suhonen"},{"quote":"“Valmentajalla ei ole hauskaa koskaan – ollaan tuloksensaavutusimussa, joka ei lopu ikinä.” ― Alpo Suhonen"},{"quote":"“Valmentajan kannattaa olla kiinnostunut ja utelias tieteestä, filosofiasta ja taiteestakin. Matka itseen on matkoista vaikein, mutta urheilu tarjoaa siihen loistavan mahdollisuuden. Aivan kuten taiteella, urheilulla on mielettömät mahdollisuudet luodata ihmisyyttä.” ― Alpo Suhonen"},{"quote":"“Behind every metric is a person.” ― Janna Cachola"},{"quote":"“Coaching is personal.Consulting is organizational.Training is for groups.” ― Richie Norton"},{"quote":"“Coaching is personal. Consulting is organizational. Training is grouped.” ― Richie Norton"},{"quote":"“Coach Kaspar hugged me like a dad, \"My job isn't to make you a winner; my job is to help you see you are already a winner.” ― Aegelis, Definitive Nobody, Derek Barley"},{"quote":"“Are you aspiring to crack competitive exams like JEE or NDA? If so, choosing the right coaching institute is crucial for your success. Vilas Academy is a leading institute offering top-notch JEE classes in Nagpur and a well-structured NDA academy in Nagpur, ensuring students achieve their career goals with the best guidance and mentorship.” ― iclrinku"},{"quote":"“Rapport is closely linked to tact and diplomacy as well as emotional intelligence and good manners.” ― Ms. Hetal Shah, Guide to Executive Coaching"},{"quote":"“Coaching would be easier if telepathy were a thing. Think how good you would be if I could just use my brain to power and maneuver your body.” ― Jarod Kintz, A Memoir of Memories and Memes"},{"quote":"“Wellness coaching transforms dreams of health into daily practices, making the journey to well-being a lived reality.” ― Dr Prem Jagyasi"},{"quote":"“Several years ago I did a TV commercial for Minute Maid where my team came in at halftime after obviously playing well, and I greeted them with a big smile and cookies and nice words. I had to go to Los Angeles two days early just to prepare for that one. I got paid well for it, but the performance should have won me an Oscar.” ― Bob Knight, The Power of Negative Thinking: An Unconventional Approach to Achieving Positive Results"},{"quote":"“If I shine in the light of sun then will I be visible after the sunset? One thing I learnt very early... Because life had decided to hit me hardest. I made a conscious choice to face my own darkness and deep dive because below there swam some dots of light..” ― Ramesh Sood, Untitled Life’s Random Lessons : A tapestry of anecdotes on life, mindset, leadership, communication and relationships."},{"quote":"“Companies don't have a \"talent shortage\" they have a \"development shortage\", the talent you need is within reach, you just need to develop them and/or create roles for them” ― Janna Cachola"},{"quote":"“Leadership is not only what others do when you are there, but also what the team achieves when you are absent, because of what you did when you were there.” ― Luigina Sgarro"},{"quote":"“Everybody wants to be a success. I've never heard anyone say he or she wants to be a failure. No matter what their definition of success might be - and it's different for everybody - everybody wants to be successful.” ― Bob Ladouceur, Chasing Perfection: The Principles Behind Winning Football the De La Salle Way"},{"quote":"“Aimee Mullins, the president of the Women's Sports Foundation, told me recently that 84% of women business leaders in this country say that they were athletes. I'm not surprised: athletics breeds a level of confidence and leadership that can be hard for girls to find elsewhere. Parents act like they want their daughters to be as strong as their sons, but they're much tougher on the boys. Sports, on the other hand, doesn't discriminate. There's no opportunity to cover up anything on the court: you either get it done, or you don't.” ― C. Vivian Stringer, Standing Tall: A Memoir of Tragedy and Triumph"},{"quote":"“You show that unity by dressing like a team, cheering like a team, by winning and losing together like a team.” ― C. Vivian Stringer, Standing Tall: A Memoir of Tragedy and Triumph"},{"quote":"“Everybody looks for an identity; that's human nature - and it's especially true about young people. But that's why the ultimate sacrifice is to give up your individuality for the sake of the team. We can only be successful when everyone understands that the whole is bigger than the sum of its parts, but we will never get there if everyone is looking to carve out a little place for themselves, to steal her own identity at the expense of everyone else.” ― C. Vivian Stringer, Standing Tall: A Memoir of Tragedy and Triumph"},{"quote":"“As I told my players a hundred times, it doesn't matter where you come from, but where you're going; it doesn't matter where you start, but where you finish. And where we finished was at the NCAA championship game, the very first in women's basketball history.” ― C. Vivian Stringer, Standing Tall: A Memoir of Tragedy and Triumph"},{"quote":"“That team might have been badly lacking, but they had the desire to make something of themselves, and that was all I needed. What I'm always looking for is effort, people who are driven to excellence and who will be tireless in their quest to achieve. It is not a sin not to know, as long as I can see that you're willing to learn; I will give you all the guidance you need as long as you'll do what it takes to be prepared. We didn't have strong offensive skills or a lot of talent, but building a strong defense just requires a tremendous amount of hard work, and that was something I could count on from this team.” ― C. Vivian Stringer, Standing Tall: A Memoir of Tragedy and Triumph"},{"quote":"“When I started out as a coach, I never thought for a second that there would ever be so much written or so much said about my work. I had always been driven, but by a love of the game and a sense of responsibility to the teams I coached, not by ambition.I was going to be a gym teacher, and Bill was going to be a gym teacher, too. We were going to have a white picket fence and two children and a dog, and live happily ever after. That's a pretty decent level for us, I thought - more than what our parents had had, for sure, and enough to make them proud.The rest of this - well, who would have guessed?” ― C. Vivian Stringer, Standing Tall: A Memoir of Tragedy and Triumph"},{"quote":"“When I started out as a coach, I never thought for a second that there would ever be so much written or so much said about my work. I had always been driven, but by a love of the game and a sense of responsibility to the teams I coached, not by ambition.I was going to be a gym teacher, and Bill was going to be a gym teacher, too. We were going to have a white picket fence and two children and a dog, and live happily ever after. That's a pretty decent level for us, I thought - more than what our parents had had, for sure, and enough to make them proud.The rest of this - well, who would have guessed?” ― C. Vivian Stringer, Standing Tall: A Memoir of Tragedy and Triumph"},{"quote":"“When players feel threatened and insecure, their survival modes become activated, and they begin to disconnect from the coach, teammates, and themselves. They fear punishment, rejection, and harsh judgments, so they instinctually protect themselves. They might look like they are unwilling to improve, but the reality is that they are just trying to survive.” ― David Durand"},{"quote":"“Adolescence is a period when the social landscape undergoes a massive shift. Suddenly, it’s not just about family, it’s about peers and where one stands in the hierarchy among them. The need for acceptance becomes necessary, and it feels as if one’s survival depends on it.” ― David Durand"},{"quote":"“Why do we love games like sports? Because games are a simplified version of life. They incorporate elements of competition and cooperation, providing a platform for socialization and learning. Games present us with goals to achieve, teammates to collaborate with, obstacles to overcome, challenges to face, unpredictability to manage, strategies to develop, and skills to hone. Importantly, games offer valuable life lessons.” ― David Durand"},{"quote":"“The power of sports is obvious. They are more than just entertainment, they are spaces where we feel a part of something bigger than ourselves. We watch athletes and performers try their hardest to achieve something while opponents try to stop them. They must operate within the rules and boundaries, trying to achieve greatness with resistance pressing them backward. And as we watch these made-up games, we feel connected. This is because, at some level, we understand that these games are not so different from our lives.” ― David Durand"},{"quote":"“The ideal coaching approach focuses on the development of the person behind the player. The essence of performance coaching is to facilitate the growth of individuals into better human beings. This perspective emphasizes the importance of regulation, a skill that helps athletes handle stress by increasing their resilience and adaptability. Coaches should aim to foster adaptable athletes, not programmed robots. We want performers who can handle stress and athletes who can approach their craft with creativity and a sense of enjoyment.” ― David Durand"},{"quote":"“Demanding a player to look the coach in the eyes when they are dysregulated could backfire. The player might not actively disrespect the coach or be unwilling to listen, but their nervous system might be biologically unable to do what the coach wants at that moment in time.” ― David Durand"},{"quote":"“When players feel threatened and insecure, their survival modes become activated, and they begin to disconnect from the coach, teammates, and themselves. They fear punishment, rejection, and harsh judgments, so they instinctually protect themselves. They might look like they are unwilling to improve, but the reality is that they are just trying to survive.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“Adolescence is a period when the social landscape undergoes a massive shift. Suddenly, it’s not just about family, it’s about peers and where one stands in the hierarchy among them. The need for acceptance becomes necessary, and it feels as if one’s survival depends on it.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“Why do we love games like sports? Because games are a simplified version of life. They incorporate elements of competition and cooperation, providing a platform for socialization and learning. Games present us with goals to achieve, teammates to collaborate with, obstacles to overcome, challenges to face, unpredictability to manage, strategies to develop, and skills to hone. Importantly, games offer valuable life lessons.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“The power of sports is obvious. They are more than just entertainment, they are spaces where we feel a part of something bigger than ourselves. We watch athletes and performers try their hardest to achieve something while opponents try to stop them. They must operate within the rules and boundaries, trying to achieve greatness with resistance pressing them backward. And as we watch these made-up games, we feel connected. This is because, at some level, we understand that these games are not so different from our lives.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“The ideal coaching approach focuses on the development of the person behind the player. The essence of performance coaching is to facilitate the growth of individuals into better human beings. This perspective emphasizes the importance of regulation, a skill that helps athletes handle stress by increasing their resilience and adaptability. Coaches should aim to foster adaptable athletes, not programmed robots. We want performers who can handle stress and athletes who can approach their craft with creativity and a sense of enjoyment.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“Demanding a player to look the coach in the eyes when they are dysregulated could backfire. The player might not actively disrespect the coach or be unwilling to listen, but their nervous system might be biologically unable to do what the coach wants at that moment in time.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“When players become disconnected internally, this leads to being disconnected externally.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“Mindful attention to our breath brings us back into CONNECTION, where we can let go of the past so we can re-engage with the present and better prepare for the future. We feel more whole and thus more in control.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“Once status, self-image, and the opinions of others are prioritized above all else, players become increasingly on edge. Performance spaces are seen as dangerous, and players feel threatened by the possibility of not being enough. Once they feel this danger, their playfulness decreases.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“The pursuit of perfectionism and the fear of making mistakes hinder an athlete’s performance and rob them of the joy of play, replacing play with survival.” ― David Durand, B.E.T. On It: A Psychological Approach to Coaching Gen Z and Beyond"},{"quote":"“I make Coach Noises while I sleep. If my yelling wakes you up, you need to sleep harder and stop slacking off.” ― Jarod Kintz, Eggs, they’re not just for breakfast"},{"quote":"“I once taught a duck how to swim. I'm such a good coach that in no time at all it learned how to fly.” ― Jarod Kintz, Eggs, they’re not just for breakfast"},{"quote":"“Parteneriatul non-judicativ reprezentat de relația de coaching devine, astfel, un teren de antrenament al autenticității.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“Datorită delimitării clare de responsabilitate între coach și client, rezultatele acțiunilor clientului se traduc, în timp real, în manifestări ale puterii personale a clientului.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“Detașarea de soluție, în coaching, este o schimbare de paradigmă pentru client, față de reprezentările de autoritate întâlnite deja.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“Autonomia înseamnă a echilibra această pondere, a acțiunilor pe care le facem influențați extern, în cadrul mai amplu al vieții noastre, cu ceea ce reprezintă valorile noastre, influențele noastre, alegerile noastre privind propria existență.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“La fel ca și spațiul fizic, spațiul într-o relație determină măsura în care fiecare persoană permite, prin relație, celeilalte persoane să se desfășoare, să participe, să se prezinte autentic, să comunice, să ofere și să primească.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“Aducerea în discuție, în spațiul sigur al relației de coaching, a acestor legături cauzale care provoacă asumare este una dintre intervențiile cele mai valoroase din coaching, totodată fiind și una dintre cele mai sensibile. Sunt necesare în paralel toate cele trei roluri, de suport, provocare și motivare, întrucât asumarea este o atitudine umană care solicită multe resurse clientului și care implică renunțare la tipare de comportament care sunt deja confortabile și înlocuire cu tipare noi, care necesită învățare.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“Altfel zis, un manager eficient are de învățat în continuu, noi și noi stiluri de lucru, precum și noi și noi abordări, nu atât ca un criteriu de excelență propriu-zis, cât ca un criteriu de supraviețuire, de adaptare la mediul de afaceri.În acest sens, parteneriatul de coaching executiv pragmatic reprezintă o resursă strategică pentru clienții manageri, deoarece spațiul oferit de relația de coaching constituie un teren de antrenament propice învățării accelerate de care este atât de multă nevoie, astăzi.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“Structurarea relației de coaching pe obiective și pe rezultate măsurabile creează clientului context favorabil pentru a învăța să primească feedback, fie prin aprecierea lui proprie, fie prin observarea rezultatelor, fie prin interacțiune cu alte persoane relevante în contextul său profesional.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“Abordarea în coaching a realității în care trăiesc clienții, orientată către soluții, în loc de probleme, către viitor, în loc de trecut, și către acțiune, către ce se poate face, în loc de orientare către justificare și raționalizare a ceea ce nu este posibil, are efectul de a antrena clientului o atitudine a lui față de această realitate, mai pozitivă și mai deschisă către părțile senine ale tabloului, către opțiunile de colorare a secțiunilor întunecate, tocmai pentru că pozitivitatea realistă este, în sine, o atitudine realistă. Și, desigur, pozitivă.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“Pozitivitatea realistă se referă la a lucra cu ceea ce este posibil, ce se poate schimba, ce are potențialul de a fi transformat în acțiune, mai degrabă decât la a lucra cu ceea ce s-a întâmplat deja și poate fi doar analizat, retrospectiv, și concluzionat.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“Pozitivitatea realistă înseamnă a privi problemele ca pe oportunități sau provocări. O problemă nu reprezintă ceva grav și amenințător, ci un prilej de a obține noi rezultate, deci o oportunitate, sau o ocazie de a îți testa și extinde limitele, deci o provocare.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“Orientarea pe locus intern de control lucrează direct cu încrederea intrapersonală a clientului și cu convingerile limitative ale acestuia.În același timp, fiecare sesiune de coaching în sine este, pentru client, un exercițiu de încredere interpersonală, adică un exercițiu de poziționare față de locusul extern de control.” ― Iulia Dobre-Trifan, Provocări și echilibru în coaching executiv pragmatic"},{"quote":"“Coaching 101: First you build the team, and then you build the torture chamber for the underperformers.” ― Jarod Kintz, This Book is Not for Sale"},{"quote":"“Coaching kindles the spirit, weaving wellness into life's narrative for vibrant health and boundless joy.” ― Dr Prem Jagyasi, Dr Prem's Guide - Wellness Tourism"},{"quote":"“There are lots of ways to celebrate achievements. Showing them that you have recognized their efforts will help them feel a sense of accomplishment and pride in what they are doing.” ― Vishal D Baraiya"},{"quote":"“The fundamental attribution error, where we tend to read others’ actions on a negative incline which we directly relate to their character and their personality.” ― Ines Garcia, Sustainable Happy Profit"},{"quote":"“For me in coaching, context must decide the content. It's about the coachee. Yes, yet it's up to the coach to know what would work in a context. Sometimes questions and at others stories or advice or exercises too can be offered to bring home certain points and find solutions...” ― Ramesh Sood"},{"quote":"“In one's life, if one wants to reach the top, then , why one has to be what one is not! Being realistic helps me as a coach. It builds unflinching trust between me and my coachee..” ― Ramesh Sood"},{"quote":"“I was able to control my ego and not let that get in the way of getting what was probably some of the best advice of my life.” ― Binod Shankar, Let's Get Real: 42 Tips for the Stuck Manager"},{"quote":"“As the earth yearns for rain, so does our clime yearns for MEGA leaders” ― Amos Olusegun Ologunleko, Leadership GOT BORN: A practical toolkit for aspiring leaders and mentors"},{"quote":"“Team members need to trust that a leader or coach knows what they are talking about, can develop them in the right ways, has their best interest at heart, and, finally, will enable their personal success alongside that of the team.” ― Scott Clancy, Developing Coaching Leaders: The Fundamentals and Techniques that Make Leaders Extraordinary"},{"quote":"“I assist individuals who want to achieve their goals and dreams in life. I love the grit, struggle. and passion of individuals.” ― Avijeet Das"},{"quote":"“Coaches are not immune to the need for coaching.” ― Syed Aiyaz Uddin, The Digital Marketing Playbook for Coaches By Syed Aiyaz Uddin"},{"quote":"“Having a mentor, at a certain point in your career, is highly beneficial and necessary for some.” ― Robin S. Baker"},{"quote":"“I don't praise or make students feel that they know everything. There is a philosophy behind my training.” ― Avijeet Das"},{"quote":"“Okay, now imagine your flame becoming smaller until it’s just the size of a candle,” Rourke guides me. “Just like turning down the flame on a stove.” Quade speaks up. “Yes, just like that. And now… the air is only a soft breeze.” “And every grain of sand can fall back to its place,” Arden adds. “Now, the water pounding in your veins is settling,” Branden” ― Yve Vale, Hexed"},{"quote":"“As we dismantle the traditional notions of talent, it's imperative to broaden our lens to include the global talent pool—a vast expanse of potential that, when tapped into wisely, can become a cornerstone of our talent revolution.” ― Donna Karlin, Talent Momentum: Attracting Brilliance for Tomorrow's Leaders"},{"quote":"“Coaching ignites the spark within, turning life's embers into roaring bonfires of potential” ― Dr Prem Jagyasi, Dr Prem's Guide - Wellness Tourism"},{"quote":"“I'm wearing a flash drive on a lanyard around my neck, and it looks like a whistle. I'm also wearing a collared green shirt with my BearPaw Duck And Meme Farm logo popping off in orange, so it looks like a school's colors. I look like a coach, and I'm ready to watch you work hard.” ― Jarod Kintz, Ducks are the stars of the karaoke bird world"},{"quote":"“The line between being demanding and being demeaning is as wide as an ocean.” ― Jennifer Fraser, The Bullied Brain: Heal Your Scars and Restore Your Health"},{"quote":"“The athletes and coaches are the team, but the parents and families make it a program.” ― Ken Sayles, Coach, Run, Win"},{"quote":"“...In addition, we are fortunate to teach a sport that emphasizes selflessness, teamwork and response to adversity. In what other sport is there a group hug after every point?” ― Tod Maddox"},{"quote":"“What is the difference between coaching, consulting, and training?Coaching is personal.Consulting is an expertise shared (generally) with an organization.Training is for the many.” ― Richie Norton"},{"quote":"“If you want to have long-term success as a coach or in any role of leadership, having an obsession with your craft is essential.” ― Felecia Etienne, Overcoming Mediocrity: Limitless Women"},{"quote":"“It is thrilling and humbling to realize the impact we coaches have on you, and I am so happy that it was a positive and joyous experience that we shared.” ― Ken Sayles, Coach, Run, Win"},{"quote":"“If you have a dream, don't let it go unfulfilled. Gather the courage to believe in your ability to succeed, and make the necessary plans to make it a reality.\" – Shree Shambav” ― Shree Shambav, Journey of Soul - Karma"},{"quote":"“As I stood there watching the mists softly rise, I wondered what vista could be more beautiful than this. The dense mist obscured visibility at times. The wind howled and roared as it swept through.\" - Shree Shambav” ― Shree Shambav, Journey of Soul - Karma"},{"quote":"“Mother's love is bliss, peace, and a gift or blessing that every child receives. If one loses her, the very essence of life; is taken away from him or her. Mother is an inspiration, a leader, a friend, a philosopher, and a symbol of compassion, kindness, and bravery. We are so grateful and blessed to have a mother like Angel. We haven't seen an angel, but we do live with one. We are too small to express our gratitude, so all we can say is thank you for your efforts. Happy Mother's Day to all the wonderful mothers out there. -Shree Shambav” ― Shree Shambav, Journey of Soul - Karma"},{"quote":"“When making decisions facing VUCA, it all comes down to applying the circle of prudence: explore the memory of your past experience, exercise judgement of the present situation, ask for advice (if applicable), make a decision and act” ― Javier Iglesias, Mindset Wizardry - The Magic Behind Thriving in a Volatile, Uncertain, Complex and Ambiguous (VUCA) World"},{"quote":"“Whatever I knowchanges as I grow..” ― Ramesh Sood, Untitled: Life's Random Lessons"},{"quote":"“Every single day of your life you do about a hundred things you have no interest doing. To get through the day. And it starts with getting up!” ― Carl Lewis"},{"quote":"“An inspiring vision is one you can see, feel, understand, and embrace.” ― Bruce McCombs, How to Be Happy on Mondays: Life Lessons To Acquire Wealth, Health, and Happiness Every Day of the Week"},{"quote":"“If we are to survive the impact, we must shift the frequency of who we are and how we approach our life going forward.” ― Andrea DeWitt, Name, Claim & Reframe: Your Path to a Well-Lived Life"},{"quote":"“Great change is always preceded by chaos and confusion, and our darkest moments have great purpose.” ― Andrea DeWitt, Name, Claim & Reframe: Your Path to a Well-Lived Life"},{"quote":"“It is only when we dare to look inside ourselves that we find the truth to light our way forward.” ― Andrea DeWitt, Name, Claim & Reframe: Your Path to a Well-Lived Life"},{"quote":"“A Gentle Warrior asks hard questions, shares difficult truths, and is never afraid to reveal her deepest fears.” ― Andrea DeWitt, Name, Claim & Reframe: Your Path to a Well-Lived Life"},{"quote":"“The key ingredient of partnership is to stand together to see a way forward.” ― Andrea DeWitt, Name, Claim & Reframe: Your Path to a Well-Lived Life"},{"quote":"“When we stop running from our truths, we can begin to instead look for and claim the hidden treasure within.” ― Andrea DeWitt, Name, Claim & Reframe: Your Path to a Well-Lived Life"},{"quote":"“Wholeness comes not from dancing in sunshine and rainbows, it comes from weathering life’s worst storms.” ― Andrea DeWitt, Name, Claim & Reframe: Your Path to a Well-Lived Life"},{"quote":"“It is only when we slow down, step back, and look at the bigger picture that we find resourceful and visionary solutions closer to the truth of who we are at the core.” ― Andrea DeWitt, Name, Claim & Reframe: Your Path to a Well-Lived Life"},{"quote":"“It is never too late to begin the process of seeing your own duality.” ― Andrea DeWitt, Name, Claim & Reframe: Your Path to a Well-Lived Life"},{"quote":"“When you identify too closely with something that simply isn't true, you shut yourself off from change, new perspectives, and growth.” ― Andrea DeWitt, Name, Claim & Reframe: Your Path to a Well-Lived Life"},{"quote":"“Any conflict that is met with compassion, love, and acceptance leads to freedom.” ― Andrea DeWitt, Name, Claim & Reframe: Your Path to a Well-Lived Life"},{"quote":"“If you want to have long-term success as a coach, or in any role of leadership, having an obsession with your craft is essential. It isn't enough to be knowledgeable about what you do - you have to be hungry for improvement.” ― Felecia Etienne, Overcoming Mediocrity: Limitless Women"},{"quote":"“Fear can be a powerful emotion and it's easy to let it direct your decisions. But, no matter what you choose, remember that YOU are always in control of your destiny. Don't be afraid to be bold and brave - life is whatever you make it.” ― Felecia Etienne, Overcoming Mediocrity: Limitless Women"},{"quote":"“The most successful people are not the ones who have all the answers, but the ones who are willing to ask the right questions and seek out solutions.” ― Farshad Asl"},{"quote":"“Working with the most intimate concerns, desires, and fantasies, and co-creating powerful strategies to remove existing hurdles requires in- depth knowledge and training in the fields of both psychology and clinical sexology. Every client deserves a coach who is well aware of this immense responsibility and has taken the time to invest in a thorough education.” ― Lea Holzfurtner, The Ultimate Guide To Female Orgasm"},{"quote":"“Die Arbeit mit den intimsten Anliegen, Wünschen und Fantasien und das gemeinsame Erarbeiten kraftvoller Strategien zur Beseitigung bestehender Hürden erfordert fundiertes Wissen und eine Ausbildung in den Bereichen Psychologie und klinische Sexologie. Jede Klient:in verdient einen Coach, der sich dieser immensen Verantwortung bewusst ist und sich die Zeit genommen hat, in eine gründliche Ausbildung zu investieren.” ― Lea Holzfurtner, The Ultimate Guide To Female Orgasm"},{"quote":"“Coaching is the only thing where the more someone else practices, the better you get. That’s my kind of hard work. People always ask me, \"Jarod, how come you don't have a Guinness World Record for getting others to do what you aren't capable of doing?\" I tell them I don't worry about awards, because I'm a buy-my-own-trophies kind of guy. Plus, I'm too busy being the greatest duck farmer in history. Then I give them the customer service number to call at Guinness, because that's a good question that demands to be answered.” ― Jarod Kintz, Duck Quotes For The Ages. Specifically ages 18-81."},{"quote":"“I am the Mister Rogers Bannister of swimming coaches for ducks. My services are available in underwater vending machines in ponds all across The Ozarks.” ― Jarod Kintz, BearPaw Duck And Meme Farm presents: Two Ducks Brawling Is A Pre-Pillow Fight"},{"quote":"“Doing something, and regularly, is by far the best way of increasing your chances of being good at it.” ― Mokokoma Mokhonoana"},{"quote":"“You don't need to be a coach to get your ducks to swim. Each is born with the water talents of Michael Phelps, but it's also like they all studied Amelia Earhart's crash course in flying.” ― Jarod Kintz, Duck Quotes For The Ages. Specifically ages 18-81."},{"quote":"“Practice exaggerates talent.” ― Mokokoma Mokhonoana"},{"quote":"“Coaches provide structure, support, and accountability that help clients focus on what they control. Identifying the places where they can make significant changes, instead of focusing on the frustrations beyond their control, enables them to achieve their goals faster.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“A good coach does not worry about letting you grow up right in front of them. Because a good coach knows you will. That's what a coach does; They get you ready and then they let you go.” ― Alexi Pappas, Bravey"},{"quote":"“A pool table is a dining room table, if you wait fifteen minutes after eating to go swimming on it. That's what I tell my ducklings, whom I'm coaching to qualify for The Olympics.” ― Jarod Kintz, BearPaw Duck And Meme Farm presents: Two Ducks Brawling Is A Pre-Pillow Fight"},{"quote":"“1 Minute Wisdom for greater success: The only way you can unleash more of your God-given potential is to STRETCH. Get comfortable, being uncomfortable - outside of your comfort zone. Comfort Zone = Stagnate zone... Outside of your comfort zone, in the stretch zone, is where ALL the development and self-growth magic happens.” ― Tony Dovale"},{"quote":"“The good and the bad, the exhausting and the empowering, the wins and the losses...Every part of leadership has a bigger impact when we're doing it for a greater purpose.” ― Leyda Aleman, SHRM,SCP, The Executive Coaching Guide"},{"quote":"“It’s no coincidence that the Thoughtfully Fit model helps you focus on your choices and control. That’s what coaching does too. From my master’s thesis to my office to the university classroom, this is a training plan grounded in coaching philosophies that work.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“In coaching, we talk about increasing awareness. I’m always working with my clients, to help them pay closer attention to what’s going on within them as well as around them. Why? If we don’t understand our own behavior and the impact we’re having on others, the chances are high that we aren’t showing up thoughtfully.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“As a coach, several foundations are essential. One of the biggest is learning how to ask thoughtful questions. Questions help clients get unstuck, explore their options, figure out what they can control, and take meaningful action.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“People are often surprised that I almost always have my own coach: “Wait, you are a coach. Why do you need a coach?” Well, dentists need dentists, right? My coaches have helped me navigate new jobs, challenging coworkers, and big transitions because of the questions they ask me.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“Anyone can manufacture methods, but it’s hard to manufacture results.” ― Richie Norton"},{"quote":"“Exits are great but it’s better to do it as a choice, not a consequence of bad moda operandi.” ― Richie Norton"},{"quote":"“When work is at the center and home and family is on the fringe, your entire life can fall apart at the drop of a downsizing. Structure your life in such a way that home is at the center and work is on the fringe to protect you and your family.” ― Richie Norton"},{"quote":"“Hendrick Kganyago The employer can, in addition - but not necessarily - be the owner of the organization and its capital. In addition to, at the same time, assuming the risks of innovation and investment.An entrepreneur acts as a representation of the company and holds its legal representation. Therefore, it is the figure that makes the general decisions in the organization, that plans the achievements to be achieved and designs the means to achieve them (business strategy), although it can delegate operational decisions.Hendrick Kganyago The latter is what is called entrepreneurship; incidentally, one of the four factors of production.” ― Hendrick Kganyago"},{"quote":"“Personal growth is not a choice; it is your responsibility.” ― Ramesh Sood www.simplysood.com #simplysood"},{"quote":"“I’ve coached on every type of people problem any individual, team, or organization has ever had. You name it, I’ve coached around it. Problems such asOrganizations that want to change their culture.Teams that don’t succeed because they have turf wars that create silos.Executive leadership teams that are in conflict and aren’t communicating effectively.Leaders and executives who want more confidence to make tough decisions.Managers who have strong technical expertise in their field but have never managed people.Individual contributors who need to be more engaged with their coworkers and teams.My clients come to me with these challenges. Nine times out of ten, those challenges are people problems. I coach them to handle these problems and clear the hurdles, so they have more time and energy to do what matters most to them—earn their yoga certification, be a more present mom, learn to play the guitar—and get back to focusing on the things they do best: their job and their organization’s mission.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“Leadership is about knowing that best of everyone varies everyday...Not all days can turn out to be the same because you cannot be. Ramesh Sood” ― Ramesh Sood , Untitled: Life's Random Lessons"},{"quote":"“In 2004, I was working toward my master’s in organizational development at Pepperdine Graziadio Business School and decided to write my thesis on the effectiveness of life coaching. Two years of extensive research with almost one hundred former US Senate interns showed what I already knew from personal experience. Regardless of age, gender, level of self-awareness, or degree, three months of coaching increased their life satisfaction and improved their personal growth.The key conclusions that emerged from this study include:•Life coaching makes a significant difference in overall life satisfaction.•Coaching is an effective approach to goal attainment and personal development.•Coaching helps clients be more effective in setting concrete, measurable goals instead of being overwhelmed by large tasks.•Asking challenging questions encourages the client to look at a problem in new, creative ways.I knew coaching was effective, and this research proved it.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“After decades of coaching, consulting, and supervising hundreds of coaches with clients, I’ve identified six main types of problems people face in any organization. If you prepare to deal with these six, not only will you solve them faster, but you’ll start to prevent them from happening in the first place. And when you know how to handle these common people problems, you’ll be better equipped to handle any outliers—and you’ll have the capability to take on even larger, unexpected challenges.Here are the top six challenges people bring to coaching:I have so much to do, I can’t even think!I don’t always handle myself the way I’d like.I feel stuck and have no idea how to move forward.I get annoyed when people don’t do what I want them to do.People push my buttons, and I lose it!My boss/partner/child/parent/friend/coworker/pet/neighbor is driving me crazy! (In other words, it’s not me—it’s you.)Which of these six challenges do you identify with? We all have struggles in our life. Heck, some of us will encounter all six of these in any given week!” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“I think you can be considered great, not when you achieve success but when you help others replicate your success.” ― Geoffrey Ocaya"},{"quote":"“Coaching is not impersonal or personal, it is in the center.” ― Aiyaz Uddin"},{"quote":"“If you have a dream, make sure to write it down to see daily in front of you. More you see to it, more you visualize your future to achieve it” ― Narayanan Palani"},{"quote":"“My life changed forever in 2016 when my beloved stay-at-home husband was arrested for sexual assault of a minor. He was dragged out of our home in handcuffs by a SWAT team, never to return.As tempting as it was to collapse, that wasn’t an option—especially for the sake of my two young daughters. Instead, I relied on what I know best: coaching.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“If it is not kept, it was never a commitment..” ― Ramesh Sood www.simplysood.com #simplysood"},{"quote":"“The most important components of leading other people are trust and communication” ― Henry Joseph-Grant"},{"quote":"“As a teacher who was also a runner, becoming a coach of runners was a natural thing to do.” ― Ken Sayles, Coach, Run, Win"},{"quote":"“Good coaches tell you where the fish are, great coaches teach you how to find them.” ― Kobe Bryant, The Mamba Mentality: How I Play"},{"quote":"“DEBES SALIR DE TU ZONA DE CONFORT”, nos adoctrina la Modernidad.A esta altura, ya saben que soy como un salmón que me encanta ir en contra de la corriente y de los eslogans imperativos de turno. ¿Por qué ese ensañamiento tan feroz con la comodidad? Como si fuera algo menor y hasta malo sentirse seguro y a gusto… ¿Acaso lo escribió algún enemigo envidioso?Es más, lograr ese confort quizá sea una de las cosas más difíciles de la vida. Y por supuesto, no hablo precisamente de lujos materiales. Pero si uno se siente bien en donde está ¿para qué salir de ese lugar tan privilegiado y arriesgar el tesoro? Si uno está mal, y no se siente confortable, es más lógico que uno intente cambiar esa situación y se lance a ciegas a cualquier otra cosa. Pero lo opuesto, suena más a un masoquismo histérico e inconformista que a un buen consejo.Por supuesto que entiendo la arenga que hay detrás de este eslogan tan popular en los coaching de época y no digo que no haya que arriesgarse, ni incluso aventurarse. Creo que no hay nada más estimulante que los desafíos difíciles e inciertos. Algunos, hasta arman su zona de confort personal con pinceladas de pura adrenalina. Lo incierto, para ellos, es puro confort. En fin, ustedes también ya se habrán dado cuenta: la vida es una eterna contradicción y lo que sirve para algunos, es nefasto para otros…Les dejo una frase que escribí para mi #libro Observados que nos habla también de estas contradicciones tan humanas. “La insatisfacción es una fuente inagotable, tanto de infelicidad como de progreso. Ironías de la Humanidad.” ― Gonzalo Guma, OBSERVADOS: Más allá de Equinoccio"},{"quote":"“All students may not remember the teachings of their teachers, but they all remember the teachers.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Welcome breeze\"Exclaim fresh leavesAnd Dry, cry\"No please, no please” ― Ramesh Sood, A Little More Than Ordinary: A bouquet of verse in thougths for Thoughtful Hearts"},{"quote":"“Hiring a talented teacher or coach is the closest the rich can get to buying their children talent.” ― Mokokoma Mokhonoana, P for Pessimism: A Collection of Funny yet Profound Aphorisms"},{"quote":"“I promise you, there will be no push-ups. I’m not going to have you run laps. And I definitely won’t have you do any dreaded chin-ups. Your life is the gym and the training ground. Think of it as circuit training for your mind. Allow me to be your coach.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“Words have no meaning if they’re not exposed to action. Action has no power if it’s not interpreted to words.” ― Cindrella"},{"quote":"“If things didn’t work out last year doing them a certain way, you should hire someone who has done it before to teach you how to do it this year.” ― Richie Norton"},{"quote":"“If things didn’t work out last year doing them a certain way, you should hire someone who has done it before to teach you how to do it this year. THIS is the secret of high achievers.” ― Richie Norton"},{"quote":"“You can’t outperform your self-image. You have the choice to take the cap off and stretch yourself and do what’s both uncommon and uncomfortable.” ― Farshad Asl"},{"quote":"“As a coach your job is to help others get stability and courage in their lives - first you need to get it into your life” ― Chinmai Swamy"},{"quote":"“Best Spoken English Institutes in Kochi” ― Ajinorah Institutions"},{"quote":"“A professional coach focuses on profits so that their are in business long enough to help many people.” ― Chinmai Swamy"},{"quote":"“Find out, what are the things that money can’t buy? It means those things are for free to everyone and you have them, or you have access to them. Those things are the most important things in life to have. Use them to your advantage. Use them in your life. Even thou they are free, if you don’t use them . You will lose them. Use what is at your disposal to, get what you don’t have.” ― De philosopher DJ Kyos"},{"quote":"“I am a Paradox: An Eternal Student of Life and a Life Coach.” ― Ramesh Sood"},{"quote":"“When you discover your life assignment, the inner fire automatically results to inner drive.You are inspired from your inside.” ― Benjamin Suulola"},{"quote":"“Saying things using jargon, super phrases and big words to impress vulnerable minds to sell your work is a behaviour that can cause acute harm to your inner space. Mirror always knows. A life lived in deception finally results in super imbalance destroying physical and mental health. Spirit is non-existent there. Need to be super scared of days when one would be alone with only the past to look at..Do things today to create more empowering memories to get stored in the past as useful resources while building a super robust future..” ― Ramesh Sood, Untitled: Life's Random Lessons"},{"quote":"“You have the power to discover new a perspective towards life.The power lies within you.” ― Rhouveyzz"},{"quote":"“Why can't there be more white people coaching each other on their racism?” ― Elena Aguilar, Coaching for Equity: Conversations That Change Practice"},{"quote":"“Collaborate to Innovate” ― Winsor Jenkins, The Collaborator: Discover Soccer as a Metaphor for Global Business Leadership"},{"quote":"“Leadership for me is more about doing. Not in our talk, but in our actions, we demonstrate leadership.” ― Ramesh Sood"},{"quote":"“As coaches we create a safe space for our clients to explore their impossible dream until they realize that it is not impossible at all” ― Sandra Cooze, Journey to Your Self - How to Heal from Trauma: Written by Someone Who Did"},{"quote":"“We have to choose growth. Rarely does growth happen without us becoming intentional.” ― Rachelle Triay, GROW: A COACH APPROACH TO CHRISTIAN GROWTH"},{"quote":"“A single decision is easy to dismiss.” ― James Clear, Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones"},{"quote":"“If you get into the habit of doing a thing in the physical, you will do it every time until you break the “Yes—But!” pattern determinedly; and the same is true in the unseen world of our teams thought process as they learn again and again you will get up to what goals are set before you because every time we surrender to the “Yes—But!” we will come to the point until we abandon resolutely and fail in our leadership.” ― John M. Sheehan"},{"quote":"“My amazing client! Reached out to me about a year and a half ago or so and told me he was working 80 hours a week at his job. We chatted and worked a way to start a new 'stupid idea' on his own. A year later he sold it for 7 figures. Woot! We are working together again.” ― Richie Norton"},{"quote":"“The more you listen and ask discovery questions to learn about the client’s needs, the higher your likelihood to be relevant to the client as you articulate how your coaching helps the client.” ― Coachilly"},{"quote":"“Don't you fear the unknown..?\"\"No..I don't.\"\"What belief makes you say that?\"\"Unknown can be friendly too..\"\"An example?\"\"People. My best friends today were strangers, completely unknown just three years ago.\"\"What about places, circumstances?\"\"Same. Can they really be unknown? What can be different? When you know yourself well, with the confidence to face it because you are prepared, then why fear..\"\"If you are not prepared and it is something you couldn't imagine and it is bad, then?\"\"Then what? We are wired for Fight or Flight response. Choose wisely..\"\"Can it be so simple?\"Now it was my turn to ask -\"Do you believe in reincarnation? Rebirth?\"\"Yes..I do.\"\"Then it's either a new day or a new life. Isn't it?\"He kept looking at me for few moments. \"Do you mean one should not carry fears?\"\"No, I don't say that. You can't avoid fear. It is a natural emotion, a basic one. Let it motivate you. Not hold you. And unknown can be so pleasant too as I said right in the beginning. \"\" Are you telling me that life can be so simple and cool..?\"\"You tell me,\" I asked.Thanks, #simplySOOD\", s/he said.From an interview that NEVER HAPPENED.RS #RameshSOOD #Coaching #StoryTelling” ― Ramesh Sood"},{"quote":"“As a Leader, your decisions affect others even when you decide to do nothing” ― Millycent Mashele"},{"quote":"“Working with a coach is about taking control of your life. And that’s why I love it! Watching people get excited as they figure out solutions to their own challenges or see new pathways for their life is incredibly rewarding.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“People need to feel seen, heard, and valued to have the desire to grow.” ― Marcia Reynolds, Coach the Person, Not the Problem: A Guide to Using Reflective Inquiry"},{"quote":"“You don’t empower people by giving them tasks and homework. Personal power comes from within, when people feel seen, cared about, and respected.” ― Marcia Reynolds, Coach the Person, Not the Problem: A Guide to Using Reflective Inquiry"},{"quote":"“There isn’t one right way to coach; coaching is a spontaneous process between the coach and client.” ― Marcia Reynolds, Coach the Person, Not the Problem: A Guide to Using Reflective Inquiry"},{"quote":"“High quality programs require and foster a norm of continuous teaching improvement.” ― Swen Nater, You Haven't Taught Until They Have Learned: John Wooden's Teaching Principles And Practices"},{"quote":"“If you want to live a good life, live it on your own terms and in your own eyes.” ― Michelle C Kuei"},{"quote":"“The difference between a student and a master is, the master has failed more times than the student has tried” ― Mac Duke The Strategist"},{"quote":"“Avoid interacting with fake people, it's painful for your mind” ― Cindrella"},{"quote":"“Sometimes doing nothing is the only right thing to do” ― Cindrella"},{"quote":"“Winners are those who choose kindness as their attitude, cheerfulness as their personality, and happiness as their path” ― Cindrella"},{"quote":"“Reality is what we choose to believe” ― Cindrella"},{"quote":"“Giving up on something means you have the right to own it. If you don't have that right don't fool yourself” ― Cindrella"},{"quote":"“Sometimes when you get hurt, you'll be able to forgive, but not forget. Be honest with yourself” ― Cindrella"},{"quote":"“Doing the right thing supposed to make you feel better, if not, it's definitely not the right thing” ― Cindrella"},{"quote":"“There's no cure for bad-hearted people unless they admit it” ― Cindrella"},{"quote":"“Memories are beautiful because they (are) memories.Reviving them ruins your life's journey” ― Cindrella"},{"quote":"“You're a victim only if you choose to be.” ― Cindrella"},{"quote":"“Train your brain to understand the importance of your dreams” ― Cindrella"},{"quote":"“Some people are able to find the beauty in everything; they're meant to change the world” ― Cindrella"},{"quote":"“True happiness is permanent. It doesn't vanish if the cause is gone” ― Cindrella"},{"quote":"“If you're not playing the main role in your own story, you're probably living someone else's life” ― Cindrella"},{"quote":"“Success is a state of min, but it needs your effort to become a fact” ― Cindrella"},{"quote":"“Sometimes it will take a long time to reach your destination, but you have to keep trying” ― Cindrella"},{"quote":"“Leaders don't fight to stay on top, they fight for others to lift them up” ― Cindrella"},{"quote":"“Success is a state of mind, but it needs your effort to become a fact” ― Cindrella"},{"quote":"“Breakdown your aim into small achievable goals in order to reach it” ― Cindrella"},{"quote":"“No matter how you feel right now, tomorrow is another day. Live it and win it” ― Cindrella"},{"quote":"“Business models and pricing strategies are essential...pair them with lifestyle models and you have the formula I teach to entrepreneurs worldwide.” ― Richie Norton"},{"quote":"“Manipulation is a smart defense mechanism, honest people choose to be stupid in these situations” ― Cindrella"},{"quote":"“Don’t count on others’ love for you. If you inadvertently lose their respect, they will intentionally spare you out of their lives” ― Cindrella"},{"quote":"“Moral dilemmas are not to test your manners, but to teach you a good lesson. It’s your choice to understand it or not” ― Cindrella"},{"quote":"“Greatness isn't found in your comfort zone.” ― Sharon Pearson"},{"quote":"“There comes a point when we have to say, I'm here to love my life, and to figure out who I am...Not who you think I should be” ― Sharon Pearson"},{"quote":"“Success is about handling the setbacks, problems and mess, over and over.” ― Sharon Pearson"},{"quote":"“I built success in business when I stopped focusing on me and started focusing on helping others.” ― Sharon Pearson, Disruptive Leadership: Four Simple Steps to Creating the Winning Team"},{"quote":"“We're not here to hide under fears. We're here to do cool shit despite them.” ― Sharon Pearson"},{"quote":"“When you accept you have to rescue yourself, then you're adulting.” ― Sharon Pearson"},{"quote":"“Extraordinary people are ordinary people making extraordinary decisions.” ― Sharon Pearson, Disruptive Leadership: Four Simple Steps to Creating the Winning Team"},{"quote":"“Because of nothing but training, some people can effortlessly do something we cannot do even terribly.” ― Mokokoma Mokhonoana"},{"quote":"“Coaching should be a process of inquiry, not a series of questions.” ― Marcia Reynolds, Coach the Person, Not the Problem: A Guide to Using Reflective Inquiry"},{"quote":"“Self-care is allowing yourself to appreciate the moment for what it is, instead of wishing it was something else.” ― Sharon Pearson"},{"quote":"“It isn't the challenge that defines you. It;s what you do with it.” ― Sharon Pearson"},{"quote":"“Your challenges have been designed especially for you.” ― Sharon Pearson"},{"quote":"“Success is not a goal. It's a choice.” ― Sharon Pearson"},{"quote":"“It will never get easier. Start. This moment is as goof as it gets.” ― Sharon Pearson"},{"quote":"“Followers accept answers. Leaders ask questions.” ― Sharon Pearson, Disruptive Leadership: Four Simple Steps to Creating the Winning Team"},{"quote":"“A masterful coach is a leader who by nature is a vision builder and value shaper, not just a technician who manages people to reach their goals and plans through tips and techniques. To be able to do this requires that the coach discover his or her own humanness and humanity, while being a clearing for others to do the same.” ― Robert Hargrove, Masterful Coaching: Inspire an \"Impossible Future\" While Producing Extraordinary Leaders and Extraordinary Results"},{"quote":"“Here's the thing about beliefs; we all have them and they drive our actions. We experience our beliefs as truths, and we can usually find evidence to support them. Subsequently, they create boundaries around what we think we can and can't do, what can and can't be done in the world. Some of our beliefs are tucked into our subconscious, where they operate without our awareness. Sometimes our beliefs contradict each other or our core values. Some of our beliefs make us strong, powerful people; some do not serve us. The good news is that beliefs can be updated or changed.” ― Elena Aguilar, The Art of Coaching: Effective Strategies for School Transformation"},{"quote":"“The best help you can get is someone who genuinely cares and knows how to help you get what you don’t even know you want.” ― Richie Norton"},{"quote":"“If you want to inspire someone, give them a vision of their future self.” ― Josh Steimle"},{"quote":"“A few minutes wasted regularly can amount to over a year within a decade.” ― Mokokoma Mokhonoana"},{"quote":"“You don’t have to have all the answers. You are a good coach if you share what you hear and see others express with no attachment to being right.” ― Marcia Reynolds, Coach the Person, Not the Problem: A Guide to Using Reflective Inquiry"},{"quote":"“Coaching mastery isn’t just about improving skills; mastery also requires that you quickly catch internal disruptions and shift back to being fully present with your clients.” ― Marcia Reynolds, Coach the Person, Not the Problem: A Guide to Using Reflective Inquiry"},{"quote":"“Responsibility is the joy of knowing that you can find a way.” ― Sharon Pearson, Ultimate You: When you know you can't ignore the whisper inside that says... It's your time..."},{"quote":"“Leadership is an inside job before it is about others.” ― Sharon Pearson, Disruptive Leadership: Four Simple Steps to Creating the Winning Team"},{"quote":"“Leaders see the opportunities beyond what's done to what's possible.” ― Sharon Pearson, Disruptive Leadership: Four Simple Steps to Creating the Winning Team"},{"quote":"“Don't compromise to make people comfortable. Be the example.” ― Sharon Pearson, Disruptive Leadership: Four Simple Steps to Creating the Winning Team"},{"quote":"“People want to know they matter. They want to know they make a difference. They wan to connect with their authentic selves and they want to experience joy.” ― Sharon Pearson, Becoming A Successful Coach Ultimate Guidebook"},{"quote":"“We are stronger for knowing each other, braver because we trust each other, wiser than when we're alone.” ― Sharon Pearson, Disruptive Leadership: Four Simple Steps to Creating the Winning Team"},{"quote":"“Productivity (is) Process Driven” ― Vince L. DeSalvo"},{"quote":"“Few things make me as happy as seeing my clients years later living out the dreams we once spoke of and designed strategies to fulfill.” ― Richie Norton"},{"quote":"“If you want to get better, get coached.” ― Joseph Deitch, Elevate: An Essential Guide to Life"},{"quote":"“I'm often called in as a coach and speaker to motivate staff, teams, the public and leaders. The key to this is simple; you cannot truly, deeply and sustainably motivate anybody until you know what their motives are...what motivates them...?” ― Rasheed Ogunlaru"},{"quote":"“Praise someone today and you’ll unleash their potential forever.” ― Farshad Asl"},{"quote":"“We become conditioned by repeating patterns that become routine. Those routines become habits and habits eventually may become addictions. The challenge, is to strive hard and change so that you can unlearn and learn while taking risks and making choices that do not allow you to become stuck or become an addict of your own habits.” ― Kemi Sogunle"},{"quote":"“If commitment is required to start, it is deeply important to persist to reach the end. All the path is done walking, where there are obstacles, go around them, where there are falls, get up, where you feel tired, rest, but never stop until you reach the destination.Tania Tome (C)” ― Tania Tome"},{"quote":"“All coaching is, is taking a player where he can’t take himself.” ― Bill McCartney"},{"quote":"“During one of our sessions I had the feeling that the therapist was trying to lead me to some major insight that might help save the day for me. When I asked if that was the case, she acknowledged it, but when I asked if she would be willing simply to tell me in some many words what the insight was, she demurred. That was not the sway psychotherapy worked, she said. It was something I would have to come to on my own if it was to have any real value for me, she said, or something like that. But then as the end of the hour drew near, she relented and put into words what it was she had been trying to lead me to see. There was nothing in the world just then that I was more fascinated to hear - for all I knew my recovery itself might depend on it - but even later that same day I couldn't have told you what she said nor could I possibly tell you now. I was simply not ready to hear it yet. The words I could hear all right, but in terms of their meaning I was as deaf as my mother before me, and possibly, like her, because I chose to be deaf. Possibly I was not ready to be well yet either.” ― Frederick Buechner, Telling Secrets"},{"quote":"“Life is like a served meal God hands over to you (think of it as a plate of steak). He marinates it with life and breath. The journey will depend on how you write your recipe and cook the meal. The outcome will determine what happens to you in life...the choices and the consequences. I bet you would not want to eat a burnt meal daily. Hence, you learn to prepare the meal in a way it serves you...it can either be healthy or not!” ― Kemi Sogunle"},{"quote":"“Leaders who listen, look for, and uncover other's strengths create capacity and commitment.” ― Chris Hutchinson, Ripple: A Field Manual for Leadership that Works"},{"quote":"“The success of a leader is determined by how much he or she can positively enable others.” ― Chris Hutchinson, Ripple: A Field Manual for Leadership that Works"},{"quote":"“Don’t be afraid to be afraid, have the courage to face fear, and jump - there are lots of great things that happen when we decide to take risks.\"(C)(P) Tânia Tomé” ― Tania Tome"},{"quote":"“Gift last for few days, guidance last forever.” ― Amit Kalantri, Wealth of Words"},{"quote":"“If we are aware and observant, we get a wake-up call early in our journey as coaches, a bit of a rude awakening as we bump into the reality that the greatest tool we need to cultivate is our self.” ― Pamela McLean, Self as Coach, Self as Leader: Developing the Best in You to Develop the Best in Others"},{"quote":"“Catch me in a light, which once lit, will never dim. The better your practice, the brighter the flame.” ― Roman Shtrom"},{"quote":"“If you lack motivation, I can't help you with that. That's your problem to solve.” ― Stan Efferding"},{"quote":"“Imperfect action beats perfect planning.” ― Sharon Pearson, Ultimate You: When you know you can't ignore the whisper inside that says... It's your time..."},{"quote":"“Your inner voice is the most powerful coach you will ever have.” ― Toni Sorenson"},{"quote":"“Have fun, and learn something.” ― Stanley Gordon West, Blind Your Ponies"},{"quote":"“When you’re a coach or athlete and you win a championship, you realize that the championship was really a work-in-progress. What you went through during the pre-season, in the regular-season and then during the post-season enabled you to win a title. I treated the stages of my cancer treatment as the phases of a championship season, and it kept me on track to accomplishing my ultimate goal.” ― Joe Marelle"},{"quote":"“One of the things that can help people with cancer is having something that you really look forward to doing, so that you can focus on that while the treatments are going on. I guess it’s like saying, ‘I have unfinished business left before I die.” ― Joe Marelle"},{"quote":"“I would tell someone who’s battling cancer to write down the five toten things that you look forward to doing with the rest of your life. In other words, your future should be the focus. For example, ‘I want to see my grandchildren,’ or ‘I want to take that trip.’ You’ve got to find something to look forward to that will give you strength. You want it to draw you like a magnet. If you don’t try to self-motivate yourself through positive thoughts, cancer will win because it’s not easily defeated.” ― Joe Marelle"},{"quote":"“In my case, the stats that were being quoted to me were not about me personally. I’m not a stat, I’m a person. I considered myself a ‘stat breaker.” ― Joe Marelle"},{"quote":"“You’ve got to have dreams.If you don’t continue tohave dreams, then you’reonly defeating yourself. Ifyou continue to follow your dreams, you’re going to succeed.” ― Joe Marelle"},{"quote":"“As a start-up writer, there is need for you to define your area of interest. You should know what inspires you to becoming a writer. Choose what interests you most and make it your pathway to achieving your dream, then work on it. Both fiction and nonfiction writers have everything in common- they are writers, authors, and the both achieve greatness and influence when they write prolifically.” ― Godspower Oparaugo, The ABC of Writing: The Simplest Method to Write Books"},{"quote":"“At the beginning, you need no support other than your pen and paper to write down the ideas that your brain is ready to supply you at any given time.” ― Godspower Oparaugo, The ABC of Writing: The Simplest Method to Write Books"},{"quote":"“Coaching is the Universal Language of Change and Learning.” ― CNN"},{"quote":"“Coaching, so you are no longer needed.” ― Steve Chandler, Hands Off Manager: How to Mentor People and Allow Them to Be Successful"},{"quote":"“Lead by the choice you make, not the cheques you make.” ― Janna Cachola"},{"quote":"“We grow our capacity to operate masterfully by first gaining a true sense of the self we are living in.” ― Pamela McLean, Self as Coach, Self as Leader: Developing the Best in You to Develop the Best in Others"},{"quote":"“What you're wiling to do today is what you'll be willing to do tomorrow.” ― Sharon Pearson, Ultimate You: When you know you can't ignore the whisper inside that says... It's your time..."},{"quote":"“A good coach can change a game. A great coach can change a life.” ― John Wooden"},{"quote":"“When you fall short of your goals and dreams ask yourself is it your mindset, perspective, expectations, effort, approach, acceptance, company or a blend of these that needs to change.” ― Rasheed Ogunlaru"},{"quote":"“El futuro no existe, es sólo un resultado, el resultado de la persona en que te conviertes” ― Francisco Alcaide Hernández, Tu futuro es hoy: 46 claves para crear tu destino (Alienta)"},{"quote":"“Inspiration may come from many places but motivation - the love of life, daily drive and the will to thrive - that must come from you from within” ― Rasheed Ogunlaru"},{"quote":"“You cannot operate from a place of love when you are emotionally unstable.” ― Kemi Sogunle, Beyond the Pain by Kemi Sogunle"},{"quote":"“The essence of one life is empowering another life, and so your passion has to be linked to the liberation of other people’s happiness.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“The Five C's of Coaching: 1- Clarity 2- Communication3- Collaboration 4- Commitment 5- Culture” ― Farshad Asl"},{"quote":"“Education makes your maths better, not necessarily your manners.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Las relaciones con otros son espejos de la que llevamos adentro, con nosotros mismos, muchas veces en piloto automático.” ― Mía Astral, El libro de las relaciones: Una guía para amar sin enloquecer en el intento (Autoayuda)"},{"quote":"“Tu vida no mejora por azar, mejora por cambiar. Si quieres que tu vida mejore, tú tienes que mejorar” ― Francisco Alcaide Hernández"},{"quote":"“Millennials don't want to be managed, they like to be led, coached and mentored. This generation is on fire and ready to go. Are you ready to change the world?” ― Farshad Asl"},{"quote":"“Behind every successful athlete there is a responsible coach.” ― Paul Bamikole"},{"quote":"“Tu desarrollo personal es tu destino” ― Francisco Alcaide Hernández, Aprendiendo de los mejores: Tu desarrollo personal es tu destino"},{"quote":"“Though the legs of a football coach are never so active on the field of play during playing time, his mind is the best or worst player on the pitch!” ― Ernest Agyemang Yeboah"},{"quote":"“Reality is based mainly on knowledge, what you do not know doesn't exit for you.” ― Dr. Lucas D. Shallua"},{"quote":"“It’s really simple. Sell high-value stuff to people who value high-value stuff.” ― Richie Norton"},{"quote":"“The Bible will guide you. It will be a light unto your path.” ― Michael J. Marx"},{"quote":"“A good Coach asks great questions to help you remove the obstacles in your mind and to get you back on track in life” ― Farshad Asl"},{"quote":"“Effective coaching builds awareness and removes the excuses. Coaching will help you replace those excuses and limiting beliefs with empowering dreams, and boost your self-confidence. Coaching can help you identify your values, discover your “why,” set goals, increase your self-esteem, and find a balance in life and business.” ― Farshad Asl, The \"No Excuses\" Mindset: A Life of Purpose, Passion, and Clarity"},{"quote":"“An effective follow-up system is the key to an effective coaching process, which will lead to significant behavioral changes. True success is in the follow-up.” ― Farshad Asl"},{"quote":"“Coaching is like a magic mirror, reflecting what you are thinking, feeling and saying about everything in life. By working together, you'll understand your own mirror and change it to become limitless.” ― Sultan Alsasi"},{"quote":"“I ask managers, \"What exactly is it you manage?\" Although they say manage people, the truth is that managers today spend most of their time managing processes, projects, data, problems and information. If you don't have a defined process that moves your people forward so they can achieve GREATER RESULTS, then what is it you are managing? You're managing the status quo.” ― Keith Rosen, Coaching Salespeople into Sales Champions: A Tactical Playbook for Managers and Executives"},{"quote":"“People never remember who helped them conquer their dreams. When they truly achieve a lot, they often forget me easily. I’ve noticed the same behavior in both children and adults, and even in family members. And it’s kind of interesting that they forget easily once taking ownership of their newly owned skills. Probably, if they remembered, they wouldn't take them as their own. They would probably not even comprehend them. That's why I believe that, if you wish to change the world, you have to do the opposite, you have to not need it. Because, if you are really good, people will never appreciate you, and you will disappear into a world that merely reflects you better. You will dissolve into the world. The most enlightened individuals are never remembered by history because they have dissolved themselves into the world. There’s no salt in their water, because the salty water has made them vanish from our records. We have neglected them from our history. That’s why a person can't bet egotistical and help others too. One thing has to give in. You either want to be humble and enlighten the world, or you want to be appreciated and reflect the darkness in the world. The most arrogant and admired people have a special kind of ignorance that the ignorant cannot see. The most humble people, have a special kind of wisdom that only the most enlightened or highly diabolical can feel. They make the soldiers of Satan tremble in fear, and the angels of God rejoice in their never-ending uplifting energy. The masses, however, will never know their prophets, not even when they are speaking to one.” ― Robin Sacredfire"},{"quote":"“Success is CHOICE, not CHANCE” ― Ben Burlinson"},{"quote":"“Earning is a product of learning. You're only one letter away from earning more.” ― Richie Norton"},{"quote":"“To me they were all equal, and without people a business was just a building.” ― Mark Bradford, Alchemy for Life: Formulas for Success"},{"quote":"“You must be personally reliable before you can coach your team to generate reliable results.” ― Lee Colan"},{"quote":"“Coaching is one of the most effective leadership styles that can transform, empower and unlock people's potential. Ask more, advice less, elevate your impact forever.” ― Farshad Asl"},{"quote":"“Experienced managers interview to \"Qualify\"... inexperienced managers interview to \"Disqualify.” ― Mark W Boyer"},{"quote":"“Coaching is like a magic mirror, reflecting what you are thinking, feeling and saying about everything in life. By working together, you'll understand your own mirror and break all the boundaries to become limitless” ― Sultan Alsasi"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“Every great athlete, artist and aspiring being has a great team to help them flourish and succeed - personally and professionally. Even the so-called 'solo star' has a strong supporting cast helping them shine, thrive and take flight.” ― Rasheed Ogunlaru"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“At the end of the day, if you’re wasting your time by not investing in yourself, you’re going to waste away—and that would be the greatest waste of all.” ― Richie Norton"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“What kind of world is it, Ben thought, that lets its coaches die without his boys around him, buying him Cokes, calling him by his first name, and rubbing his shoulder with Atomic Balm? He died without a face in a room I never saw without my kisses in the stained gauze or without my prayers entering the center of his pain. But worst of all, O God, you let him die, let Coach Murphy die, let Dave die, without my thanks, my thanks, my thanks.” ― Pat Conroy, The Great Santini"},{"quote":"“On athleticism, God knows no favor. It seems rather he is in the business of teaching winners how to lose and losers how to win.” ― Criss Jami, Healology"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“In the cult, the people in power dictate what cult members are to do. Children raised in cults are systematically stripped of their own autonomous power and forced to feel powerful only in the destructive context allowed by the cult, and always under the power of the leader. Ritual abuse survivors have had to learn to be outer oriented - to perceive what is expected of them and do that, whether it is healthy for them or not. When a therapist creates a context in which he or she is the leader, and the client is to listen, learn, and follow what the therapist says, the therapist has inadvertently replicated the power system of the cult.That is not to say that the therapist has no power; the therapist has a lot of power, but the power the therapist has resides in authority based upon his or her expertise, knowledge, training and sensitivity. The point is to use this authority in a way in which the client can also begin to feel his or her own authority, and begin to develop a healthy feeling of power.The word used quite often now is \"empowerment.\" How do you empower a client?” ― Lynette S Danylchuk"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“The individual great spirit and great efforts create a great team.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"},{"quote":"“Make a decision or life will make it for you!” ― Natasha Nurse"},{"quote":"“Rise from the ashes and become the phoenix. Let your glory and wisdom keep blazing on forever. This is your chance. This is your time. Remake your life into something truly spectacular.” ― Dilip Bathija, The Superhero Soul: Quest for Inspiration, Happiness, Success and Greatness"},{"quote":"“You have to respect a person for what he can do, and you can’t judge him to the fella who shoots ten people who feels nothing, goes to jail and come out and shoots ten more. You have to make people feel that whatever you are good at, we appreciate and respect you for that. Scrooge, former leader of the Rebellion Raiders street gang that once boasted of having some ten thousand membersRespecting people, coaching, gang recruitment, gang membership, gang leaders, street code, street life, gang involvement, team members, self-esteem, self-confidence, feeling respected, feeling wanted, feeling good feeling apart, Rebellions-Raiders, Rebellion RaidersYou have to respect a person for what he can do, and you can’t judge him to the fella who shoots ten people who feels nothing, goes to jail and come out and shoots ten more. You have to make people feel that whatever you are good at, we appreciate and respect you for that. Scrooge, former leader of the Rebellion Raiders street gang that once boasted of having some ten thousand members” ― Drexel Deal, The Fight of My Life is Wrapped Up in My Father"},{"quote":"“Get Fired Up About Your Life Because If You Don't Who Will?” ― Coach Dave"},{"quote":"“It does not need to be perfect - or technically correct - to be magic” ― Rasheed Ogunlaru"},{"quote":"“Coaching is the universal to connect with people, helping them to develop a new perspective, while expanding their inner beliefs and boundaries, equipping them to become the best version of themselves.” ― Farshad Asl"},{"quote":"“Coaching is a service. We serve our clients and have their well-being as the higher priority.” ― Michael J. Marx, Ethics & Risk Management for Christian Coaches"},{"quote":"“A fake is a copy, a duplicate, a facsimile of an original. The professional coach is authentic - the real deal.” ― Michael J. Marx, Ethics & Risk Management for Christian Coaches"},{"quote":"“Good decision making is the result of years of experience making and learning from one's choices - good and bad.” ― Michael J. Marx, Ethics & Risk Management for Christian Coaches"},{"quote":"“I will always respect Mr. Charles chuck Mackey for the way he dealt with me. His approach was not hostile, rather his approach was one, “Look here, I’m working with you, so I need you to work with me.” He showed me first that he had my back, and it was easy for me to do the same for him. Mr. Mackey was well known in the entire school as a no-nonsense but fair person. There are some school administrators that aren’t intimidating at all, but with Mr. Mackey, it was totally different. When we saw him, even if we were not doing anything wrong and our uniform was intact, we still tend to avoid him by going in a different direction. His presence alone demanded that kind of respect.” ― Drexel Deal, The Fight of My Life is Wrapped Up in My Father"},{"quote":"“Quédate con lo aprendido y olvida lo sucedido.” ― F.J. Sanz"},{"quote":"“An authentic coaching relationship gives the client personal choice and control.” ― Michael J. Marx, Ethics & Risk Management for Christian Coaches"},{"quote":"“The Christian coach keeps ethics in perspective by aligning his principles and values with his biblical worldview, endeavoring to see things from God's point of view.” ― Michael J. Marx, Ethics & Risk Management for Christian Coaches"},{"quote":"“Nevertheless, the Holy Spirit brings peace to your mind and heart as you uncover and make the right choice and align yourself with professional, ethical standards.” ― Michael J. Marx, Ethics & Risk Management for Christian Coaches"},{"quote":"“A moral dilemma can be large or small, important or inconsequential, urgent or secondary. One thing is certain: moral dilemmas are ever present.” ― Michael J. Marx, Ethics & Risk Management for Christian Coaches"},{"quote":"“Even in the growth mindset, failure can be a painful experience. But it doesn't define you. It's a problem to be faced, dealt with, and learned from.” ― Carol Dweck"},{"quote":"“To truly motivate others 1) discover what their motives, desires & drivers are 2) genuinely connect with and support them from the heart.” ― Rasheed Ogunlaru"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“¿Cuando fue la última vez que tomaste una decisión capaz de cambiar toda tu vida para bien o para mal?” ― Violet Florence Martin, El Mapa de la Autoestima"},{"quote":"“Every leader will hit a series of plateaus in their lives. The key is not to say there, because settling on a plateau can easily lead to an elongated season of comfort. Being comfortable is one of the leader's worst enemies” ― Gary Rohrmayer"},{"quote":"“Every individual must be given the opportunity to unearth his/her highest potential.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Leaders empower individuals by building trust and coaching competence in their job roles and networking skills.” ― Kenneth H. Blanchard, Collaboration Begins with You: Be a Silo Buster"},{"quote":"“It takes persistent practice to be skilful in the act.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“You have a choice, you either give it your best, or alternative you give up. Don't look back upon your life with regret, make the changes you want and make them now!\".” ― Darren Housley"},{"quote":"“Reject anything advice, which does not lead to your personal progress.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Mentorship is simply learning from the mistakes and mastery of a successful person in his/her field.” ― Bernard Kelvin Clive"},{"quote":"“#Leadership is not how much you can take away from others,it is about how much you can inspire,teach and build others by example ~bns” ― Bluenscottish"},{"quote":"“Think about what you want to look back and say. Then choose your mindset.” ― Carol Dweck, Mindset: The New Psychology of Success"},{"quote":"“Self-reliance is an America virtue but not a biblical value. Solomon wrote, \"The way of fools seems right to them, but the wise listen to advice.\" (Proverbs 12:15) The word 'listen' carries with it the meaning of seeking out as well as receiving advice. A lot of pain can be prevented if leaders would just check in with their coach before a making a big decision.” ― Gary Rohrmayer"},{"quote":"“He who want to be served must first know how to serve.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“I did not know of any single soul who succeed in life without a mentorship.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Good training is priceless.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Great mission lies ahead of us.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“With great inspiration, every man can reach their highest potential.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Great souls are great inspirers.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“We can all rise to a higher divine-self with encouragement.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“A leader in 10 minutes can unlock your potentials which in reality would have taken you 10 years to do without them.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Tell me, who in this life, were never guided in course of their realization of their goal?” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Best coaches never tell their athletes that they are wrong.They rather focus on creating awareness.” ― Abhishek Ratna, No Parking. No Halt. Success Non Stop!"},{"quote":"“The person being coached is not lacking, they simply need someone to tap on their microphone and turn up the volume so they can hear their own sound.” ― Suzette Hinton"},{"quote":"“When a leader is at their limit the last thing they want to hear is that they need to change even more. Maintaining good rhythms of rest, exercise and fun create more energy for a leader to be willing and open for change.” ― Gary Rohrmayer"},{"quote":"“We were motivated by our mentors to go an extra mile.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Mentoring is passion for skills and knowledge-transfer to young people” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“What is so unique about coaching female business executives is the fact they approach taking executive business decisions the same way they approach matching two pieces of cloths they will wear going to a cocktail party or to a classic concert . To my surprise this turned to be something that teaches me deeper business dimensions male executives are not privileged with.” ― Sameh Elsayed"},{"quote":"“Self-help and those stupid proverbs, they do nothing. Soul food? It’s like trying to cure starvation with a sugar cube. It might taste sweet on the lips but once it dissolves, the emptiness is still there.” ― C.SeanMcGee, Dark Side of the Moon"},{"quote":"“Everybody is living for a purpose, you might turn out to be significant or insignificant depending on the kind of message you are feeding the world with.” ― Michael Bassey Johnson"},{"quote":"“I truly believe that success is determined not on Friday nights during games but rather in practice away from the lights and glimmer where coaches and players only have each other, their sweat, their discipline and their loyalty to each other. It is at practice where the boys of America become men through hard work, dedication and perseverance.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“I think we had to hit rock-bottom in all facets of the program before we could ever start moving in a positive direction.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“The development of the “We Believe” philosophy must be real and not cosmetic. Everyone must buy in and understand that it is not a motivational tool, but rather something very personal that should be lived and that all must believe in order for true success to be achieved.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“It is important for coaches to mentor young people toward those things that are most important in life and aid them in creating their own order of priorities to live by.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“Nothing in life that is of value comes easy. If good things came easily then the value would be diminished. When we have a vested interest, when we give everything we have, then, and only then are those good times valuable.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“Before success can truly become routine, there must be that transition from that wanting/hoping to have success toward honestly knowing you can earn success with your talents and work ethic.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“I teach our young men that respect is earned each day on the practice field, in the classroom, and how each young man lives his life.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“• “…it is easy to read that this game is more than just a game, it is a culmination of a group of coaches and boys on a mission to not just experience, but rather to achieve something that only they believe is truly possible.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“We live in a society that only embraces success and that is who we are. It takes a great deal of inner strength to deal with the time commitment of coaching when very little seems to be accomplished.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“Coaching is like riding a roller coaster with many ups and downs. The true test is weathering the storm. The average length of time anywhere in America that a man is a head high school football coach is three years.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“Teams that spend a lot of time learning the tricks of the trade will probably never really learn the trade.” ― Yuri Boganov"},{"quote":"“Great Leaders develop through a never ending process of self-study, self-reflection, education, training, and experience” ― Tony Buon, The Leadership Coach: A Teach Yourself Personal Guide to Success"},{"quote":"“Winners accept responsibility because acceptance of responsibility nullifies excuses.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“The unknown can be a great tool.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“It is more likely that coaches have players go down in games they are losing than games they are winning.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“America is a country built on unity, hard work and diligent pursuit of personal goals leading to collective success.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“This is truly a rags to riches story which doesn’t happen often, but it does happen. Hope is offered to those who face similar challenges that in this great Country dreams can be realized when work ethic and passion lead the way.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“The coaches will offer a direction, a plan, routine, discipline and the players must develop the desire to work together accepting their roles as they learn in preparation for the season.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“Every time our great Country has been critically challenged either by dictators or terrorists, we as a Country have put aside our personal agendas and focused on doing what we need to do to win when threatened.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“Sports programs are an important part of young people’s lives but should never over-shadow the true purpose of high school and that is to earn a diploma. So often today sports have become more important than an education. This must be remedied because the true focus must always be toward the student’s academic development.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“Closed minds close doors.” ― Tonya Sheridan"},{"quote":"“A life is a terrible thing to waste. Reach your potential. Thrive.” ― Paul Gibbons, Reboot Your Life: A 12-day Program for Ending Stress, Realizing Your Goals, and Being More Productive"},{"quote":"“As life progresses, baggage can accumulate. For a while, things can be swept under the rug, but the wait of unfinished business eventually catches up.” ― Paul Gibbons, Reboot Your Life: A 12-day Program for Ending Stress, Realizing Your Goals, and Being More Productive"},{"quote":"“When it comes to the arc of your life, leadership is a sacred responsibility.” ― Paul Gibbons, Reboot Your Life: A 12-day Program for Ending Stress, Realizing Your Goals, and Being More Productive"},{"quote":"“Be the author, not the reader, of your own life.” ― Paul Gibbons, Reboot Your Life: A 12-day Program for Ending Stress, Realizing Your Goals, and Being More Productive"},{"quote":"“Every leader is different. Every bench is different. Every business is different. So while the complexities change, the work of coaching stays the same keep your clients at the center of the work, push them to use their strengths more and to temper their weaknesses, and illuminate blind spots because these are what really get in the way.” ― Stacy Feiner, Talent Mindset"},{"quote":"“Ineet is definitely the best choice when it comes to medical coaching institutes in Bhubaneswar .” ― Coaching Institutes in Bhubaneswar"},{"quote":"“A person will know the quality of your listening by the backtrack or question that follows.” ― Tony Husted"},{"quote":"“Dance your Soulful path / and you shall know the magic / of your mind & heart / and all the beauty laughing / to fill your rising self.” ― Jay Woodman"},{"quote":"“How you coach them is how they're going to play.” ― Stefan Fatsis, A Few Seconds of Panic: A 5-Foot-8, 170-Pound, 43-Year-Old Sportswriter Plays in the NFL"},{"quote":"“You can Transform into a Super-Soul! If you align your physical and mental (logical/emotional) self with your core self (or soul being), then you will know your personal path, and find ways to follow it to fulfillment. You can learn how to best nurture your body, plus train your mind as an empowering tool to enhance your overall balance, strength, and unique skills, so that you achieve your goals, as well as optimise your well-being.” ― Jay Woodman"},{"quote":"“Failure can only exist in your life at your permission.” ― Phumi Ngwane"},{"quote":"“Part of the genius of (Nick) Sabin's system was that he understood that no matter the skill set, he was inheriting vulnerable kids from various backgrounds. For those times when they made poor decisions, as they invariably did, the safety net must be strong as far and wide as possible.” ― Jeff Benedict, The System: The Glory and Scandal of Big-Time College Football"},{"quote":"“If you are not a part of the solution then you must be part of the problem. I am done with problems here!” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“People don’t need you to fix them, they are not broken, just serve them.” ― Malti Bhojwani"},{"quote":"“Almost everything I've done is technically wrong, but Paul never mentioned the mistakes, only the corrective measures.” ― Stefan Fatsis, A Few Seconds of Panic: A 5-Foot-8, 170-Pound, 43-Year-Old Sportswriter Plays in the NFL"},{"quote":"“I will not promise boys positions, I will not promise any of you football success, I will demand discipline, character, respect, and work ethic throughout the program. If I succeed in getting people to believe then success will follow.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“The great cancer facing all of us during this ‘new millennium’ is entitlement.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“To achieve any group goal, individuals must work to improve themselves as a means to improve the group.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“Your thoughts determine how your day will be.” ― Phumi Ngwane"},{"quote":"“Greatness is unleashed when you develop faith in the power of your faith.” ― Phumi Ngwane"},{"quote":"“Happiness is a heart condition and not a state of affairs.” ― Phumi Ngwane"},{"quote":"“If the issues of life push at you push back with such force that they fall off the universe.” ― Phumi Ngwane"},{"quote":"“A problem is nothing more than a solution outstanding.” ― Phumi Ngwane"},{"quote":"“5 words of advice to reduce stress - \"Connect with your Soul's power\" or \"Change your reality through Coaching\".” ― Jay Woodman"},{"quote":"“If I would have known I was going to leave my job that day to become a writer, I probably would have planned differently... It didn't come by way of illness per se, accident, or dismissal, but by way of sheer self-mutiny. The self I was born to be, decided to hijack the one I had created.” ― Dawn Kohler, The Invitation: A Weekend with Emma"},{"quote":"“...and from here I realized, with the deepest sense of my being, that we can erect and dismantle the great walls of the world, but we will only truly survive as a species when we dedicate ourselves to removing the walls from within.” ― Dawn Kohler, The Invitation: A Weekend with Emma"},{"quote":"“If we know ourselves, and know our hearts, we're always home, anywhere.” ― Dawn Kohler, The Invitation: A Weekend with Emma"},{"quote":"“Being fired is part of the risk when anyone plans to take on the responsibility as a head coach.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“It is so easy to judge those around us and decide their value without knowing who they really are or what they truly represent.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“we first need to get boys out for football and then the plan will gradually come into play” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“• I have experienced the youth of Generation X, Y and currently Z. Teenage boys have changed in many ways over the years. Yet still they are quite similar to the boys I first coached in 1980 at a high school in Ohio.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“The youth of America need routine, repetition toward excellence, a sound but not punishing discipline, and the opportunity to make mistakes without the feeling of failure.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“Once an athlete feels his coach does not believe in him resentment develops and everyone loses at that point.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“As of today, you do anything that I feel is disrespecting our program in any way, you are gone! From this day forward, everyone will be at practice in uniform as we will either build this program into something or we will destroy it!” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“Coaches must take calculated risks all the time. One thing is to talk about what you plan to do and another is to prepare and then execute a plan toward change.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“The third year at a school for any head coach is the most important year for the program they are attempting to develop.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“A team goal requires a team effort.” ― George M. Gilbert, Team Of One: We Believe"},{"quote":"“Don’t ever perceive other people’s success as your own failure.” ― Rob Liano"},{"quote":"“Don't tell me about your effort. Show me your results.” ― Tim Fargo"},{"quote":"“Some strive to make themselves great. Others help others see and find their own greatness. It's the latter who really enrich the world we live in” ― Rasheed Ogunlaru"},{"quote":"“If you want to find money, focus on people. If you want to lose people, focus on money.” ― Rob Liano"},{"quote":"“Coaching doesn’t start with X’s and O’s. It starts with believing that players win games and coaches win players.” ― Bill Courtney, Against the Grain: A Coach's Wisdom on Character, Faith, Family, and Love"},{"quote":"“Listen to learn. Learn to earn!” ― Rob Liano"},{"quote":"“The more I learn about myself, the more I understand you.” ― Ken Poirot, Mentor Me: GA=T+E—A Formula to Fulfill Your Greatest Achievement"},{"quote":"“You've got to be around people who encourage you, advice you and want to see you go even higher and higher than they themselves have attained!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Be fair. Play hard.” ― Dan Venezia"},{"quote":"“You begins with 'Y'-so ask, observe, and listen.” ― Ken Poirot, Mentor Me: GA=T+E—A Formula to Fulfill Your Greatest Achievement"},{"quote":"“Life is a journey where we don't want to arrive at our final destination too soon, unfortunately many of us live from day to day and some very rarely explore life's rich tapestry or take time to focus on what they really want out of life. Go explore every aspect of your life, we can't rewind or push the pause button, live life and live it well.” ― Darren Housley"},{"quote":"“In what is known as the 70/20/10 learning concept, Robert Eichinger and Michael Lombardo, in collaboration with Morgan McCall of the Center for Creative Leadership, explain that 70 percent of learning and development takes place from real-life and on-the-job experiences, tasks, and problem solving; 20 percent of the time development comes from other people through informal or formal feedback, mentoring, or coaching; and 10 percent of learning and development comes from formal training.” ― Marcia Conner, The New Social Learning: A Guide to Transforming Organizations Through Social Media"},{"quote":"“Every family has a destiny to fulfill....Every child is the future of his or her family and nation at large....Every father is a hero to his son (child).....Fathers are you truly heroes to your children....check your thoughts, actions and motives.....are you really living up to your children' s expectations ?” ― Jaachynma N.E. Agu, Risk It, Be Different"},{"quote":"“We know that giving someone ideas as to whatthey ‘should’ do and how they should ‘change’ to bemore effective, often has the opposite effect” ― Richard Boyatzis"},{"quote":"“I can help, but in the end it is up to you” ― David Kirby"},{"quote":"“Rethink Your Success Mindset: Times are getting tougher. We need tougher mindsets to ensure that we go beyond survive to thrive.” ― Tony Dovale - ReThink Your Success Mindset tonydovalespeaks.com"},{"quote":"“...you can always agree on one thing. You can shake hands, smile, and say, 'Yes...we will have to agree to disagree.” ― Ken Poirot, Mentor Me: GA=T+E—A Formula to Fulfill Your Greatest Achievement"},{"quote":"“You have everything you need inside of you to create anything in your life that you desire.” ― Mike Basevic, No Limits, Mastering the Mental Edge"},{"quote":"“A good coach can be a caring parent, a wise teacher, an exemplary pastor, a passionate friend or a devoted mentor. Keep in touch with all of them especially at the time they are needed.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“You will never change what you don't confront.” ― Phumi Ngwane"},{"quote":"“The power to re-create yourself is in you.” ― Phumi Ngwane"},{"quote":"“When a person is faced with intense fear or sheer horror, they show their strength not by trying to be though, but by recovering afterwards” ― Maurice Mol"},{"quote":"“When the Knicks won the championship in 1970, our fans rallied behind us and became our sixth man because they saw a group of five distinct personalities come together and play as one seamless unit. Winning takes a game plan and that's where a great coach comes in. He has to have the vision. He has to be the architect and design a particular style of play that his players can work together and excel at. The great Celtics teams that won 11 championships in the span of 13 seasons ( 1957-69) never changed their system. They played the same game regardless of who their cast was.” ― Walt Frazier, The Game Within the Game"},{"quote":"“Rethink Your Success Mindset: With the right mindset, everything that you experience, along your journey towards success, is a blessing.” ― Tony Dovale - ReThink Your Success Mindset tonydovalespeaks.com"},{"quote":"“Rethink Your Success Mindset: Gratitude is the attitude, fuel and catalyst that transforms life's challenges into wisdom.” ― Tony Dovale - ReThink Your Success Mindset tonydovalespeaks.com"},{"quote":"“Maybe you are in the Abyss of Emotional Bankruptcy looking for a way out, looking for the next rung in the ladder on your climb to the Peak of Happiness, or you may even be at the Peak of Happiness already, looking for a way to stay there. Wherever you are in life, this book is designed to give you the tools necessary to help you achieve your goals.” ― Ken Poirot, Mentor Me: GA=T+E—A Formula to Fulfill Your Greatest Achievement"},{"quote":"“Let your experience be not one of failure but one that has taught you new things which you would not have known had you not tried” ― Epiphana Lewis"},{"quote":"“The time to follow your dreams is now.” ― Phumi Ngwane"},{"quote":"“Set the goal, adjust the goal when needed, and stay locked in on the goal.” ― Mike Basevic, No Limits, Mastering the Mental Edge"},{"quote":"“Why spend a thought worrying when you can invest the same thought planning a prosperous future?” ― Phumi Ngwane"},{"quote":"“Divorce = Rebirth: forget the past, replan your life, improve your appearance & REJUVENATE!” ― Rossana Condoleo"},{"quote":"“Good coaching is good teaching and nothing else.” ― Pat Conroy, My Losing Season: A Memoir"},{"quote":"“Do the things you like to be happier, stronger & more successful. Only so is hard work replaced by dedication.” ― Rossana Condoleo"},{"quote":"“If we could eliminate the concept of town and return to live in small villages, all world problems were solved.” ― Rossana Condoleo"},{"quote":"“Divorce is the start point for a brand new life. Don't lose the chance to redesign it upon your dreams!” ― Rossana Condoleo"},{"quote":"“Triump is just a little umph added to try.” ― Tim Owens"},{"quote":"“Putting down the power right from the whistle would be ugly and brutal, but it would get the job done. He wanted to tell her that, but this was the thing with coaching: you had to step back at exactly the moment you ached to step forward.” ― Chris Cleave"},{"quote":"“To be a runner is to learn continual life lessons. To be a coach is not just to teach these lessons but also to feel them in the core of your marrow. The very act of surpassing personal limits in training and racing will bend the mind and body toward a higher purpose for the rest of my runners' lives. Settling for mediocrity-settling instead of pushing-those who learn to be the best version of themselves know the secret to a full life.” ― Martin Dugard"},{"quote":"“Push hard and expect rapid results.” ― Lorii Myers, No Excuses, The Fit Mind-Fit Body Strategy Book"},{"quote":"“Intrinsic values and qualities are age-free. For example, social competencies or a good heart.” ― Rossana Condoleo"},{"quote":"“Let your projects be independent organisms. They will develop their own beautiful architecture.” ― Rossana Condoleo"},{"quote":"“Never tell a mother how she has to raise her children and give no advice over their schooling, health or nutrition if you are not asked to.” ― Rossana Condoleo"},{"quote":"“Being giving is a big quality. Being too giving is a big mistake!” ― Rossana Condoleo"},{"quote":"“What about thinking of happiness as a right instead than as a gift?” ― Rossana Condoleo"},{"quote":"“If today's churches, companies and organizations want to be thriving tomorrow, they have an obligation to coach and mentor the new generation of leaders.” ― Wayde Goodall, Why Great Men Fall"},{"quote":"“The moment we begin to define others and ourselves by how we are different, the seeds of separation are planted.” ― Kim H. Krisco, Talking to Trees: A Chronicle of One Coach's Journey Into a New Coaching Paradigm"},{"quote":"“Strategic personal qualities you can base your self-confidence on are those which are interesting for all mankind.” ― Rossana Condoleo"},{"quote":"“Live doesn't always give, Sometimes it takes” ― Maurice Mol"},{"quote":"“nteraction with a fellow human being, especially one who can understand what you’re going through and direct your awareness to the solutions you can use, is a powerful approach to self-help.” ― Haider Al-Mosawi"}]
