[{"quote":"“Here is a lesson in creative writing. First rule: Do not use semicolons. They are transvestite hermaphrodites representing absolutely nothing. All they do is show you've been to college.” ― Kurt Vonnegut, A Man Without a Country"},{"quote":"“Rejection is an opportunity for your selection.” ― Bernard Branson"},{"quote":"“I've learned one thing, and that's to quit worrying about stupid things. You have four years to be irresponsible here, relax. Work is for people with jobs. You'll never remember class time, but you'll remember the time you wasted hanging out with your friends. So stay out late. Go out with your friends on a Tuesday when you have a paper due on Wednesday. Spend money you don't have. Drink 'til sunrise. The work never ends, but college does...” ― Tom Petty"},{"quote":"“I only want to write. And there's no college for that except life.” ― Dodie Smith, I Capture the Castle"},{"quote":"“Every year, many, many stupid people graduate from college. And if they can do it, so can you.” ― John Green"},{"quote":"“Months are different in college, especially freshman year. Too much happens. Every freshman month equals six regular months—they're like dog months.” ― Rainbow Rowell, Fangirl"},{"quote":"“The way I figure it, everyone gets a miracle.” ― John Green, Paper Towns"},{"quote":"“I don’t think it would have all got me quite so down if just once in a while—just once in a while—there was at least some polite little perfunctory implication that knowledge should lead to wisdom, and that if it doesn't, it's just a disgusting waste of time! But there never is! You never even hear any hints dropped on a campus that wisdom is supposed to be the goal of knowledge. You hardly ever even hear the word 'wisdom' mentioned!” ― J.D. Salinger, Franny and Zooey"},{"quote":"“But if you tell folks you're a college student, folks are so impressed. You can be a student in anything and not have to know anything. Just say toxicology or marine biokinesis, and the person you're talking to will change the subject to himself. If this doesn't work, mention the neural synapses of embryonic pigeons.” ― Chuck Palahniuk, Invisible Monsters"},{"quote":"“What's wrong with me? ... I might seem like the ideal student: homework always in early, every extra credit and extra curricular I can get my hands on, the good girl and the high achiever. But I realized something just now: it's not ambition, not entirely. It's fear. Because I don't know who I am when I'm not working, when I'm not focused on or totally consumed by a task. Who am I between the projects and the assignments, when there's nothing to do? I haven't found her yet and it scares me. Maybe that's why, for my senior capstone project this year, I decided to solve a murder.” ― Holly Jackson, A Good Girl's Guide to Murder"},{"quote":"“Everybody who is incapable of learning has taken to teaching.” ― Oscar Wilde"},{"quote":"“I think back to what Landon said about heartbreak, that if you don’t love the person, they can’t break your heart. Hardin repeatedly breaks my heart, even when I don’t think there are any more pieces to break.And I love him. I love Hardin.” ― Anna Todd, After"},{"quote":"“You didn't need a college degree to become one of the people who knew what was really going on. If you paid attention, you could pick things up on your own.” ― Jeannette Walls, The Glass Castle"},{"quote":"“You can’t learn to write in college. It’s a very bad place for writers because the teachers always think they know more than you do—and they don’t. They have prejudices. They may like Henry James, but what if you don’t want to write like Henry James? They may like John Irving, for instance, who’s the bore of all time. A lot of the people whose work they’ve taught in the schools for the last thirty years, I can’t understand why people read them and why they are taught. The library, on the other hand, has no biases. The information is all there for you to interpret. You don’t have someone telling you what to think. You discover it for yourself.” ― Ray Bradbury"},{"quote":"“Oh, why does college have to happen to perfectly good people?” ― Rick Riordan, The Hidden Oracle"},{"quote":"“College is fun as long as you don't die.” ― Tsugumi Ohba, Death Note, Vol. 4: Love"},{"quote":"“Success comes in a lot of ways, but it doesn't come with money and it doesn't come with fame. It comes from having a meaning in your life, doing what you love and being passionateabout what you do. That's having a life of success. When you have the ability to do what you love, love what you do and have the ability to impact people. That's having a life of success. That's what having a life of meaning is.” ― Tim Tebow"},{"quote":"“Usually when you ask somebody in college why they are there, they'll tell you it's to get an education. The truth of it is, they are there to get the degree so that they can get ahead in the rat race. Too many college radicals are two-timing punks. The only reason you should be in college is to destroy it.” ― Abbie Hoffman, Steal This Book"},{"quote":"“What else is there to do in college except drink beer or slit one's wrists?” ― Bret Easton Ellis, The Rules of Attraction"},{"quote":"“College is the best time of your life. When else are your parents going to spend several thousand dollars a year just for you to go to a strange town and get drunk every night?” ― David Wood"},{"quote":"“You see, in this country are a number of youths who do not like to work, and the college is an excellent place for them.” ― L. Frank Baum, Ozma of Oz"},{"quote":"“To be a writer you have to write -- and no academic degree is going to do the writing for you. ” ― Michelle Richmond"},{"quote":"“My advice to writers just starting out? Don't use semi-colons! They are transvestite hermaphrodites, representing exactly nothing. All they do is suggest you might have gone to college.” ― Kurt Vonnegut Jr., Armageddon in Retrospect"},{"quote":"“You're sure your new roommate won't be like the last one who wore tinfoil socks and had a tendency to occasionally urinate in the refrigerator. You're sure you'll pass Math 106 this time around. You're determined to actually join some clubs this year and not just sit around in your dorm eating spray cheese from a can and watching youtube videos about cats.” ― Patrick Rothfuss"},{"quote":"“Wisdom is nothing more than confirmed imagination: just because one did not study for his exam does not mean that he should leave it blank.” ― Criss Jami, Killosophy"},{"quote":"“A lack of illusion is golden, and it is quite possible that creativity is the highest form of intelligence. One might further develop oneself in the creative sense and, therefore, at times, find some degree of shame more so than pride when having always followed that of the safe and ever-praised academia.” ― Criss Jami, Killosophy"},{"quote":"“What a moron I was to think you were sweet and innocent, when it turns out you were actually college-educated the whole time!” ― Margaret Atwood, The Edible Woman"},{"quote":"“Some people get an education without going to college. The rest get it after they get out.” ― Mark Twain"},{"quote":"“I can't take anything you don't give me. Stop giving me power over your life.” ― Chelsea M. Cameron, Deeper We Fall"},{"quote":"“It wasn't a romance; it was too perfect for that. With texts there were only the words and none of the awkwardness. They could get to know each other completely and get comfortable before they had to do anything unnecessarily overwhelming like look at each other's eyeballs with their eyeballs.” ― Mary H.K. Choi, Emergency Contact"},{"quote":"“I began my studies with eagerness. Before me I saw a new world opening in beauty and light, and I felt within me the capacity to know all things. In the wonderland of Mind I should be as free as another [with sight and hearing]. Its people, scenery, manners, joys, and tragedies should be living tangible interpreters of the real world. The lecture halls seemed filled with the spirit of the great and wise, and I thought the professors were the embodiment of wisdom... But I soon discovered that college was not quite the romantic lyceum I had imagined. Many of the dreams that had delighted my young inexperience became beautifully less and \"faded into the light of common day.\" Gradually I began to find that there were disadvantages in going to college. The one I felt and still feel most is lack of time. I used to have time to think, to reflect, my mind and I. We would sit together of an evening and listen to the inner melodies of the spirit, which one hears only in leisure moments when the words of some loved poet touch a deep, sweet chord in the soul that until then had been silent. But in college there is no time to commune with one's thoughts. One goes to college to learn, it seems, not to think. When one enters the portals of learning, one leaves the dearest pleasures – solitude, books and imagination – outside with the whispering pines. I suppose I ought to find some comfort in the thought that I am laying up treasures for future enjoyment, but I am improvident enough to prefer present joy to hoarding riches against a rainy day.” ― Helen Keller, The Story of My Life: With Her Letters (1887 1901) and a Supplementary Account of Her Education Including Passages from the Reports and Letters of Her Teacher Anne Mansfield Sullivan by John Albert Macy"},{"quote":"“I am kind of majoring in bull shitting.” ― Kate Voegele"},{"quote":"“There are times when I long to sweep away half the things I am expected to learn; for the overtaxed mind cannot enjoy the treasure it has secured at the greatest cost. ... When one reads hurriedly and nervously, having in mind written tests and examinations, one's brain becomes encumbered with a lot of bric-a-brac for which there seems to be little use. At the present time my mind is so full of heterogeneous matter that I almost despair of ever being able to put it in order. Whenever I enter the region of my mind I feel like the proverbial bull in the china shop. A thousand odds and ends of knowledge come crashing about my head like hailstones, and when I try to escape them, theme goblins and college nixies of all sorts pursue me, until I wish – oh, may I be forgiven the wicked wish! – that I might smash the idols I came to worship.” ― Helen Keller, The Story of My Life: With Her Letters (1887 1901) and a Supplementary Account of Her Education Including Passages from the Reports and Letters of Her Teacher Anne Mansfield Sullivan by John Albert Macy"},{"quote":"“I imagine that one of the biggest troubles with colleges is there are too many distractions, too much panty-raiding, fraternities, and boola-boola and all of that.” ― Malcolm X, The Autobiography of Malcolm X"},{"quote":"“If the college you visit has a bookstore filled with t-shirts rather than books, find another college.” ― Albert Mohler Jr."},{"quote":"“Every beginner possesses a great potential to be an expert in his or her chosen field.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Take a limitation and turn it into an opportunity. Take an opportunity and turn it into an adventure by dreaming BIG!” ― Jo Franz"},{"quote":"“A whale ship was my Yale College and my Harvard.” ― Herman Melville"},{"quote":"“Do not give them a candle to light the way, teach them how to make fire instead. That is the meaning of enlightenment.” ― Kamand Kojouri"},{"quote":"“What does all this mean finally, I kept asking like a college kid. Why does it make me want to cry? Maybe it’s that we are all outsiders, we are all making our own unusual way through a wilderness ofnormality that is just a myth.” ― Anne Rice, Exit to Eden"},{"quote":"“High school parties exhausted me because I always felt like I was the only thinking person in a room mostly full of morons obliterating precious IQ points with every gulp of whatever booze they managed to steal out of their parents' liquor cabinets. College parties are exhausting in a diametrically opposite way. They are full of smart, funny people who are all used to being the smartest, funniest person in the room, so they spend the whole party talking over one another, overlapping and overtaking the conversation to prove that they are the smartest, funniest person in the room, if not the entire planet.” ― Megan McCafferty, Charmed Thirds"},{"quote":"“It takes two or three generations to do what I tried to do in one; and my impulses--affections--vices perhaps they should be called-- were too strong not to hamper a man without advantages; who should be as cold-blooded as a fish and as selfish as a pig to have a really good chance of being one of his country's worthies. You may ridicule me--I am quite willing that you should-- I am a fit subject, no doubt. But I think if you knew what I have gone through these last few years you would rather pity me. And if they knew\"--he nodded towards the college at which the dons were severally arriving--\"it is just possible they would do the same.” ― Thomas Hardy, Jude the Obscure"},{"quote":"“In my parents' day and age, it used to be the person who fell short. Now it's the discipline. Reading the classics is too difficult, therefore it's the classics that are to blame. Today the student asserts his incapacity as a privilege. I can't learn it, so there is something wrong with it. And there is something especially wrong with the bad teacher who wants to teach it. There are no more criteria, Mr. Zuckerman, only opinions.” ― Philip Roth, The Human Stain"},{"quote":"“I didn't want any degrees if all the ill-read literates and radio announcers and pedagogical dummies I knew had them by the peck. ” ― J.D. Salinger, Franny and Zooey"},{"quote":"“Self-education is lifelong curiosity.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“In 1971, after seven years in college, with that magic piece of paper clutched triumphantly in my fist, the best job I was able to get was night watchman on a sewer project in Babylon, N.Y. guarding a hole in the ground to prevent anyone from stealing it. God bless the American educational system!” ― Spider Robinson, The Callahan Chronicals"},{"quote":"“Bad things are gonna' happen to you, because they happen to us all. And worrying won't stave the really bad things off. Don't make the mistake of comparing your twisted-up insides to other people's blow-dried outsides. Even the most privileged person in this stadium suffers the torments of the damned just going about the business of being human.” ― Mary Karr, Now Go Out There"},{"quote":"“GrayG: I feel like I can tell you anything.IvyMac: You can. That's what friends do.GrayG: I've never been friends with a girl before.IvyMac: I'm honored to be your first.” ― Kristen Callihan, The Friend Zone"},{"quote":"“I’m the guy who knows how you can hurt so much that your insides feel like they’re cut and bleeding.” ― Stephanie Witter, Patch Up"},{"quote":"“College was for people who didn’t know they were smart.” ― Stephen King, Mr. Mercedes"},{"quote":"“It was a time before Facebook and Instagram and texting. I imagine it must be easier now, for college students. Home must not feel so far away anymore. But how do you cut the apron strings if the strings are virtual?” ― Kirstie Collins Brote, Beware of Love in Technicolor"},{"quote":"“Eventually the real world intruded again, and Sophie had to return to campus—woefully behind on homework, but incandescently in love.” ― Molly Ringle, Persephone's Orchard"},{"quote":"“My priority is not about grades. I seek yearn for knowledge, skills and wisdom.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Though outwardly Kristina maintained that a clean room was a symptom of a diseased mind (for how could she, while studying the world's greatest thinkers, be bothered with such mundane earthly issues as cleaning?), inwardly she hated untidyness and made a point of spending as little time in the room as possible.” ― Paullina Simons, Red Leaves"},{"quote":"“Of a sudden he felt that fraternity life was the only way to exist at college. How could he have doubted? (126)” ― Ferrol Sams, The Whisper of the River"},{"quote":"“If the finest genius studies at one of our colleges, and is not installed in an office within one year afterwards in the cities or suburbs of Boston or New York, it seems to his friends and to himself that he is right in being disheartened, and in complaining the rest of his life. A sturdy lad from New Hampshire or Vermont, who in turn tries all the professions, who teams it, farms it, peddles, keeps a school, preaches, edits a newspaper, goes to Congress, buys a township, and so forth, in successive years, and always, like a cat, falls on his feet, is worth a hundred of these city dolls. He walks abreast with his days, and feels no shame in not 'studying a profession,' for he does not postpone his life, but lives already.” ― Ralph Waldo Emerson, Nature and Selected Essays"},{"quote":"“Thought and knowledge are natures in which apparatus and pretension avail nothing. Gowns, and pecuniary foundations, though of towns of gold, can never countervail the least sentence or syllable of wit. Forget this, and out American colleges will recede in their public importance whilst they grow richer every year.” ― Ralph Waldo Emerson"},{"quote":"“There was no way she'd allow him to see her do 97 percent of her normal activities. She was a monster. A monster who was flat as a board with no ass. In fact, the only thing she had going on in the curves department was an enormous cystic pimple on her chin that hurt when she touched it. Yeah, no.” ― Mary H.K. Choi, Emergency Contact"},{"quote":"“You will create yourself with continuous self-education.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Curiosity is the beginning of all creativity.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“Ever since college, I make friends. They get married. I lose friends.” ― Chuck Palahniuk, Fight Club"},{"quote":"“I wasn't aware that was how I felt, either, until it was out. And now that I've said it like that, I'm not exactly sure it is how I feel. But this isn't a piece of paper I can crumple up and throw away. they aren't words I can cross out to start over. Now they're out, and I know they'll hang here, between us, maybe forever.” ― Terra Elan McVoy, Being Friends with Boys"},{"quote":"“I’d compare college tuition to paying for a personal trainer at an athletic club. We professors play the roles of trainers, giving people access to the equipment (books, labs, our expertise) and after that, it is our job to be demanding.” ― Randy Pausch, The Last Lecture"},{"quote":"“If you use a philosophy education well, you can get your foot in the door of any industry you please. Industries are like the blossoms on a tree while philosophy is the trunk - it holds the tree together, but it often goes unnoticed.” ― Criss Jami, Killosophy"},{"quote":"“And there's this place called college! I mean, they want you to care, dig it, care about this education trip, and they don't care enough themselves to make it as attractive as the crap game across the street!” ― Spider Robinson, Callahan's Crosstime Saloon"},{"quote":"“When I got to college, the fake ID thing wasn't that important, since pretty much everyone could get away with drinking in New Orleans. But the drugs, well, that was a different story altogether, because drugs are every bit as illegal in New Orleans as anywhere else--at least, if you're black and poor, and have the misfortune of doing your drugs somewhere other than the dorms at Tulane University. But if you are lucky enough to be living at Tulane, which is a pretty white place, especially contrasted with the city where it's located, which is 65 percent black, then you are absolutely set.” ― Tim Wise, White Like Me: Reflections on Race from a Privileged Son"},{"quote":"“This is an extra letter in the middle of the month because I'm rather lonely tonight. It's awfully stormy; the snow is beating against my tower. All the lights are out on the campus, but I drank black coffee and I can't go to sleep.I had a supper party this evening consisting of Sallie and Julia and Leonora Fenton - and sardines and toasted muffins and salad and fudge and coffee. Julia said she'd had a good time, but Sallie stayed to help wash the dishes.” ― Jean Webster, Daddy-Long-Legs"},{"quote":"“I didn't give it much thought back then. I just wanted to get all the words straight and collect my A.” ― Gayle Forman, Just One Day"},{"quote":"“Christ, seven years of college, down the drain.” ― John Belushi"},{"quote":"“A first-rate college library with a comfortable campus around it is a fine milieu for a writer. There is, of course, the problem of educating the young. I remember how once, between terms, not at Cornell, a student brought a transistor set with him into the reading room. He managed to state that one, he was playing “classical” music; that two, he was doing it “softly”; and that three, “there were not many readers around in summer.” I was there, a one-man multitude.” ― Vladimir Nabokov, Strong Opinions"},{"quote":"“My father was a slave to capitalist ideology. He didn't know what he was doing.\"\"You mean you went to an expensive school?” ― Ian Rankin, Knots and Crosses"},{"quote":"“This irritated or puzzled such students of literature and their professors as were accustomed to ‘serious’ courses replete with ‘trends ’ and ‘schools ’ and ‘myths ’ and ‘symbols ’ and ‘social comment ’ and something unspeakably spooky called ‘climate of thought.’ Actually these ‘serious’ courses were quite easy ones with the students required to know not the books but about the books.” ― Vladimir Nabokov"},{"quote":"“The habit of looking at life as a social relation — an affair of society — did no good. It cultivated a weakness which needed no cultivation. If it had helped to make men of the world, or give the manners and instincts of any profession — such as temper, patience, courtesy, or a faculty of profiting by the social defects of opponents — it would have been education better worth having than mathematics or languages; but so far as it helped to make anything, it helped only to make the college standard permanent through life.” ― Henry Adams, The Education of Henry Adams"},{"quote":"“I think my degrees in Theology and Psychology qualified me for nothing, but probably prepared me for everything.” ― Brooke Bida"},{"quote":"“The other thing you can do is write a strong personal essay which lets admissions people inside your life, your heart, and your world....Anyway, it can be hard to figure out what to write about, so here are a few suggestions:...5. Reasons it's wrong to be racist even though it makes sense to you.” ― Eugene Mirman, The Will to Whatevs: A Guide to Modern Life"},{"quote":"“When you're in college you haven't had that much life. Parents, school, assorted youth activities—that's about it.” ― Martha Moody, Best Friends"},{"quote":"“People think I'm selling feminism in my books, but what I'm really doing is writing advertising copy for expensive private colleges that most women can't afford anyway. Oh, and try to find a job with a major in English literature. No luck? Joke's on you, sucker!” ― Mary Gordon, Conversations with Mary Gordon"},{"quote":"“When describing the University of Virginia: Here, We are not afraid to follow truth wherever it may lead, nor to tolerate any error so long as reason is left free to combat it.” ― Thomas Jefferson, Declaration of Independence, Constitution of the United States of America, Bill of Rights and Constitutional Amendments (Including Images of Original"},{"quote":"“I had an absurd desire to go down to her and make sure she was all right, and stay with her until dawn. I also had a fierce wish to bludgeon the two frat boys to death with a shovel.” ― Molly Ringle, Relatively Honest"},{"quote":"“Portia remembered her interview in the small office upstairs...in which she had been so shy, so terrified about not being good enough, not getting this thing, this chance, which she had only just discovered she wanted very badly.” ― Jean Hanff Korelitz"},{"quote":"“Seekers of wisdom, seekers of life.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“People in college are like this, unpleasantly smug one minute and then abasing themselves to show off their good manners the next.” ― Sally Rooney, Normal People"},{"quote":"“Joyfully we undertake our daily work.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“There was no way Penny would go to House and let Sam see her. That would ruin everything. Sam would take one look at her and be like, \"Yikes, never mind.” ― Mary H.K. Choi, Emergency Contact"},{"quote":"“I remember how excited I was to work for the Ivy League. By the time I left, I would not advise anyone to work for them.” ― Steven Magee"},{"quote":"“Kamishna … karibu,\" alisema Nafi huku akisimama na kutupa gazeti mezani na kuchukua karatasi ya faksi, iliyotumwa.\"Ahsante. Kuna nini …\"\"Kamishna, imekuja faksi kutoka Oslo kama nilivyokueleza – katika simu. Inakutaka haraka, kesho, lazima kesho, kuwahi kikao Alhamisi mjini Copenhagen,\" alisema Nafi huku akimpa kamishna karatasi ya faksi.\"Mjini Copenhagen!\" alisema kamishna kwa kutoamini.\"Ndiyo, kamishna … Sidhani kama kuna jambo la hatari lakini.\"\"Nafi, nini kimetokea!\"\"Kamishna … sijui. Kwa kweli sijui. Ilipofika, hii faksi, kitu cha kwanza niliongea na watu wa WIS kupata uthibitisho wao. Nao hawajui. Huenda ni mauaji ya jana ya Meksiko. Hii ni siri kubwa ya tume kamishna, na ndiyo maana Oslo wakaingilia kati.\"\"Ndiyo. Kila mtu ameyasikia mauaji ya Meksiko. Ni mabaya. Kinachonishangaza ni kwamba, jana niliongea na makamu … kuhusu mabadiliko ya katiba ya WODEA. Hakunambia chochote kuhusu mkutano wa kesho!\"\"Kamishna, nakusihi kuwa makini. Dalili zinaonyesha hali si nzuri hata kidogo. Hawa ni wadhalimu tu … wa madawa ya kulevya.\"\"Vyema!\" alijibu kamishna kwa jeuri na hasira. Halafu akaendelea, \"Kuna cha ziada?\"\"Ijumaa, kama tulivyoongea wiki iliyopita, nasafiri kwenda Afrika Kusini.\"\"Kikao kinafanyika Alhamisi, Nafi, huwezi kusafiri Ijumaa …\"\"Binti yangu atafukuzwa shule, kam …\"\"Nafi, ongea na chuo … wambie umepata dharura utaondoka Jumatatu; utawaona Jumanne … Fuata maadili ya kazi tafadhali. Safari yako si muhimu hivyo kulinganisha na tume!\"\"Sawa! Profesa. Niwie radhi, nimekuelewa, samahani sana. Samahani sana.” ― Enock Maregesi, Kolonia Santita"},{"quote":"“Yet here was Morrie talking with the wonder of our college years, as if I'd simply been on a long vacation. ..I once promised I would never work for money, that I would join the Peace Corps, that I would live in beautiful, inspirational places.” ― Mitch Albom, Tuesdays with Morrie: An Old Man, a Young Man, and Life's Greatest Lesson"},{"quote":"“Yet here was Morrie talking with the wonder of our college years, as if I'd simply been on a long vacation. ..What happened to me? I once promised I would never work for money, that I would join the Peace Corps, that I would live in beautiful, inspirational places.” ― Mitch Albom, Tuesdays with Morrie: An Old Man, a Young Man, and Life's Greatest Lesson"},{"quote":"“As a manager in the Ivy League, I discovered that the upper management team were seriously undermining my ability to manage my own staff. It was so bad that I eventually left. I now advise people not to work for the Ivy League.” ― Steven Magee"},{"quote":"“I mean that they (students) should not play life, or study it merely, while the community supports them at this expensive game, but earnestly live it from beginning to end. How could youths better learn to live than by at once trying the experiment of living? Methinks this would exercise their minds as much as mathematics.” ― Henry David Thoreau, Walden or, Life in the Woods"},{"quote":"“And yet not a dream, but a mighty reality- a glimpse of the higher life, the broader possibilities of humanity, which is granted to the man who, amid the rush and roar of living, pauses four short years to learn what living means” ― W.E.B. DuBois"},{"quote":"“Ah college years, those were the days. Pure freedom ... leaving home for the first time…the parties…”\"What about the tutorials, the lectures, the large building with all the books called the ‘library’?”“Is that what those were?” Gerry blithely replied.” ― E.A. Bucchianeri, Brushstrokes of a Gadfly"},{"quote":"“I was never educated to be an actor. I went to a regular college. It was a great thing for me because I feel that the main thing to get out of college is a thirst for knowledge. College should teach you how to be curious. Most people think that college is the end of education, but it isn't. The ceremony of giving you the diploma is called commencement. And that means you are fit to commence learning because you have learned how to learn.” ― Vincent Price, Vincent Price, his movies, his plays, his life"},{"quote":"“Behold me - a Sophomore! I came up last Friday, sorry to leave Lock Willow, but glad to see the campus again. It is a pleasant sensation to come back to something familiar. I am beginning to feel at home in college, and in command of the situation; I am beginning, in fact, to feel at home in the world - as though I really belonged to it and had not just crept in on sufferance.” ― Jean Webster, Daddy-Long-Legs"},{"quote":"“...I realized how naive I was. My aunt Tina was right: this stuff does exist, and it does hurt people, and although there are lots of people at Liberty who condemn violence against gays--including Dr. Falwell himself--the number of students who want to give them the Goliath treatment isn't zero. In fact, the number who live in my room isn't zero.” ― Kevin Roose, The Unlikely Disciple: A Sinner's Semester at America's Holiest University"},{"quote":"“...Come on let’s see the degree.” Katherine unrolled her scroll displaying a long declaration in Latin affixed with a red seal proclaiming her a Master of Art. “Imagine working for years to obtain a piece of paper we can hardly read ” Katherine joked. “And to officially declare you have talent ” Suzy returned.” ― E.A. Bucchianeri, Brushstrokes of a Gadfly"},{"quote":"“Enrollments in American colleges tripled between 1955 and 1970, 250% in the Soviet Union, 400% in France, and more than 200% in China by 1965. Gaddis writes, \"What governments failed to foresee was that more young people, plus, more education, when combined with a stalemated Cold War, could be a prescription for insurrection. Learning does not easily compartmentalize. How do you prepare students to think for purposes approved by the state, or by their parents, without also equipping them to think for themselves? Youths throughout history had often wished question their elders values. Now, with university educations, their elders had handed them the training to do so. The result was discontent with the world as it was.” ― John Gaddis, The Cold War"},{"quote":"“It is a well known fact that Abraham Lincoln spent much of his spare time visiting wounded soldiers in Union Army hospitals. I've spent thirty years teaching history at Columbia and I don't think I've spent more than fifteen minutes in the freshman dorm. Are we the ones keeping Lincoln's memory alive? Or are we burying it?” ― Eric Foner, Our Lincoln: New Perspectives on Lincoln and His World"},{"quote":"“At Reed College, I learned very quickly that I didn't know nearly enough. I learned, first, that every student there was as smart as I was, and quite a few seemed smarter.” ― John Daniel, Rogue River Journal: A Winter Alone"},{"quote":"“The image of him shifted with the violent frenzy of leaves. He was there and he wasn’t, as the leaves whipped and the lightning fell away in a slow strobe effect across the expanse of sky. How he had gotten up there, I had no idea, but he had been there. Crouched in the tree in the middle of the courtyard, he watched me intently through the open window.” ― Gwenn Wright, The Fate of Flannery Flynn"},{"quote":"“She’s already a bunch of stressors stacked in a trench coat. There are only that many kidnapping and murder attempts a child can endure before developing serious issues and self-destructive behaviors. We wouldn’t want her to grow up and, say, got to grad school.” “Don’t worry,” Misery reassures me, “every day I drill into her that we’ll be disappointed in anything but a Djing career.” “You’re such a good role model.” ― Ali Hazelwood, Mate"},{"quote":"“You may suppose that perhaps this Walter T. Wallace found his destiny in food and passed down to his progeny a legacy like that of the great Colonel Sanders. The folks here in Wallace County would love to be able to tell you this is so. But no, like their granddaddy, the Wallace men were thievin’ crooks, always with a scheme ready to separate the weak from their hard-earned money.” ― Gwenn Wright, Midnight Beneath the Magnolia"},{"quote":"“From the moment I left my parents' house for Vermont(my second year of college),I never called it 'going home' there.Home was always where I lived.Still is.In all these transitions,in all this chaos.Home is where I am.” ― Shellen Lubin"},{"quote":"“I once visited a library that had no books. Instead, the room was filled with urinals and sinks, so I drank my coffee and chatted with fellow intellectuals and felt grateful to be using my college education.” ― Jarod Kintz, Me and memes and memories"},{"quote":"“Most of us had taken out federal loans to get our MFAs, and the idea of ever having money for nice things was as irretrievably lost to us as our innocence.” ― Holly Brickley, Deep Cuts"},{"quote":"“We're not going to split the heart of reality: not until the third semester.” ― Theodore Roethke, Straw for the Fire: From the Notebooks of Theodore Roethke"},{"quote":"“Raquel had spent so much of her life focused on getting into college, she'd spent very little thinking or dreaming about what she'd do afterward.” ― Xóchitl González, Anita de Monte Laughs Last"},{"quote":"“The smell of finals was, ironically, the smell of fresh mulch being laid, hyacinth and daffodils being planted, freshly sodded and seeded grass.” ― Xóchitl González, Anita de Monte Laughs Last"},{"quote":"“Hannah was trying to describe love to me last semester. She said it feels like your heart is about to overflow, and that when you love someone, you need them more than anything else in the world, more than food or water or air. That's how i feel about you. I need you. I can't stand the thought of being without you. You're the last person I think about before I go to sleep, and the first person to think about when I open my eyes in the morning. You're it for me baby.” ― Elle Kennedy, The Mistake"},{"quote":"“The biggest thing we got out of college was to learn where to go to find facts. After that it was up to us to go there and learn.” ― Saul D. Alinsky, Reveille for Radicals"},{"quote":"“Lucy, college is a necessity for a secure future, my dad had said a few years ago. For women, a master's degree is the minimum.” ― Angeline Boulley, Sisters in the Wind"},{"quote":"“Education is a net good for society. It lifts people out of poverty and provides opportunity. It’s valued because it’s necessary. I realize that, and it is probably the thing I find most painful about not having a degree.” ― Christopher Zara, Uneducated: A Memoir of Flunking Out, Falling Apart, and Finding My Worth"},{"quote":"“The best thing about being at an HBCU is that you don't really have to find your community. 'Cause it's all of us. You just have to find your tribe. It's like we're all cookies, but what kind of cookie are you?” ― Ebony LaDelle, You've Got a Place Here, Too: An Anthology of Black Love Stories Set at HBCUs"},{"quote":"“There's a particular kind of torture to the waiting, the pining, the slowest burn, like setting fire to wet logs. One that flickers and pops like grease in a pan. Wondering if you'll yearn for him all four years.” ― Ebony LaDelle, You've Got a Place Here, Too: An Anthology of Black Love Stories Set at HBCUs"},{"quote":"“Wield AI with AIM—Aware, Intentional, Measured. Let your mind aim true, your values hold the line, and the machine carry the load.” ― Farshad Asl"},{"quote":"“They were best friends.Then a kiss ruined everything.Now they’re stepbrothers—and one dare away from burning it all down again.” ― Raquel Riley, Double Dared: An Enemies To Lovers MM Stepbrother Romance"},{"quote":"“Make-work,\" Daddy called her homework, derisively, and it mostly was a continuation of the school day, the careful reordering of numbers, letters, and concepts that would vaunt them into the appropriate high school, the appropriate college, and, for those whose families had recently arrived, into the \"gleaming anus of capitalist society\" (Daddy, of course, for which he was severely \"censured\" by Anne Mom).” ― Gary Shteyngart, Vera, or Faith"},{"quote":"“Although her parents both insisted that where one went to college did not matter, they certainly talked about colleges a lot.” ― Gary Shteyngart, Vera, or Faith"},{"quote":"“You're going to be the president of your frat,\" Daddy had told him. Dylan considered this honor, then dropped his pants and screamed, \"Look at my penis!\" \"See, you're halfway there,\" Daddy had said.” ― Gary Shteyngart, Vera, or Faith"},{"quote":"“Never say never, baby” ― Rina Kent, God of Malice"},{"quote":"“Your high school guidance counselor was right: A college degree is the path to success. The fact that everyone else has one also only makes it that much more valuable.” ― Jarod Kintz, Powdered Saxophone Music"},{"quote":"“By [college], many skills, attitudes, and habits have already been formed. We can have a much bigger impact on people at younger ages. Efforts to achieve true equity should focus instead on high-quality kindergarten and pre-K, high-quality weekend learning programs, high-quality charter schools, and high-quality after-school tutoring.” ― Coleman Hughes, The End of Race Politics: Arguments for a Colorblind America"},{"quote":"“I love you and I want you to stay.” ― Madi Leigh, What Are The Odds?"},{"quote":"“I need to know what happens next, Grace. Because I swear to God if I fall any more in love with you, I am going to break when you leave.” ― Madi Leigh, What Are The Odds?"},{"quote":"“We didn’t ruin a good thing, did we?”“Fuck no,” I firmly said. “We made a good thing better.” ― Madi Leigh, What Are The Odds?"},{"quote":"“That’s the thing about love, isn’t it? When you find someone who sees you in a way no one else does, who understands you and makes you feel like you can’t be whole without them, it wraps you in a vise and makes you forget how to live without them.” ― Lauren Ling Brown, Society of Lies"},{"quote":"“I graduated from The University of Florida. I tell people it's The Harvard of Gainesville.” ― Jarod Kintz, A Memoir of Memories and Memes"},{"quote":"“. . . the students that had died were in this Assassin game. She didn’t believe in coincidences so someone was targeting these players. She just hadn’t figured out why.” ― Tayler Marie Brooks, Assassin"},{"quote":"“Have you heard the murders of Sally, Carl, and Anna?” “Yeah. Of course. What does that have to do with you though? “I think I know who killed them.” Whispered Miles. “Really? Who?” Miles glanced back and forth. Seeing no one, he yanked out a knife and held it up to Craig. “I did.” Craig’s eyes widened. He opened his mouth but no sound came out. Miles stabbed the knife into Craig’s chest. “I’m sorry but I don’t have a choice.” ― Tayler Marie Brooks, Assassin"},{"quote":"“It's like suggesting we put seat belts on all the chairs in a library - both safe, just in very different ways!” ― Dipti Dhakul"},{"quote":"“If you really want this acceptance, then you need to display that now. Acceptance into the college of your choice may happen, but it likely won’t happen from mediocrity or luck. Put in the time and effort, do the research, and constantly strive for excellence on a daily basis. This needs to be a fundamental aspect of your mindset as a student.” ― AY Shih, The College Admissions Blueprint: 9 Proven Steps from Application to Acceptance"},{"quote":"“Behind every smile, there may hide a concealed agenda; not everyone who cheers for you genuinely celebrates your success.” ― Carlos Wallace, Life is not Complicated, You Are"},{"quote":"“I shifted around as my dick got hard at the mere suggestion that his was, too. Great, my Pavlovian instincts had reached even creepier heights. If Eric popped wood in the middle of a forest and no one was around to see it…” ― Neve Wilder, Want Me"},{"quote":"“God is the founder of Berry. I am only the human founder.” ― Martha Berry"},{"quote":"“Education combines the mind, the hand, and the heart.” ― Martha Berry"},{"quote":"“The doors to ivory towers don’t open automatically to the daughters of poor farmers.” ― Kelly Barnhill, When Women Were Dragons"},{"quote":"“Creation and death are two sides of the same coin.” ― Angel Lawson, Samantha Rue"},{"quote":"“But what is a soul? Does it even exist? Is it just a pretty name we give to the concept of sentience, or is it something that transcends science? And if it is, are we imbued with one at birth, or is a soul something we build ourselves? Can we inherit a soul? And if we can, does that mean we can also inherit the absence of one?” ― Angel Lawson, Samantha Rue"},{"quote":"“Dad” I said, “Richard is the bomb. He has a truck. He also has a fish tank, cable, a futon, and a VCR.” “You dumb-ass muthafucka,” Dad said, “you have a VCR. So you already got what this muthafucka got and more.” ― Leslie Jones, Leslie F*cking Jones"},{"quote":"“The fact you don’t know you’re a ten makes you an eleven.” ― Eden Finley, Twincerely Yours"},{"quote":"“We better feed him so he doesn’t change his mind. Now that I’ve been given permission to date you, I’m going to date you so hard.” ― Eden Finley, Twincerely Yours"},{"quote":"“They were almost that movie. The one that had been done thousands of times. The one everybody's seen and nobody likes, except for five-year-olds and a handful of college-aged single ladies who cry during Hallmark movies.” ― Olivia Lynn Jarmusch, The Rebellion"},{"quote":"“‬\"I‬‭ don't‬‭ get‬‭ it,\"‬‭ Scarecrow‬‭ muttered,‬‭ shaking‬‭ his‬diploma.‬‭ \"I‬‭ think‬‭ this‬‭ is‬‭ a‬‭ dud.\"‬‭ He‬‭ opened‬‭ the‬‭ diploma‬ and‬‭ inspected‬‭ it‬‭ closely.‬‭ \"National‬‭ University?!\"‬‭ He‬‭ scoffed and threw it to the ground in disgust.‬‭” ― Glen Nesbitt, We're Off"},{"quote":"“Your property, someone can steal. What you study, no one can take from you.” ― Felicia Berliner, Shmutz"},{"quote":"“I can't say why I went to college–except that I had been going to school all my life and didn't know what else to do. I didn't go with any particular hope. Hell, I knew what I was in for eventually. I was just marking time. Whatever I did was just marking time. If people were willing to pay me to go to school and mark time, why not do it?The weird part was, I worked hard, got top grades. If you work hard enough at something that doesn't matter, you can forget a while about the things that do.” ― Octavia E. Butler, Bloodchild and Other Stories"},{"quote":"“But that's the beauty of college; it's a widening of the boundaries. It dumps a lot of new people in front of you, rearranging your notions of what's possible, often blowing the lid off whatever you thought didn't or couldn't exist.” ― Michelle Obama, The Light We Carry: Overcoming in Uncertain Times"},{"quote":"“The conversations that follow are gratifying for Connell, often taking unexpected turns and prompting. him to express ideas he had never consciously formulated before. They talk about novels that he's reading, the research she studies, the precise historical moment that they are currently living in, the difficulty of observing such a moment is process.” ― Sally Rooney, Normal People"},{"quote":"“The conversations that follow are gratifying for Connell, often taking unexpected turns and prompting him to express ideas he had never consciously formulated before. They talk about novels that he's reading, the research she studies, the precise historical moment that they are currently living in, the difficulty of observing such a moment in process.” ― Sally Rooney, Normal People"},{"quote":"“No one has more experience than college students on their resumé.” ― Richie Norton"},{"quote":"“This was their dream time, the magical early days of fall semester, the happy haze of meeting once again, old friendships rekindling in firefly sparks before the real work of the year began.” ― Leigh Bardugo, Hell Bent"},{"quote":"“Now Grant understood. College wasn't about books and ideas and new directions. It was slow annihilation.” ― Michelle Min Sterling, Camp Zero"},{"quote":"“Why was it considered laudable, sociable, and funny to do this thing that made a person feel like they were dying, and did on occasion induce death? Of course, you couldn't have a party without alcohol. I understood this. I understood the reason. The reason was that people were intolerable. But wasn't there any way around that? Juho was talking about different research that people were doing into alcoholism in Finland. Why was nobody researching the more direct issue, of trying to make people less intolerable?” ― Elif Batuman, Either/Or"},{"quote":"“I got scared and I backed her into a corner. She was going through something, and I didn’t give her space to feel that. I was thinking about myself.” ― Bolu Babalola, Honey & Spice"},{"quote":"“Hampden College, as a body, was always strangely prone to hysteria. Whether from isolation, malice, or simple boredom, people there were far more credulous and excitable than educated people are generally believed to be, and this hermetic, overheated atmosphere made it a thriving black petri dish of melodrama and distortion. I remember well, for instance, the blind animal terror which ensued when some townie set off the civil defense sirens as a joke. Someone said it was a nuclear attack; TV and radio reception, never good there in the mountains, happened to be particularly bad that night, and in the ensuing stampede for the telephones the switchboard shorted out, plunging the school into a violent and almost unimaginable panic. Cars collided in the parking lot. People screamed, wept, gave away their possessions, huddled in small groups for comfort and warmth. Some hippies barricaded themselves in the Science Building, in the lone bomb shelter, and refused to let anyone in who didn't know the words to 'Sugar Magnolia'. Factions formed, leaders rose from the chaos. Though the world, in fact, was not destroyed, everyone had a marvelous time and people spoke fondly of the event for years afterward.” ― Donna Tartt, The Secret History"},{"quote":"“The college admissions process nowadays makes it harder for high school students to enjoy school and pursue intrinsic fulfillment. The process \"warps the values of students drawn into a competitive frenzy\" and \"jeopardizes their mental health” ― Greg Lukianoff & Jonathan Haidt, The Coddling of the American Mind: How Good Intentions and Bad Ideas Are Setting up a Generation for Failure"},{"quote":"“For one, the college itself turned out to have a lot of moral hypocrisy about it, e.g., congratulating itself on its diversity and the leftist piety of its politics while in reality going about the business of preparing elite kids to enter elite professions and make a great deal of money, thus increasing the pool of prosperous alumni donors. Without anyone ever discussing it or even allowing themselves to be aware of it, the college was a veritable temple of Mammon.” ― David Foster Wallace, The Pale King"},{"quote":"“If I ever write a book on money, it will be free, because I don't know anything about the subject—including how to make it. I guess that makes me almost as qualified as college economics professors.” ― Jarod Kintz, There are Two Typos of People in This World: Those Who Can Edit and Those Who Can't"},{"quote":"“Ducks know more about ducks than any college professor knows about ducks. Let that be a lesson in student-loan debt.” ― Jarod Kintz, I design saxophone music in blocks, like Stonehenge"},{"quote":"“Trump and others on the right want to make sure that working-class white men don’t want to go to college and distrust those who do, and conservative educators want to make sure that people from marginalized communities don’t want to go either. All of this works by design. It is to ensure that enough of us keep our heads down, focus on surviving our nine-to-five jobs, don’t ask questions, and don’t demand more from a system that owes us a lot. The death of American higher education will harm the most vulnerable of us first, but its goal is not to harm or oppress only us—that work is fully implanted in all our systems. Its goal is to continue to oppress and exploit white supremacy’s most powerful tool: the angry white working-class man.” ― Ijeoma Oluo, Mediocre: The Dangerous Legacy of White Male America"},{"quote":"“How do you get to be a ghost hunter, anyway?”“You have to go to college,” I told her, since I figured her parents wouldn’t mind that answer.” ― J.L. Bryan, Cold Shadows"},{"quote":"“Had he worn a sweater tied around his neck he could have served as the undeniable unintentional intimidating model poster boy for all the ever disappearing middle-class parents who saw the brochure for any ivy league school and were dreading money they had to shell out.” ― J.S. Mason, Whisky Hernandez"},{"quote":"“Of course college felt extreme,\" Coop said. \"You had infinite freedom and almost no responsibility. Nothing was fixed - you had your whole life ahead of you, and it could go anywhere. You had best friends you spent every minute with, so you were never alone. And you were in love. Real love.” ― Ashley Winstead, In My Dreams I Hold a Knife"},{"quote":"“There are idiots with PhDs and geniuses who never went to college.Talent is an innate thing. Stupidity too.” ― Augusto Branco"},{"quote":"“EJ knew she was solidly middle class, and she liked to think she was pretty sophisticated: she played piano, spoke French, and even embroidered a little—like accomplished ladies in old novels. But every so often someone or something at Longbourn would make her feel like the poor country cousin.” ― Eden Appiah-Kubi, The Bennet Women"},{"quote":"“During my first days at Smith, I witnessed countless conversations that consisted of one person telling the other that their opinion was wrong. The word \"offensive\" was almost always included in the reasoning. Within a few short weeks, members of my freshman class had quickly assimilated to this new way of non-thinking. They could soon detect a politically incorrect view and call the person out on their \"mistake.\" I began to voice my opinion less often to avoid being berated and judged by a community that claims to represent the free expression of ideas. I learned, along with every other student, to walk on eggshells for fear that I may say something \"offensive.\" That is the social norm here.Reports from around the country are remarkable similar: students at many colleges today are walking on eggshells, afraid of saying the wrong thing, liking the wrong post, or coming to the defense of someone whom they know to be innocent, out of fear that they themselves will be called out by a mob on social media.” ― Greg Lukianoff & Jonathan Haidt, The Coddling of the American Mind: How Good Intentions and Bad Ideas Are Setting up a Generation for Failure"},{"quote":"“Efforts to protect students by creating bureaucratic means of resolving problems and conflicts can have the unintended consequence of fostering moral dependence, which may reduce students' ability to resolve conflicts independently both during and after college.” ― Greg Lukianoff & Jonathan Haidt"},{"quote":"“... campus administrators were modeling distorted thinking. Two categories of First Amendment cases on campus encourage this kind of thinking quite directly: overreaction and overregulation.” ― Greg Lukianoff & Jonathan Haidt, The Coddling of the American Mind: How Good Intentions and Bad Ideas Are Setting up a Generation for Failure"},{"quote":"“modified version of the Chicago Statement that can serve as a template for other schools...:The [INSTITUTION]'s fundamental commitment is to the principle that debate or deliberation may not be suppressed because the ideas put forth are thought by some or even by most members of the [INSTITUTION] community to be offensive, unwise, immoral, or wrong-headed. It is for the individual members of the [INSTITUTION] community, not for the [INSTITUTION] as an institution, to make those judgements for themselves, and to act on those judgments not by seeking to suppress speech, but by openly and vigorously contesting the ideas that they oppose.” ― Greg Lukianoff & Jonathan Haidt, The Coddling of the American Mind: How Good Intentions and Bad Ideas Are Setting up a Generation for Failure"},{"quote":"“This unfortunate phenomenon happened throughout the professor’s career—the students, who could not bear natural interest in the lectures, profited off O’Hare’s passion. They rested their fangs on her neck and used her original elixir for their needs. If they did it unconsciously, then another phenomenon would occur. The students imitated their teachers. And it was the largest robbery of education.By using the vocabulary of their passionate elders, young, ambitious minds convinced themselves and the world of something they did not believe in. Articulation was so personal. It was the result of countless experiences, people, readings, and reflections. When expressing an authentic belief, some ears were fooled by the speaker’s passion, which was like a contagious trance. So those ears applied others’ articulation as their own. By seeing O’Hare speak enthusiastically about a topic, one, with enough attention, could easily think they loved the topic, too.” ― Karl Kristian Flores, A Happy Ghost"},{"quote":"“I could be whatever they wanted me to be. A fun girl, a potential best friend, someone to tell secrets to over midnight snacks. This type of socializing was just me playing little roles for a few moments, but when I need to go all in, I can.” ― Vera Kurian, Never Saw Me Coming"},{"quote":"“Years later, while I was in college, my Dadi asked my mom what I was studying for hours at night, reading all those thick books. My mom said I was most likely going to major in \"the humanities.\" Dadi froze. We feared she had had a ministroke. She slowly covered her shocked mouth and said, \"But in Pakistan only the duffers and idiots do the humanities.” ― Wajahat Ali, Go Back to Where You Came From: And Other Helpful Recommendations on How to Become American"},{"quote":"“Undecided' sounds terrible; I hate uncertainty. This doesn't feel like drifitng aimlessly to me though, because I have a solid plan. It just happens to be a plan to try everything, like a big ol' college buffet. One helping of Anthropology of Food, one side of Introduction to Oceanography, one spoonful of History of Opera... I think it's more like 'overdecided'.” ― Jen Malone, The Arrival of Someday"},{"quote":"“She held a B.A. in English literature, which was of only slightly more interest to employers than his own Ph.D. in linguistics—that is to say, none whatsoever.” ― Cliff Jones Jr., Dreck"},{"quote":"“I looked around at all the college kids who were getting away from their parents for the first time, all these kids ranting and raving about their first drunk or first high, acting as if they’d made the most remarkable discovery.” ― Michael J Heil, Pursued: God’s relentless pursuit and a drug addict’s journey to finding purpose"},{"quote":"“When I got my official acceptance letter in the mail, Umma immediately pinned it to the fridge. She took down my old tests to make room. This letter deserved the entire metal canvas. It was the culmination of all my hard work, all my high school accomplishments. It was the thing I had desperately wanted so many moons ago. Now I don't even know why I'm here.” ― E.L. Shen, The Queens of New York"},{"quote":"“I hated having to kill you but it’s just a game anyway.” ― Tayler Marie Brooks, Assassin"},{"quote":"“He wrapped his arm around her shoulders, covering her mouth with his hand. Her eyes took on a wild look. Good. He had made her fear him. She wasn’t so arrogant now, was she?” ― Tayler Marie Brooks, Assassin"},{"quote":"“It was too quiet. She couldn’t even hear the crickets chirping. The air felt thick and dark. She could almost feel the evilness swirling through the campus.” ― Tayler Marie Brooks, Assassin"},{"quote":"“I think this was just some crazy coincidence or someone is using this game as a cover for their crime.” ― Tayler Marie Brooks, Assassin"},{"quote":"“I told you a long time ago—you’re it for me, Gracie Elizabeth. I’m going to marry you one day.” Pleasure heats my cheeks. Logan’s not the most romantic man on the planet, but when he does express his feelings, he doesn’t do it halfway. “Who says I want to marry you?” I tip my head in challenge. “Don’t you dare pretend we’re not forever.” ― Elle Kennedy, The Legacy"},{"quote":"“It’s college,” Charlotte says with a shrug. “‘Smart but a bad influence’ describes like half the student body.” ― Tracy Deonn, Legendborn"},{"quote":"“It's not good for one's view of human nature, that's for sure. You begin to see, when invitations are coming from festivals and colleges to come read (for an hour for a hefty sum of money), that the institutions are head-hunting for trophy writers. Most don't particularly care about your writing or what you're trying to say. You're there as a human object, one that has won a prize.” ― Annie Proulx"},{"quote":"“I wasn't a genius in the end, but a girl could still hope.” ― Weike Wang, Joan Is Okay"},{"quote":"“Dove tu sei, quella è casa.” ― Emily Dickinson, The Complete Poems of Emily Dickinson"},{"quote":"“Yogurt is culture. Post-post-modern literature is not. I wish I'd have known that before I went to college to learn how to communicate with less efficiency than ducks, because it’s a spoonful that's hard to swallow at first.” ― Jarod Kintz, Music is fluid, and my saxophone overflows when my ducks slosh in the sounds I make in elevators."},{"quote":"“She said she had two brothers, one in heaven and one in college. I said, \"Aww, sorry to hear about the one. Such a tragedy to lose a brother to debt servitude. Tell him to drop out and become a duck farmer before he's too indoctrinated.” ― Jarod Kintz, Music is fluid, and my saxophone overflows when my ducks slosh in the sounds I make in elevators."},{"quote":"“Selin, quello che le tue parole mi comunicano è una cosa molto semplice, molto naturale: la paura della competizione e la paura del rifiuto da parte dei tuoi coetanei. Ovviamente alle superiori sarai stata tra le più brillanti della classe. Poi arrivi a Harvard, ed ecco milleseicento ragazzi della tua età che sono altrettanto brillanti; alcuni magari anche più di te. In ogni conversazione con i tuoi coetanei trovi un sottotesto di competizione. Hai paura che stavolta non sarai all'altezza, che verrai rifiutata.” ― Elif Batuman, The Idiot"},{"quote":"“A happy mind is a learning mind.” ― Anthony T. Hincks"},{"quote":"“I majored in insanity.” ― Steven Magee"},{"quote":"“What kind of cretins cared more about hammering out a string of inheritance than about discovering universal truths? Historians, that was what kind.” ― Elif Batuman, Either/Or"},{"quote":"“Ogni volta che usa la parola \"nostro\" il mio cuore manca un battito.” ― Anna Todd, After"},{"quote":"“College was out of our lives – for me like a lover I had overestimated for four years, for her like a painful vaccine someone else had told her was necessary.” ― Lana Bastašić, Catch the Rabbit"},{"quote":"“Leadership means empowering others to be their best.” ― Aviva Legatt, Get Real and Get In"},{"quote":"“Laughing, Mabel told him to get in and that she'd be happy to give him a lift.“I'm quite heavy,\" George deadpanned. \"Are you sure I won't hurt you?\"Their eyes met and without any hesitation at all, Mabel declared “Positive.\"It was only a moment, only an nth of a second, but something profound seemed to pass between them. It was as though a seed took root in her heart and burst forth through her soul.” ― Stefanie Hutcheson, The Adventures of George and Mabel: Based on an Almost (Kind of? Sort of? Could Be?) True Story"},{"quote":"“degree for sale” ― allexamscertificates.com"},{"quote":"“I graduated from college in the spring with a history degree, only to discover that there are no jobs for someone with my specialty. We've all decided being doomed to repeat history is fine, I guess.” ― Gwenda Bond, Not Your Average Hot Guy"},{"quote":"“You’re objecting to the free exchange of ideas at a place of learning.” ― Vincent H. O'Neil, A Pause in the Perpetual Rotation"},{"quote":"“By the time I returned to campus, however, the students were of a new breed, not interested in politics or the world like the previous generation. Their tender eyes were no longer exposed daily to stories and pictures of atrocity and terror for which they might have felt responsible, given that they were citizens of a democracy destroying another country in order to save it.” ― Viet Thanh Nguyen, The Sympathizer"},{"quote":"“Passed NCLEX without studying” ― allexamscertificates.com"},{"quote":"“NCLEX exam without going to nursing school” ― allexamscertificates.com"},{"quote":"“Buy valid and genuine NCLEX-RN and NCLEX-PN certificate license without taking the text” ― allexamscertificates.com"},{"quote":"“Yuletide Unburdening by Stewart StaffordFading embers of the final Christmas test,No more the frantic angst of dawn,Now it is poised last-minute checks,And then the flushing of responsibility.A fortnight of relaxation and merriment,Awaits the temporarily-exonerated inmate,Though it means entering the bruising storm,Bartered freedom a passenger and guide home.Cross the draughty, great hall, and finish line, Whispered submission of completed exam papers,And the old year's prescribed work is done,Then outside, leaving others to their stress.” ― Stewart Stafford"},{"quote":"“Working for the Ivy League was a bad career choice.” ― Steven Magee"},{"quote":"“La necessità che sentiamol’uno per l’altraè diventata incontrollabile.Entrambi affamati d’amore,continuiamo a nutrirci riempiendocidi vita e passione.Ma non basta mai.Ne vogliamo sempre di più.Ogni giorno, ogni istante.” ― Mag Scrittrice, BAD STARS 1 - Chi è il vero cattivo?"},{"quote":"“Time management is not just about how to obtain more time (if you want to do that, you might as well buy a few clocks off Amazon). Rather, time management is about how to make the most of your time.” ― Joel B. Randall, Study, Sleep, Repeat: 130 Tips to Schedule Your College Life"},{"quote":"“Going to college without putting your heart into it is like setting the microwave for thirty minutes and forgetting to put food in—you use all the same energy with none of the results.” ― Joel B. Randall, Study, Sleep, Repeat: 130 Tips to Schedule Your College Life"},{"quote":"“Perhaps you have some—”“Gel?” I said. “Nah. Leave it. Looks more boyish.” His hands paused. “Do you prefer this more boyish appearance?” “I prefer that you look more like you fit in at a high school rather than graduating college.” ― A. Kirk, Demons in Disguise"},{"quote":"“As someone who progressed from typing 30 words per minute (wpm) to 140 wpm, I have witnessed firsthand how a faster typing speed can improve the quality of life. Faster typists save time, work efficiently, and deliver on their creative and intellectual potential. Indeed, the skill of typing is an especially tremendous asset for students, writers, programmers, translators, white collar workers, and people who otherwise spend a substantial amount of time online.” ― Benjamin Batarseh, Be More Productive: Save 30 Minutes a Day by Learning The Art of Typing"},{"quote":"“... if your eyeballs weren’t actually bleeding you weren’t even close to finishing the required reading for any given semester.” ― Jess Whitecroft, The Last Single Man in Texas"},{"quote":"“So here I am, snuggling a toilet in a shared college bathroom, purging all of this semester's mistakes in a sweaty, tearful, pathetic display of human indecency.” ― Margot Wood, Fresh"},{"quote":"“How to study wisely: (1) don't skip classes; (2) study early in the day; (3) study in isolation; (4) keep your energy levels high; (5) actively recall the material and quiz yourself until you're completely satisfied.” ― Cal Newport, How to Become a Straight-A Student, Deep Work, So Good They Cant Ignore You Collection 3 Books Set by Cal Newport"},{"quote":"“School rewards with a certificate; nature rewards with enlightenment.” ― Michael Bassey Johnson, Song of a Nature Lover"},{"quote":"“Our teachers forgot to mention that by throwing our tassels in the air, we throw every shit anyone can ever give about us. The world says it cares, but it goes ahead and does something different. I wish we weren’t cared for later than we’re supposed to be cared for. It's like: 'You graduated college. There’s no way you have any trace of still being a scared child. Oh, you fucked up? Here’s a jail cell.” ― Karl Kristian Flores, The Goodbye Song"},{"quote":"“Life is hard for a colored boy in the manhood stage to learn from white folks. If F.D. does learn it around white folks, he is going to learn it the hard way. That might make him mad, or else sad. If he gets mad, he is going to be bad. If he's sad, he is going to just give up and not get nowheres. No, I will tell F.D. tonight not to go to no white school and be snubbed when he asks a girl for a dance, and barred out of all the hotels where his football team stays. That would hurt that boy to his heart. Facts is, I cares more about F.D.'s heart, anyhow, than I do his head.” ― Langston Hughes, The Return of Simple"},{"quote":"“B students don’t deserve mixers.” ― A.D. Aliwat, In Limbo"},{"quote":"“Higher education is kind of a racket.” ― A.D. Aliwat, In Limbo"},{"quote":"“We pushed the bike down past the various college hangouts and cafeterias and looked into Robbie's to see if we knew anybody. Alvah was in there, working his part-time jobas busboy. Japhy and I were kind of outlandish-looking on the campus in our old clothes in fact Japhy was considered an eccentric around the campus, which is the usual thing for campuses and college people to think whenever a real man appears on the scene-colleges being nothing but grooming schools for the middleclass nonidentity which usually finds its perfect expression on the outskirts of the campus in rows of well-to-do houses with lawns and television sets in each living room with everybody looking at the same thing and thinking the same thing at the same time while the Japhies of the world go prowling in the wilderness to hear the voice crying in the wilderness, to find the ecstasy of the stars, to find the dark mysterious secret of the origin of faceless wonderless crapulous civilization.” ― Jack Kerouac, The Dharma Bums"},{"quote":"“I’m a person who saves things. I’ll hold on forever.” ― Jenny Han, Always and Forever, Lara Jean"},{"quote":"“Anyone who speaks as if they were alive and knew what was going on hundreds, thousands, or even a millions of years ago is trying to brainwash you into believing their fantasy of how things were in the past..” ― James Thomas Kesterson Jr"},{"quote":"“Go to Bitcoin instead of college.” ― Olawale Daniel"},{"quote":"“Go and learn about blockchain instead of going to college. You'll gain a whole lot of valuable information that would change your life before you graduate from college.” ― Olawale daniel"},{"quote":"“Learn about blockchain instead of going to college. You'll gain a whole lot of valuable information that would change your life.” ― Olawale Daniel"},{"quote":"“I'm hyptothetically confused. There're are too many fake people in this conversation.” ― Ilsa Madden-Mills, The Revenge Pact"},{"quote":"“Dammit. Forgot my clothes. Again. My brain truly is the Bermuda triangle. Info comes in and poof, it vanishes. I have excellent recall for the oddest things. Mating rituals? Check. Football stats? Locked and loaded. Movie quotes? Branded in my skull. My classes at Braxton? Freaking ghost town with tumbleweeds blowing through it. That plane has flown over thr triangle and disappeard.” ― Ilsa Madden-Mills, The Revenge Pact"},{"quote":"“College is extra school for people too dumb to learn the first time around.” ― Tara Westover, Educated"},{"quote":"“Truly great papers must be about truly great subjects.” ― A.D. Aliwat, In Limbo"},{"quote":"“Nobody really cares about or checks your GPA after college, except for, like, grad schools, who only barely do, taking a whole lot of other things into consideration.” ― A.D. Aliwat, In Limbo"},{"quote":"“500+ contacts, 100+ friends..!30+ close friends..!But, still, I dial,Those 9 numbers..!When I need to,Share my heart..!When I need to,See my besties...!” ― Nayan Kasturi"},{"quote":"“Vassar was like all colleges in the 1960s: a scene of deep friendships, love, booze, dope, sex, music, and politics.” ― Rebecca Eaton, Making Masterpiece: 25 Years Behind the Scenes at Masterpiece Theatre and Mystery! on PBS"},{"quote":"“Most stories of unrequited love are popular and famous. However, love happens without caring for consequences.” ― Ravi Ranjan Goswami, Parallel Love"},{"quote":"“Different regions evoke different images in the minds of high school students, often depending on where they grew up. In the age of cyberspace, college is still synonymous with a quaint New England town featuring the traditional red brick,white columns, and ivy all around. That enduring mental picture combines with the seemingly inborn cultural snobbery of the East Coast to produce millions of students who think that civilization ends at the western edge of Pennsylvania—if notthe Hudson River. For Midwesterners, the situation is just the opposite: a century-old cultural inferiority complex. Many applicants from those states will do anything to get the heck out, even though there are more good colleges per capita instates like Iowa, Minnesota, and Ohio than anywhere else in the nation. The West Coast fades in and out as a trendy placefor college, depending on earthquakes, the regional economy, and the overcrowding and tuition increases that plague the University of California system. Among those seeking warmer weather, the South has become a popular place, especiallysince Southerners themselves are more likely to stay close to home.Collective perceptions of the various regions have some practical consequences. First, most of the elite schools in theNortheast are more selective than ever. In addition, a lot of mediocre schools in the Northeast, notably Boston, are beingdeluged with applicants simply because they are lucky enough to be in a hot location. In the Midwest, many equally good or superior schools are much less difficult to get into, especially the fine liberal arts colleges in Ohio. In the South, the booming popularity of some schools is out of proportion to their quality. The weather may be nice and the football top-notch, but students who come from far away should be prepared for culture shock.” ― Fiske Guide To Colleges, Fiske Guide to Colleges 2005"},{"quote":"“Applicants must also choose whether to be in or near a city or whether to attend college in a rural area. City suburbs are always a favorite because they combine access to the urban area with the safety that parents crave. During the 1970s, rural hideaways were popular among students who wanted to curl up with a book on bucolic hillside. Today, cow colleges are out as students hear the siren song of the city.Boston has always been preeminent among student-friendly big cities, offering an unparalleled combination of safety, culturalactivities, and about fifty colleges. Chicago and Washington, D.C., are also immensely popular. On the West Coast, Berkeley, California, is a mecca for the college-aged,though today an overcrowded one. Legendary college towns like Ann Arbor, Michigan; Boulder, Colorado; and Burlington, Vermont, provide wonderfully rich places for a college education. Perhaps the hottest place of all among today’s students is New York City, where private institutions such as Columbia University, Barnard College, and New York University are enjoying record popularity.” ― Fiske Guide To Colleges, Fiske Guide to Colleges 2005"},{"quote":"“All the country’s oldest colleges are private, founded when the United States consisted of the East Coast. To this day, the Northeast is still a stronghold of private colleges and universities, with few prestigious public ones. When the country expanded westward in the 1800s, public education became a reality and thus the state university systems in the Midwest, South, and West are much stronger.” ― Fiske Guide To Colleges, Fiske Guide to Colleges 2005"},{"quote":"“the University of the South, a Tennesseeliberal arts college with a handful of graduate students, known informally as Sewanee (because that’s the name of thetown). The first thing you’ll notice on visiting Sewanee is that most of the men are wearing jackets and ties, while most ofthe women are wearing makeup and skirts. Forty years ago, most colleges had a similar dress code. Today, Sewanee is one of a handful. The majority of students pledge fraternities and sororities and social life revolves around a never-ending stream of “big-weekend” beer bashes. The biggest of them all is homecoming weekend, where students get a date and dress up for a huge see-and-be-seen fashion show that includes innumerable cocktail parties before and after. Conservative, well-heeled, and All-American, Sewanee is the perfect place for a carefree 1950s-style college education. In the words of one student, Sewanee has “the happiest college student body I have ever encountered.”No one would ever say such a thing about Bard College, a school of similar size about an hour north of New York City. Though the students may find happiness there, too, it is well hidden beneath a thick veneer of liberal artistic angst. Bard students, it seems, carry the weight of the world on their shoulders. If there is an oppressed group anywhere to be found, Bard students can be counted on to buy T-shirts, sellbuttons, and organize protests on its behalf. As for clothes, you would be hard-pressed to find a Bard man who even owns a jacket and tie. Nor would the typical Bard woman be caught dead in a dress—unless it was paired with combat boots. Jewelry and makeup worn in traditional ways are nonexistent, but there is plenty of spiked hair, fluorescent hair, tattoos, and piercings protruding from every conceivable body part. As for football and fraternities? Take a wild guess. The biggest social event of the year at Bard is called Drag Race, where everyone dresses in drag and parties nonstop.” ― Fiske Guide To Colleges, Fiske Guide to Colleges 2005"},{"quote":"“I think one of the best things someone can learn in university is to doubt what is obvious. Explain the simple and define the confusing. Complicate what is clear and clarify the complex. That is why you learn it at university, not in school. You cannot memorise it.” ― Thomas Vato"},{"quote":"“The future of higher education will be micro-degrees becoming the norm with people choosing a focused micro-degree rather than a full 4-year degree. 4-Year degrees will focus on a hybrid model, with core requirements being on-line and only one’s major will be in-class.” ― Tom Golway"},{"quote":"“Even though I'm trying hard not to let it show, I want to swim past the breakers, and sink to the bottom and stay there with my eyes closed and the water covering my ears. And yes, I know that's an overreaction. When you read this you'll think \"Mom, please. Really?\" You'll roll your eyes in that carefree way of yours and shrug those rebellious bangs off your forehead. You'll offer the one-sided smirk that says \"you and I are the weird ones in the family - the two that always get each other's hidden meanings\". Only this time, you don't get it. You can't. You won't for another 25 or 30 years - until you lie on the sand, or sit in a stadium seat somewhere or stand at your kitchen stove and catch a glimpse of your first born, your baby, suddenly inhabiting the body of an adult. Someone you barely recognize. In that instant, you'll think \"how did this happen? When did this happen? Have I taught enough? Have I listened enough? Have I coached and planned and laughed and worried enough? Can I let go enough?\" I'm afraid I won't be able to do it gracefully when the moment comes. I'm not ready. It's too soon. Instead of compiling pictures for a tasteful collage to make your dorm room homey, I want to climb inside the photos and live them again. Every bedtime story, lost tooth, birthday cake, backyard campout, ballgame, wildflower bouquet, rainy day and homemade Mothers Day card. All the golden moments and all the quiet, ordinary ones. I'd treasure them even more the second time around. If only life came with a rewind button, with do overs.” ― Lisa Wingate, Tending Roses"},{"quote":"“These are the years of lonely nights. There may be no one to talk to for years other than a notebook, a dead role model, a pet, a lamp post, or just your sad footsteps scraping against pavement. This doesn’t make sense, but it will.” ― Karl Kristian Flores, The Goodbye Song"},{"quote":"“The problem with college students is that they come into university not knowing what they love, but are handed vocabulary and concepts about their chosen passion, which equips them with rich arguments and rich words that end up fooling people they love something when they are really just passionate about someone else’s passion. Sometimes, people use knowledge as a seat belt to strap themselves in a car that they weren’t supposed to be in. They hold onto mission statements or causes and regurgitate ideas with such great articulation that you (and they) could almost believe they really loved their careers.” ― Karl Kristian Flores, The Goodbye Song"},{"quote":"“I want to close my eyes and feel the memory of the moment only when it’s us became only us, forever.” ― Chloe Liese, Only When It's Us"},{"quote":"“October is a fine and dangerous season in America. It is dry and cool and the land is wild with red and gold and crimson, and all the lassitudes of August have seeped out of your blood, and you are full of ambition. It is a wonderful time to begin anything at all. You go to college, and every course in the catalogue looks wonderful. The names of the subjects all seem to lay open the way to a new world. Your arms are full of new, clean notebooks, waiting to be filled. You pass the doors of the library, and the smell of thousands of well-kept books makes your head swim with a clean and subtle pleasure.” ― Thomas Merton, The Seven Storey Mountain"},{"quote":"“Being in college gave me a sense of vocation. It exempted me from an oppressive system of social and personal responsibility- from going through the motions like a cog, from being whipped and beaten by everyone for not having worked hard enough and then having to put on a repentant face afterward.” ― Qiu Miaojin, Notes of a Crocodile"},{"quote":"“Like death, college serves as a kind of escape hatch. But while death takes you straight to the morgue, college is a single rope dangling loose from the inescapable net of society.” ― Qiu Miaojin, Notes of a Crocodile"},{"quote":"“I've realised that the most diverse academic disciplines are not really incompatible but are rather harmonious.” ― Shivanshu K. Srivastava"},{"quote":"“Education is guaranteed to mitigate ignorance, not to eradicate stupidity.” ― Mokokoma Mokhonoana"},{"quote":"“If you have some kind of skill to survive, if dishonesty disturbs you, if you avoid evil acts, then you had very good teachers.” ― Amit Kalantri, Wealth of Words"},{"quote":"“My dad managed to convey the importance of working hard in school using a subtle blend of emotional blackmail (I’m paying for the best high school in New York, don’t make me regret it) and fear (if you don’t work hard now you won’t get into a good college and you won’t get a good job and you won’t meet a nice man and you’ll end your life filled with regret and fast food). It was incredibly effective.” ― Abbi Waxman, I Was Told It Would Get Easier"},{"quote":"“Everyone tells you middle school is fun, and then you get there and it sucks. Then high school is going to be fun, but you get there and it both sucks and is really hard. Now, apparently, college is going to be fun, but it really seems like one more hurdle standing between me and actual happiness. Whatever that is.” ― Abbi Waxman, I Was Told It Would Get Easier"},{"quote":"“Connell initially felt a sense of crushing inferiority to his fellow students, as if her had upgraded himself accidentally to an intellectual level far above his own, where he had to strain to make sense of the most basic premises.” ― Sally Rooney, Normal People"},{"quote":"“It is without doubt, nowadays, that many students lack the ability to know or find their true passions in life; after all the criticism they went through. Whether it is at school, college, university or any learning environment.” ― Mwanandeke Kindembo, Treatise Upon The Misconceptions of Narcissism"},{"quote":"“Universities are fueled in large measure by what's called overhead of the grant...so if you get a million dollar grant, half or more will go to your university, right? So that's what builds the buildings and fuels the place. So the university has an incentive to get as many people to file grant applications as they can, and they have an incentive to hire people whose grant applications will be large rather than small.So this, for example, is one of the reasons that science has taken up arms against theory –that is to say, proper scientific theoreticians like me – and it has instead hired people who run big expensive experiments: Because big expensive experiments have big grants, and those big grants bring in money.But if you were a university and what you wanted was to have people writing big expensive grants who were capable of getting them, then what you would want to do is...you would want to free those people from teaching, and you would want to get people who weren't so expensive to do the work of the university...and the way you do that is: you bring them on as graduate students; and you pay them an appalling wage; you claim that they are not actually workers, that they are students; and they do most of the teaching, and they do a lot of the work of the university, for incredibly low amounts of money; they live under poor conditions; and increasingly they have to come from abroad where they are in some sense getting a deal that still makes sense.But this means that we overproduce PhDs. We give people degrees instead of money to do the work of the university, in order that people who are capable of getting the grants spend almost full time doing that job. And it's a racket.The person who knows the most about this is actually Eric, my brother. So...what he unearthed was actually that there was an explicit conspiracy to game the visa system in order to keep this system running...that effectively a fake shortage of science students was created to allow the universities to basically flood the market, to drive the wages down.” ― Bret Weinstein"},{"quote":"“Offline classes form the nucleus of the college life. Online classes can only complement offline education, not replace it.” ― Shivanshu K. Srivastava"},{"quote":"“Her mouth opens in a shocked little “o,” and I know I’ve got her. Now that we’re not teammates, I’m going to make Harley mine.” ― Anita Knight, Love All"},{"quote":"“All students may not remember the teachings of their teachers, but they all remember the teachers.” ― Amit Kalantri, Wealth of Words"},{"quote":"“We would like to see a world in which everyone who can benefit from going to college, and wants to go to college, is able to do so. But we do not accept the basic premise that people are useless to the economy unless they have a bachelor's degree. And we certainly do not think that those who do not get one should be somehow disrespected or treated as second-class citizens.” ― Anne Case, Deaths of Despair and the Future of Capitalism"},{"quote":"“If there's a violent mob on campus, it isn't Ben Shapiro's fault - he's just someone coming to campus to talk about ideas. Mob violence is the mob's fault” ― Dennis Prager, No Safe Spaces"},{"quote":"“Doctor, as in “an apple a day”? Or one of those guys who’s got an honorary title for staying in college too long?” ― Jordan Castillo Price, GhosTV"},{"quote":"“কেউ অনার্স বা মাস্টার্সে ৩.২৪ পেয়েও বি+ [৩.২৫] পায় না। কেউ ৩ পেলে বি, আর কেউ ৩.২৪ পেলেও বি। তাহলে ৩-এর পর .২৪ এর কি কোনও মূল্য থাকে?” ― Md. Ziaul Haque"},{"quote":"“In Hon's or Master's, some don't get B+ [3.25] even after obtaining 3.24. If 3 and 3.24 = B, then does .24 have any value after 3?” ― Md. Ziaul Haque"},{"quote":"“The parents have all been posting up a storm, of course. At one point the previous day we'd all compared embarrassing \"Can you believe she's looking at colleges?/tearful emoji\" posts, to which all their friends added shocked faces and commented on the passage of time, yawn. Some of them went for the comparison post (Here's a picture of little Wanda in her Dorothy costume at four, here she is at sixteen; Oh my god I feel so old because this rite of passage is about me, not the one actually passaging) ...” ― Abbi Waxman, I Was Told It Would Get Easier"},{"quote":"“First day of college and I’m already falling back on clichés. Now I know why people resort to them: it’s safer to talk about nothing than face real questions.” ― Geneva Lee, Blacklist"},{"quote":"“A girl in middle school once told me that a penis feels just like a tampon, only bigger. I’m not sure if it’s something her mom told her to shut her up, or if it’s somehow true. But as I’m staring at this man’s beautiful, bare naked form in front of me, I can tell you that I highly doubt it’s going to feel like a tampon when he’s inside me.” ― Anita Knight, Crush Course"},{"quote":"“The opposite door to the bathroom swings open, letting cold air into the steamy atmosphere, and in comes Jason Coleman, AKA my suitemate, and the most attractive guy I've ever laid eyes on.” ― Anita Knight, Suite Mates"},{"quote":"“All this had no truck whatsoever with the conditions back home, their travails as marginal farmers, their caste ridden daily struggles, the patriarchal limits on the daily existence of the women. But, really, if you scratched the surface, the colleges were little sanctuaries mirroring the larger social politics, their student politics as ossified and as parochial as the regional politics. Somehow when it came to that, things seem to settle into the old patriarchal, feudal structures with Capitalistic flourishes only outwardly changing appearances. Infact all the more misleading- with modernity being limited to a seductive idea of affluence.” ― Sakoon Singh, In The Land of The Lovers"},{"quote":"“The college lifestyle is about becoming independent, with no one else around to force you to do anything. So there's this muck that hasn't been dealt with, and because all your arrangements are loose now, you have no one to hold on to, which means you get sucked into the vacuum cleaner and tossed around in it.” ― Qiu Miaojin, Notes of a Crocodile"},{"quote":"“My college years were spent among people who were like oil in water, unable to form bonds.” ― Qiu Miaojin"},{"quote":"“2020 was the year of distance learning.” ― Steven Magee"},{"quote":"“2020 was the year of sickened university students.” ― Steven Magee"},{"quote":"“In the best circumstances, applying and getting accepted into a PhD program is an expensive ordeal. Colleges do not attempt to make the process any less stressful or cheaper.” ― Zachariah Renfro"},{"quote":"“Are there any particular majors you're interested in?\"\"Not really.\" Saying advanced breakfast with a minor in cable television would surely bring about some epic battle that Mrs. Wentworth's smile was doomed to lose.” ― Emma Mills, First & Then"},{"quote":"“First things first: Always go to class! The importance of this rule cannot be overmphasized. It doesn't matter if your class meets at 6:00 A.M., at the top of the steepest hill on campus, on saturday mornings—wake up, get dressed, and go to the lecture on time. As Lydia, a straight-A student from Dartmouth, explains, if you skip class, \"it'll take twice as long studying to make up for what you missed.\" This is why class attendance is so important. Not because learning is power, or it's what your parents would want you do, but because it saves you time. if you attend class regularly, you will significantly cut down on the amount of studying required to score high grades. Don't make this negotiable. Even if you're tired, hung over, or extremely busy, find a way to make it there.” ― Cal Newport, How to Become a Straight-A Student"},{"quote":"“In the United States, more than a quarter of people over eighteen reported that they engaged in binge drinking during the previous month. This pattern is even more prevalent among college students, nearly 40 percent of whom reported binge drinking in the previous month. Whether cause or effect, about half of these students (20 percent) meet the criteria for an alcohol use disorder, and 25 percent report academic consequences from drinking. Binge drinking is risky for anyone, but particularly for those whose brains are still developing. The impact of high alcohol concentrations during this “plastic” period leads to lasting alterations in brain structure and function and is more likely to result in an alcohol use disorder. The converse is also true: one of the most effective ways to curtail the risk of addiction is to avoid intoxication during periods of rapid brain development.” ― Judith Grisel, Never Enough: The Neuroscience and Experience of Addiction"},{"quote":"“I decided that I was going to fewer student parties after I ripped part of the sleeve out of my black dress helping a freshman climb a fence. By the end of the first semester, what I wanted to do most in the world was invite a few of my husband’s students over for tea and drop them down the well.” ― Shirley Jackson, Raising Demons"},{"quote":"“And the more I think about it, the more frustrated I get by the entire concept of a backup plan. Because it only ever seems to pertain to people who are interested in art, music, theater--and yes, the circus. Nobody would ever dream of going up to someone in medical school and telling them, 'Gee, I really think you should have a backup plan. You know, just in case this doesn't work out for you.” ― Akemi Dawn Bowman, Harley in the Sky"},{"quote":"“My advice to students is always the same, \"Hit the Books - Before the Books hit you!” ― Kurt Bryan"},{"quote":"“Few things are more important than learning how to learn.” ― Richie Norton"},{"quote":"“Everyone keeps saying tragedy with vague disdain, as if the shooting was just a mad dream, not some kid adding his personal darkness to a collective shadow that had already spread across our lives.” ― John Englehardt, Bloomland"},{"quote":"“Perhaps college may be around the bend in the road, but I haven't got to the bend yet and I don't think much about it lest I might grow discontented.” ― L.M. Montgomery, Anne of Avonlea"},{"quote":"“They say you’re always at the place you need to be.But perhaps it’s not so that we go to stay, but see to leave.” ― Karl Kristian Flores, Can I Tell You Something?"},{"quote":"“I accept no responsibility for anything I did while drunk.” ― Steven Magee"},{"quote":"“He wishes he had a way of telling them that they can be part of transforming this new place into an old one, that sometimes being the one who etches the lines in the façade is as important as choosing something already weathered and worn.” ― Seanan McGuire, Middlegame"},{"quote":"“College had always felt more like an anchor than a kite, a tedious and time-eating entrapment. Studying for pointless tests stole away nights, rote memorization disappearing the freedom of creation.” ― Aspen Matis, Your Blue Is Not My Blue: A Missing Person Memoir"},{"quote":"“In the school, college or university class routines, there should be no classes for the teachers to conduct at a stretch such as 10-11, 11-12, 12-1. There must be a little gap in between the classes such as, 10-11, 11:10-12:10, 12:20-1:20. These gaps are so important because after conducting one class, a teacher needs some moments to reach another class. In addition, the students also need some time to freshen up. In fact, the classes in a row make them feel bored.” ― Md. Ziaul Haque"},{"quote":"“The nine rubies were used afterwards in agriculture. You had only to throw them out into a field if you wanted it plowed. Then the whole surface of the land turned itself over in its anxiety to get rid of something so wicked, and in the morning the field was found to be plowed as thoroughly as any young man at Oxford.” ― E. Nesbit, The Book of Dragons"},{"quote":"“I remember in college a long time professor turned to me and she said, “you’re the only one who has ever done something with this.” All those years of students learning and no one has done something with it while in school? Blasphemy.⁣” ― Richie Norton"},{"quote":"“My nickname when I worked at the university research and teaching hospital was ‘Angel’.” ― Steven Magee"},{"quote":"“In six weeks, I’d be packing up all my stuff and getting the hell out of Pineville. But until then, my life at The Mall would really, really suck.” ― Megan McCafferty, The Mall"},{"quote":"“There was such a feeling of innocence here, of make-believe, of youth, of startling passion. But that was the beauty of such a university: students debating over life-and-death issues in an environment as insulated as Disney World. Reality had nothing to do with the equation. And that was okay. In fact, that was how it should be.” ― Harlan Coben, One False Move"},{"quote":"“The more educated someone is, the less likely it usually is for them to say that they do not know, when they do not know.” ― Mokokoma Mokhonoana"},{"quote":"“The Ivy League I am familiar with is riddled with incompetence.” ― Steven Magee"},{"quote":"“I didn’t know what I was doing at college aside from fulfilling a destiny that no one bothered explaining to me.” ― Elizabeth Gilbert, City of Girls"},{"quote":"“Trying to understand why your workers are sick may lead to you being shown the door.” ― Steven Magee"},{"quote":"“After informing the management team at Dartmouth College that I was keeping daily records of the behavioral problems I was observing in all staff that I supervised, they insisted those records be destroyed.” ― Steven Magee"},{"quote":"“I was shown the door by Dartmouth College after reporting behavioral problems in all workers that I supervised!” ― Steven Magee"},{"quote":"“College, after all, as those who like to denigrate it often say, is “not the real world.” But that is precisely itsstrength.” ― William Deresiewicz, Excellent Sheep: The Miseducation of the American Elite and the Way to a Meaningful Life"},{"quote":"“Resumes are dead.” ― Richie Norton"},{"quote":"“Trying to get Dartmouth College to acknowledge the behavioral problems in all staff that I supervised got me a final warning of dismissal, when no previous warnings had been received.” ― Steven Magee"},{"quote":"“By the time I left Dartmouth College, I regarded the management team as a dangerous group of people.” ― Steven Magee"},{"quote":"“Universities will try to become relevant again by not focusing on the diploma as much because companies don’t require them anymore (unless doctor or lawyer type). You’ll see people focusing back on skills, results and a mega double down on personal brand.” ― Richie Norton"},{"quote":"“Here's what I want to know about school. Everyone assumes kids are bad at decisions, right? So why would anyone let an eighteen-year-old kid pick what they want to do in college?” ― Mary H.K. Choi, Permanent Record"},{"quote":"“But I made it. And for some reason, I’m not worried about my job prospects. I truly believe I will be okay.” ― Katherine Reay, Dear Mr. Knightley"},{"quote":"“The pressure to be great, not good, is unrelenting. Believing that this pressure will simply disappear once kids arrive on campus seems like wishful thinking.” ― Kate Fagan, What Made Maddy Run: The Secret Struggles and Tragic Death of an All-American Teen"},{"quote":"“How they became friends was no great mystery, but now they remained so, braided together beyond their shared college quarters, this transcended the usual alchemy of optimism and obligation that kept friendships intact, kept people from fading into other categories: old friend, college friend, just someone I once knew. None of the four would ever be just anything to the others...” ― Elizabeth Ames, The Other's Gold"},{"quote":"“Her college years felt like freedom to her.” ― Ian McEwan, On Chesil Beach"},{"quote":"“Second semester will get better, had to get better, Madison thought. If nothing else, through sheer force of will, perhaps she could make it better. And if she told enough people that things were going to go well this time around, said it out loud repeatedly, maybe she could even convince herself.” ― Kate Fagan, What Made Maddy Run: The Secret Struggles and Tragic Death of an All-American Teen"},{"quote":"“She didn't have to return to Philly until Sunday, yet from the moment she sat down in the car, Madison was already projecting five days into the future and anticipating the sadness that returning to campus would bring.” ― Kate Fagan, What Made Maddy Run: The Secret Struggles and Tragic Death of an All-American Teen"},{"quote":"“My clients spend their childhoods and in particular their adolescences putting their healthy development on hold, coached and managed by parents who are so fearful and anxious about helping their children succeed that there is simply no room for their children, my clients, to begin to know themselves.” ― Kate Fagan, What Made Maddy Run: The Secret Struggles and Tragic Death of an All-American Teen"},{"quote":"“While my degree opened up doors for me, it ultimately gave me occupational diseases.” ― Steven Magee"},{"quote":"“The library was ... scattered with odd cushions and strange padded built-in furniture added a few years ago to placate the rioting students of the time, who could never seem to make up their minds whether they were angriest about Viet Nam, about being made to learn a foreign language, or about being made to sit at a hard wooden desk while they did it. The College, being unable to do anything about Viet Nam and unwilling to do anything about the foreign language requirement, had reformed the furniture in the library.” ― Pamela Dean, Tam Lin"},{"quote":"“A collaborative analysis: i.e, he asked questions until he got either the answers he wanted or some other that was acceptable because he had never thought of it.” ― Pamela Dean, Tam Lin"},{"quote":"“Peg was involved in a common form of senior-year panic that caused its victims to exhibit permanent distraction and to take up residence in the library.” ― Pamela Dean, Tam Lin"},{"quote":"“I cried because I knew for certain that I was leaving home, and abruptly, I did not know if it was such a good idea- I realized that I, like my parents, had never believed I'd actually go.” ― Curtis Sittenfeld, Prep"},{"quote":"“It was more when things slowed down, during the parts when you were supposed to have fun, that my lack of friends felt obvious- on Saturday nights, when there dances I didn't go to, and during visitation... I spent those times hiding. Most of the other girls propped open their doors for visitation, but we kept ours shut.” ― Curtis Sittenfeld, Prep"},{"quote":"“In the school, college or university class routine, there should be no classes for the teachers to conduct at a stretch such as 10-11, 11-12, 12-1. There must be a little gap in between the classes such as, 10-11, 11:10-12:10, 12:20-1:20. These gaps are so important because after conducting one class, a teacher needs some moments to reach another class. In addition, the students also need some time to freshen up. In fact, the classes in a row make them feel bored.” ― Md. Ziaul Haque"},{"quote":"“When I reflect on my time working for the W. M. Keck Observatory, Columbia University and Dartmouth College, my memories are not of brilliant minds advancing science, but rather of shady people damaging their workers health in order to obtain tainted astronomical data.” ― Steven Magee"},{"quote":"“What if what she wanted and what she thought she was supposed to want were opposed? And what if this gap between head and heart happened again?” ― Kate Fagan, What Made Maddy Run: The Secret Struggles and Tragic Death of an All-American Teen"},{"quote":"“For someone who struggles with the unknown, freshman year of college can feel like walking a path lined with land mines- heart racing, disaster around every corner.” ― Kate Fagan, What Made Maddy Run: The Secret Struggles and Tragic Death of an All-American Teen"},{"quote":"“Parents don't really know how to help. Some aren't prepared for this new version of their high-achieving kid: doubting, sad, tired, confused- emotions they may have rarely dealt with in high school. And isn't college supposed to be even better than high school? When your child is more mature, self-sufficient, and otherwise flourishing just as she always has been, except now at an even higher level?” ― Kate Fagan, What Made Maddy Run: The Secret Struggles and Tragic Death of an All-American Teen"},{"quote":"“I knew the problem was with the school, because the second I left campus, I was happy again.” ― Kate Fagan, What Made Maddy Run: The Secret Struggles and Tragic Death of an All-American Teen"},{"quote":"“In high school she even had time for herself, to draw and read, to write down quotes, to be inside her own head without an agenda.” ― Kate Fagan, What Made Maddy Run: The Secret Struggles and Tragic Death of an All-American Teen"},{"quote":"“Dartmouth College demonstrated gross incompetence with mercury systems when I worked for them.” ― Steven Magee"},{"quote":"“Dartmouth College has an established history of blatant incompetence with handling mercury.” ― Steven Magee"},{"quote":"“Ignore the behavioral problems in the staff or be fired.” ― Steven Magee"},{"quote":"“I worked for Dartmouth College where Karen Wetterhahn was killed by mercury poisoning. I never received any industry recognized training in handling mercury systems and also ended up with nasty mercury poisoning.” ― Steven Magee"},{"quote":"“While handling mercury systems in the employment of Columbia University and Dartmouth College, I have no recollection of receiving industry recognized health and safety training for the workplace hazards present.” ― Steven Magee"},{"quote":"“When I worked at Columbia University and Dartmouth College we would handle the rubber filled mercury mirror support system with bare hands and no respiratory protection. What was ironic was that we were visually inspecting it for leaks and that microscopic leaks could be entering our bodies through our bare skin and respiratory tracts. I had no industry recognized training in correctly handling mercury systems, dealing with unexpected spills, the health hazards and the correct storage protocols. When I reflect on the mercury filled rubber mirror support band, it was just one of the many incompetence's that astronomers were subjecting their unsuspecting staff to.” ― Steven Magee"},{"quote":"“Anyway, the important thing to remember about Ault is why you applied in the first place. It was for the academics, right? I don't know where you were before, but Ault beats the hell out of the public high school in my town. As for the politics here, what can you do? There's a lot of posturing, but it's all kind of meaningless.” ― Curtis Sittenfeld, Prep"},{"quote":"“Either Ault was a lot harder than my junior high had been, or I was getting dumber- I suspected both. If I wasn't literally getting dumber, I knew at least that I'd lost the glow that surrounds you when the teachers think you're one of the smart, responsible ones, that glow that shines brighter every time you raise your hand in class to say the perfect thing, or you run out of room in a blue book during an exam and have to ask for a second one.” ― Curtis Sittenfeld, Prep"},{"quote":"“Then I thought of how my life at Ault was a series of interactions and avoidance of interactions in which I pretended not to mind that I was almost always by myself. I could not last for long this way, certainly not for the next three years; I'd been at Ault only seven months, and already, my loneliness felt physically exhausting.” ― Curtis Sittenfeld, Prep"},{"quote":"“She has decided to keep going, as anyone could tell by her closed eyes and calm expression. She realizes that all big decisions are ones that must be decided and decided again. She imagines that when you fall in love, you must decide to be in love a million times or more, and when you go to college, you must decide again and again to stay in college, and the same thing is true when you decide to run across the United States of America after a horrible tragedy.When you are a person who cares for any other person, you must decide again to care, she also understands.” ― Deb Caletti, A Heart in a Body in the World"},{"quote":"“Somewhere in the last few months, it’s like someone has flicked a switch and he’s gone from “cute looking boy” to “muscular sexy man” just like that.\", Celestra Caine in FADE by Kailin Gow” ― Kailin Gow"},{"quote":"“I don’t know what that thing is, but I know you aren’t it. You care too much about the world and the people in it. All that cared about was killing.”, Jack Simple to Celestra Caine in FADE by Kailin Gow” ― Kailin Gow, Fade"},{"quote":"“I know I can’t let this summer be the last happy summer we have at the beach house.\", Loving Summer by Kailin Gow” ― Kailin Gow, Loving Summer"},{"quote":"“College students’ bizarre actions are incomprehensible until scrutinized under the lens that they are simply defying their mortality. A person learns how to live by contemplating death, because when a person faces death, it strips everything superfluous away, revealing the sterling qualities of life. University students newly freed from parental restraints desire to ascertain the essence of their life, but they lack the maturity and life experiences meaningfully to contemplate the weighty subjects of life and death. Realizing their immaturity and resultant angst, collegiate students act recklessly in order to loudly proclaim that they do not care if fate demands that they die will, when in fact they are terrified of both living and dying.” ― Kilroy J. Oldster, Dead Toad Scrolls"},{"quote":"“There is more to knowing than just knowing.” ― Mokokoma Mokhonoana"},{"quote":"“I think about my education sometimes. I went to the University of Chicago for a while after the Second World War. I was a student in the Department of Anthropology. At that time, they were teaching that there was absolutely no difference between anybody. They may be teaching that still.” ― Kurt Vonnegut, Slaughterhouse-Five"},{"quote":"“Returning home can be awkward for any college-age kid. We spend our teenage years learning to be obnoxious and short with our parents. We prefer to confide in friends. We connive, we become reclusive, we strive to become remote. We may still have a little voice somewhere deep inside pleading, 'Just keep loving me, I'll come back,' but for the most part, coming home from college is like reaching for the end of an umbilical cord we worked so hard to cut. We enjoy the security, the lazy familiarity, but we have left the nest, proven our capacity for independence, and now demand the respect afforded adults.” ― Nick Trout, Ever By My Side: A Memoir in Eight [Acts] Pets"},{"quote":"“You and Tom must have made a good match,” he said. “What are youdoing? Is this the way you initiate new tutors? By stabbing them in the shoe?” ― Anyta Sunday, DJ Dangerfield"},{"quote":"“Not knowing how to get what you want is better than knowing how to get what you do not want.” ― Mokokoma Mokhonoana"},{"quote":"“Generally, education is to curiosity what circumcision is to the foreskin.” ― Mokokoma Mokhonoana"},{"quote":"“I am an undocumented transfer student to UCLA. This university has always been my dream, but being here has been on of the hardest experiences of my life. I do not receive financial aid, and I do not meet any of the requirements to receive any kind of scholarship because I do not have a Social Securty number.” ― Eileen Truax, Dreamers: An Immigrant Generation's Fight for Their American Dream"},{"quote":"“Over the last 10 years, we've learned that there's still no better way to succeed in college than to be well read.” ― Doug Estell, Reading Lists for College Bound Students"},{"quote":"“A few months ago, leaving for college seemed glamourous, but now it’s hard to believe that this little dorm room, with its scratchy sheets and a lock that sticks, is home. It’s hard to accept that this is my new life, that these are my new friends. I am one in many here. There are dozens here as good as me, even more who are smarter, funnier. And it scares me because before I stuck out and now I blend in.” ― Samantha Schutz, I Don't Want To Be Crazy"},{"quote":"“I am grown in so many ways, but in front of my parents I am still a child. I am having a hard time throwing off the skin that I pick and peel. I am the only one who can do it, but I can’t seem to let myself.” ― Samantha Schutz, I Don't Want To Be Crazy"},{"quote":"“When I thought about it, I realized how silly and artificial the things I knew about each of them were, but that was how it happened when nobody knew anybody and you tried listing off your interests and background in the hopes of finding people who would mesh with your interests and background.” ― Emily Poirier, Vampires Don't Need an Invitation"},{"quote":"“This is what a control freak learns inside the compressed otherworld of college, maybe above all else: There are simply other ways of being.” ― Michelle Obama, Becoming"},{"quote":"“On Books - Books are the ultimate accessory; they go with everything. Carpets wear down, drapery fades, statuary chips, wallpaper tears and appliances become obsolete and out of date. Movie posters simply scream “Poor high school grad”. But no one ever looks at books and scoffs, “Books? Really? What are you, a college professor?” ― Marsha Hinds"},{"quote":"“Saying it to the owners of the schools and colleges: In your advertisements, without saying- “There are a.c, parking facilities etc. in our institution”, take such initiatives so that you can say, “There are playing ground, garden etc. in our institution\"!” ― Md. Ziaul Haque"},{"quote":"“স্কুল ও কলেজ মালিকদের বলছিঃ আপনাদের বিজ্ঞাপনে \"আমাদের প্রতিষ্ঠানে এসি, গাড়ি রাখার ব্যবস্থা ইত্যাদি আছে\" না বলে, এমন উদ্যোগ নিন যেন বলতে পারেন, \"আমাদের প্রতিষ্ঠানে খেলার মাঠ, বাগান ইত্যাদি আছে\"!” ― Md. Ziaul Haque"},{"quote":"“It is a good news that the private universities are shifting to their own campuses. But, the more vital thing is to ensure such campuses for the children's schools where there will be a field at least!” ― Md. Ziaul Haque"},{"quote":"“We should ensure such campus for the children's schools where there will be a field at least!” ― Md. Ziaul Haque"},{"quote":"“আমাদের উচিত বাচ্চাদের স্কুলগুলোর জন্য এমন ক্যাম্পাস নিশ্চিত করা যেখানে অন্তত একটি মাঠ থাকবে!” ― Md. Ziaul Haque"},{"quote":"“বেসরকারি বিশ্ববিদ্যালয়গুলো নিজস্ব ক্যাম্পাসে যাচ্ছে এটা সুখবর! কিন্তু যেটা আরও বেশি জরুরি তা হচ্ছে বাচ্চাদের স্কুলগুলোর জন্য এমন ক্যাম্পাস নিশ্চিত করা যেখানে অন্তত একটি মাঠ থাকবে!” ― Md. Ziaul Haque"},{"quote":"“My dislike of the W. M. Keck Observatory, Columbia University and Dartmouth College is based on unpleasant experiences in their employment.” ― Steven w Magee"},{"quote":"“Out of all of my employers, the Ivy League was by far the worst.” ― Steven Magee"},{"quote":"“Professors are typically in their own little worlds, doing their own thing and thinking that the laws do not apply to them.” ― Steven Magee"},{"quote":"“It is probably a good thing that Karen Wetterhahn died from mercury poisoning, as if she had survived, she would have discovered the horrible Dartmouth College workers compensation experience for occupational disease.” ― Steven Magee"},{"quote":"“In the space of less than a year, mercury poisoning took me from being sponsored for an exceptional ability green card by Dartmouth College to being shown the door.” ― Steven Magee"},{"quote":"“Like Karen Wetterhahn, I was mercury poisoned in the employment of Dartmouth College. Unlike Karen Wetterhahn, I survived the extremely sickening mercury poisoning.” ― Steven Magee"},{"quote":"“He sniffs and turns his head to look at me. There's a tear streaking down his cheek, sliding out from under his glasses. He wipes it away with the heel of his hand. \"I just don't like good-byes.\"\"I know.\"\"I don't want to leave him or you or Abby or any of you guys.\" His voice catches. \"I don't know anyone in Philly. I don't know how people do this.” ― Becky Albertalli, Leah on the Offbeat"},{"quote":"“Malachite eyes sparkled, pale green in the light of the setting sun.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“Once everyone can enrich their souls for free, government subsidies for enrichment forfeit their rationale. To object, 'But most people don't use the Internet for spiritual enrichment' is actually a damaging admission that eager students are few and far between. Subsidized education's real aim isn't to make ideas and culture accessible to anyone who's interested, but to make them mandatory for everyone who *isn't* interested . . .The rise of the Internet has two unsettling lessons . . . First: the humanist case for education subsidies is flimsy today because the Internet makes enlightenment practically free. Second: the humanist case for education subsidies was flimsy all along because the Internet proves low consumption of ideas and culture stems from apathy, not poverty or inconvenience. Behold: when the price of enlightenment drops to zero, remains embarrassingly scarce.” ― Bryan Caplan, The Case Against Education: Why the Education System Is a Waste of Time and Money"},{"quote":"“Karma’s not a bitch. She’s a whore, acting like I’ve stolen her pimp.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“You take my breath away... which I find very rude because I'm asthmatic.” ― Teagan Hunter, If You Say So"},{"quote":"“And that was the thing, wasn’t it? When life rode on its highs, you wanted it to go on forever. But in the depths of the invariable dives, you’d be happy to be put out of your misery, because whatever awaited beyond this life had to be better than this shit on Earth.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“There was no way she'd allow him to see her do 97 percent of her normal activities. She was a monster. A monster who was flat as a board with no ass. In fact, the only thing she had going on in the curves department was an enormous cyctic pimple on her chin that hurt when she touched it. Yeah, no.” ― Mary H. K. Choi"},{"quote":"“In college, books assigned for class were read as competitive sport - the more critically, the better.” ― Pamela Paul, My Life with Bob: Flawed Heroine Keeps Book of Books, Plot Ensues"},{"quote":"“I would not have you think me regretful, or melancholy. Life has been good to me—and every age has its gifts for the man who is willing to work for them and use them temperately. And nothing is more ungraceful, more ludicrous, than the spectacle of one who attempts to linger over the pleasures of an age he had outlived, and ignore the advantages of his own time of life.” ― John D. Swain, A Father to his son. A Letter to an Undergraduate Upon his Entering College"},{"quote":"“Want my advice? Go to class, focus on time management, and try to workout at least three days a week. It helps to destress, plus it’s a good excuse to listen to music for an hour. Try to get good grades, but don’t beat yourself up over bad ones. Reach to do better.” ― Bryant A. Loney, Sea Breeze Academy"},{"quote":"“More than 99.99% of facts are not and will never be useful to even a single person.” ― Mokokoma Mokhonoana"},{"quote":"“Abstract white cirrus clouds streaked across the sky. The cool breeze rustled the leaves in the trees and disturbed the ones settled on the ground. Anaya couldn’t help but see a metaphor in that.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“Despite its ferocious name, or perhaps because of it, it was the head of the pack of six bars in town. The sweet smell of cider and dank cigarette smoke wafted up her nostrils. Better than Lucy’s sweaty armpits at Emberswick Bar & Grill.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“Abuse could be a slope as slick as ice after a shower of freezing rain.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“As still and clear as glass, the water seemed to exist solely to mirror the sunset. The wind changed course in the sky, causing wave-like ripples up there. The whole world seemed covered in gold, slate, and cloud, very distinct and separate in places, obscure and entangled in others.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“He was a sharpshooter like that. Bullet straight to the heart.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“They gobbled the shrimp dumplings. From the first time they’d seen the sheer size of the meat through the translucent wrapper, they’d taken vows to be regulars. The pork sui mai was the next to be devoured. They savored in silence, except for the slurping of the stir-fried clams in black-bean sauce.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“His stance, with hands tucked into blue jeans, held nothing casual about it. More than powerful, he seemed menacing, even. He turned to her with an arched brow, like a being from Olympus, curious about a mere mortal’s next move. Currents of fear sped up and down her spine, futilely searching for a place to cower.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“He was unrelenting, unmerciful, and singularly focused. Nothing stood in his way or hindered his journey. Until his end itself.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“If you already know the answer, why are you trying to make me say it?\"\"Because I'm a girl, an that's what we do.” ― Sara Ney, Things Liars Say"},{"quote":"“For several years, I struggled to pass as a native, fell silent when I had no cultural capital to contribute to the conversation, which was most of the time. People called me shy, and I thought of myself that way. But I wasn't. Rather, I was incognito, unknowable -- strategically so, and it was a strategy born of shame and desperation, of the felt sense that who I really was would disturb people too much to let me stay. I was a stranger in a strange land, a trailer-trash girl from a fucked-up background whose test scores and polite smile and diligence let her slip inoffensively upward.” ― Lorraine López, An Angle of Vision: Women Writers on Their Poor and Working-Class Roots"},{"quote":"“When he had gotten rid of his exuberance he sat down at once to write to his brother Hal about it, and also his forest-ranger friend, Dick Leslie, with whom he had spent an adventurous time the last summer.” ― Zane Grey, The Young Pitcher"},{"quote":"“Ken was absolutely powerless. His clothes were torn to tatters in a twinkling; they were soon torn completely off, leaving only his shoes and socks.” ― Zane Grey"},{"quote":"“Ken thrilled in all his being.” ― Zane Grey, The Young Pitcher"},{"quote":"“Ken sat glued to his seat in mingled fear and wrath. Was he to be the butt of those overbearing sophomores?” ― Zane Grey, The Young Pitcher"},{"quote":"“There was a bold gleam in his eyes and a smile on his face.” ― Zane Grey, The Young Pitcher"},{"quote":"“He ran his hands over Ken's smooth skin and felt of the muscles” ― Zane Grey, The Young Pitcher"},{"quote":"“The coach put his hand on Ken's knee.” ― Zane Grey, The Young Pitcher"},{"quote":"“Peg, are you goin' to throw me down, too?”“Mr. Arthurs! I—I—” ― Zane Grey, The Young Pitcher"},{"quote":"“Many schools, colleges and universities have turned into biologically toxic radio frequency (RF) radiation antenna parks.” ― Steven Magee"},{"quote":"“It will happen soon. Someday you will find yourself surrounded by people with the exact same interests as you, and you will never feel out of place again,” I say, already wary of the incredible lie I am telling.” ― Joe Meno, Demons in the Spring"},{"quote":"“If you could go back in time and redo one thing in your life, what would it be?” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“To sustain the value of education, students should be respected as much as the teachers.” ― Amit Kalantri, Wealth of Words"},{"quote":"“To teachers, education is just a duty, but to students, it's their right.” ― Amit Kalantri, Wealth of Words"},{"quote":"“One of the greatest inventions of the 20th century -- indeed, one of the landmark inventions in the history of the human race -- was the work of a couple of young men who had never gone to college and who were just bicycle mechanics in Dayton, Ohio.That part of the United States is often referred to as 'flyover country' because it is part of America that the east coast and west coast elites fly over on their way to what they consider more important places. But they are able to fly over it only because of those mechanics in Dayton.” ― Thomas Sowell"},{"quote":"“No matter how much you learn in college, it never prepares you for the real world.” ― Donald Allen, Bill Gates’ Top 15 Secrets For Success In Life And Business: Rationed Short Guide For Mature Minds That Seek Good Advice And Not To Be Lectured"},{"quote":"“The boy was there too, stumbling through the living room horde and passing out magic mushrooms from a paper bag. His eyeballs sparkled inside gaping, play-dough sockets while his limbs hung gaunt and exhausted from eight straight days of self-medicating fear. Another boy in a black tee pinched some mushroom flakes from his bag, nodded his thanks, and mouthed the word “bro” like blowing a man kiss.” ― Jake Vander-Ark, Fallout Dreams"},{"quote":"“Boots, it’s college. We’re segregated regardless, whether it be by major or class. This is just the way things are here. It keeps everyone safe.” ― Rachel Van Dyken, Elite"},{"quote":"“Regrets, it seems, are easy to realise when you're dying.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“But what if, after one small change, her life would become much worse than it was? Or unthinkable disasters result from a single step off her path?” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“And so, Anaya's story begins with her last thought. Would I have done this if I had any option but the grave?” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“The vibrant matte amethyst dial made the gleaming hour and minute markers seem to come alive. The long, thick hands were fragile, yet ceaselessly ticking by, like life itself. Countless hours must have been invested in the bezel, meticulously hashed all the way around. The tachymeter claimed prominence as if asserting that distance travelled over time should be of paramount importance. Never had the sheer pace and inevitability of time been better captured in an object.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“Death can’t be cheated, but there are endless ways that life can be lived.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“She watched him from afar and gave him the time and space to travel the emotional rollercoaster, commencing at stunned, progressing to upset and lurking at angry. Then he brooded and grieved for the end of his life as he knew it.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“He's a cocky SOB. He knew the Nick Adams Stories. Probably a frustrated English major who graduated from college qualified to drive a cab.” ― Peter Heller, Celine"},{"quote":"“Sometimes the gap between what you are and what you want to be is a little piece of paper called your college degree. So jump.” ― Joyce Rachelle"},{"quote":"“If only employees knew this...there is no hand out just because you got a degree. You still gotta make $ for the biz (employer), if you choose not to make $ for yourself (freelancer / ent).” ― Richie Norton"},{"quote":"“It's not important where you study it's important how well you study.” ― Amit Abraham"},{"quote":"“The industrialized mass nature of school goes back to the very beginning, to the commonschool and the normal school and the idea of universal schooling. All of which were invented atprecisely the same time we were perfecting mass production and interchangeable parts and thenmass marketing.The common school (now called a public school) was a brand new concept, created shortly afterthe Civil War. “Common” because it was for everyone, for the kids of the farmer, the kids ofthe potter, and the kids of the local shopkeeper. Horace Mann is generally regarded as thefather of the institution, but he didn’t have to fight nearly as hard as you would imagine—because industrialists were on his side. The two biggest challenges of a newly industrialeconomy were finding enough compliant workers and finding enough eager customers. Thecommon school solved both problems.The normal school (now called a teacher’s college) was developed to indoctrinate teachers intothe system of the common school, ensuring that there would be a coherent approach to theprocessing of students. If this sounds parallel to the notion of factories producing items in bulk,of interchangeable parts, of the notion of measurement and quality, it’s not an accident.The world has changed, of course. It has changed into a culture fueled by a market that knowshow to mass-customize, to find the edges and the weird, and to cater to what the individualdemands instead of insisting on conformity.Mass customization of school isn’t easy. Do we have any choice, though? If mass productionand mass markets are falling apart, we really don’t have the right to insist that the schools wedesigned for a different era will function well now.” ― Seth Godin, Leap First: Creating Work That Matters"},{"quote":"“Once back in Castine, I knew that I had to get serious. I was lucky that studying came easy for me. Perhaps in a way I should have seen it as a curse, since I could grasp what was required of me without too much effort. Although I had to study, I still always had time to fool around. During the final weeks I pored over my books, but on weekends when my classmates continued to study, I hitchhiked to Portland. Ann knew that graduation was near and mentioned that she wanted to go to New York, where we could remain closer to each other after graduation. It sounded good, but I reminded her that I would be going to sea and that it could be with almost any shipping company, and for extended periods of time. I had no idea where in the world I would be going and to me it didn’t really matter. We decided that after taking my Coast Guard Exams, we would take a bus to New York City and she could stay in a room at the YWCA near Journal Square.” ― Captain Hank Bracker, \"Seawater One....\""},{"quote":"“It's hard to beat signaling equilibria - because they're 'multi-factor markets' - which are special cases of coordination problems that create 'inferior Nash equilibria' - which are so stuck in place that market controllers can seek rent on the value generated by captive participants.” ― Eliezer Yudkowsky, Inadequate Equilibria: Where and How Civilizations Get Stuck"},{"quote":"“Anaya sensed her opportunity and stole a moment to take in what Emberswick looked like in her teens. Still an engineering town, with a heap of lumber mills to show for it. It had been systematically envisioned and built around lush, small woods and pretty, little parks, spotted with bubbling fountains. A charming place to live, with a pleasant pace of life, and the people were just as engaging.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“The words and phrases had so much more gravitas in her adult mind. She felt a sharp pang of guilt as she realized the extent of what she hadn’t been aware of, and how little compassion she’d had as an actual teen.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“How readily we crush our dreams, without even turning over the first stone, so willing to be the victims of circumstance! She felt utterly miserable on behalf of all the teenagers the world over and allowed herself a few minutes more self-pity for the life she’d wasted, and the ones so many more would throw away. Doing as you pleased at this age, without seeking the help and advice of those qualified to give it, equaled marching into a minefield.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“Fueled by rage at God, or whoever else came up with the preposterous concept of free will, Anaya turned more corners. My challenges were cruel to the core. With so many choices to make in life, the line was hair-thin between success and failure, having money or being broke, being loved or hated, alive or dead.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“Her regularly squared and french-tipped nails were dangerously chipped and jagged, and she touched her platinum hair so often that it had started to look like the kinked bristles of an overused toothbrush.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“The stained-glass window on the front door shatters into tiny pieces behind her as it slams shut when he gets to it at last. It sounds like a musical cadence, heightening some eerie psycho movie score.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“And then they came upon it. It was painted in the most cat-retch shade of beige you ever beheld.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“A red carpet and red rope stanchion sets demarcated a runway and seating areas. Silhouettes of prominent action heroes posing on silver and gold LED blocks illuminated the whole area. Black silk covered tables and chairs, with centerpieces of colossal martini glasses containing glowing ice cubes.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“Anaya inhaled the rich scent of soil, along with the sharp, citric smell of thriving vegetation and the sweetness of fresh dew. Her eyes drifted shut and she pricked up her ears, the gushing sound of the nearby waterfalls enveloping her.” ― G. M. T. Schuilling, The Watchmaker's Doctor"},{"quote":"“I thought of the cool, fresh air of the city I'd always dreamed of living in. The art museums and trolleys and the mysterious fog that blanketed it. I could almost smell the cappuccinos I'd planned to drink in bohemian cafes or hear the indie music in the bookstores I would spend my free time in. I pictured the friends I'd make, my kindred art people, and the dorm room I was supposed to move into.” ― Heather Demetrios, I'll Meet You There"},{"quote":"“some people graduate on time. some others graduate at the right time. no matter about the time you graduations, you have to take responsibility to finish your college when you choose to start it. not for your parents, not for your friends, but for you. when you graduate, you'll be at the higher lever than your life before. remember, you don't have to be smarter, all you have to do is be the work harder than others.” ― Nunki Artura"},{"quote":"“You have no idea how many men are spoiled by what is called education. For the most part, colleges are places where pebbles are polished and diamonds are dimmed. If Shakespeare had graduated at Oxford, he might have been a quibbling attorney, or a hypocritical parson.” ― Ingersoll Robert Green"},{"quote":"“Most people who were educated have become the \"problems\" instead of problem solvers.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“The difference between a good and a poor student is result” ― ETC Wanyanwu"},{"quote":"“History has been stolen from us and replaced with guilt inducing lies.” ― Stefan Molyneux"},{"quote":"“Education is not merely meant for you to write and pass exams, get a good job and a good spouse, and settle down for survival.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Make your education valuable. Apply what you learnt. Refuse to take the back seat and watch things happen. Join the change and be part of the change.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“I was brand-new in San Francisco, right out of college, and I thought it was thrilling, a guy buying me a drink. I didn’t think, how tacky, this creep is buying me a drink. I thought, how amazing, I put on lipstick and a short skirt and look what can happen.” ― Marcy Dermansky, The Red Car"},{"quote":"“Most of the world’s problems are caused by people who made education compulsory, but personal development optional. Because of them, we have many intelligent people who lack good characters.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“I wondered ...if meeting people with creativity and passion when you were at an impressionable enough age actually kind of ruined you for life among normal people. For a long time, I'd searched the world, thinking I could start up new friendships like the ones I'd had before. But I never met people like that again. I know people will think that's what everyone believes about their college friends, but it's true. Maybe we're like flowers that open up at that brief moment in our lives, and after that, we close up again, one by one.” ― Jennifer Finney Boylan, Long Black Veil"},{"quote":"“I realized I was a teacher when I felt warm during class and got up to open the door. Later on there was noise in the hallway, so I got up and shut it. Students can't open and close the door whenever they feel like it.” ― David Sedaris, Theft by Finding: Diaries 1977-2002"},{"quote":"“MIND YOUR OWN SOCIAL MEDIA BUSINESS ” ― Qwana M. BabyGirl Reynolds-Frasier, Friend In Your Pocket Conversations Session One"},{"quote":"“Et supper?\" Foote asked.\"No, sir,\" Stoner answered.Mrs. Foote crooked an index finger at him and padded away, Stoner followed her through several rooms into a kitchen, where she motioned him to sit at a table. She put a pitcher of milk and several squares of cold cornbread before him. He sipped the milk, but his mouth, dry from excitement, would not take the bread.Foote came into the room and stood beside his wife. He was a small man, not more than five feet three inches, with a lean face and a sharp nose. His wife was four inches taller, and heavy; rimless spectacles hid her eyes, and her thin lips were tight. The two of them watched hungrily as he sipped his milk. \"Feed and water the livestock, slop the pigs in the morning,\" Foote said rapidly.Stoner looked at him blankly. \"What?\"\"That's what you do in the morning,\" Foote said, \"before you leave for your school. Then in the evening you feed and slop again, gather the eggs, milk the cows. Chop firewood when you find time. Weekends, you help me with whatever I'm doing.\"\"Yes, sir,\" Stoner said.Foote studied him for a moment. \"College,\" he said and shook his head.” ― John Williams, Stoner"},{"quote":"“For the first time he considers the full emotional dimensions of the day. His life is changing but his parent’s lives are changing too. Like a habitat, abruptly deprived of a major species, the household will be wrenched into realignment by his departure. Like all young people, he has no idea who his parents really are. For 18 years he has experienced their existence only in so far as it is related to his own needs. Suddenly his mind is full of questions. What do they talk about when he's not around? What secrets do they hold from each other? What aspirations have been left to languish? What private grievances held in check by the shared project of child rearing will now in his absence, lurch into the light?” ― Justin Cronin, The City of Mirrors"},{"quote":"“I will miss younot because you taught me,not because you helped me on all steps of education;but only becauseyou made me a leader to lead as an perfect Electrical Engineer.” ― Hasil Paudyal"},{"quote":"“Living independent might come as appalling as the word to anyone but me. The one who thinks it's a cool idea and worth it, has sure forgotten that independence comes with a price. If one doesn't still agree, you gotta try staying at a hostel.” ― Parul Wadhwa, The Masquerade"},{"quote":"“And then we get new homes that we make for ourselves.” ― Nina LaCour, Summer Days and Summer Nights: Twelve Love Stories"},{"quote":"“Here's a resume of crucial knowledge you should have in today's world but universities are not providing: Financial - Not just on management, but also on how to profit, how to manage and control flows of income; Linguistic - In today's world, speaking only a language is prove of lack of education. Knowing two languages is a basic necessity, and knowing three languages is essential, while knowing four is merely the ideal situation. Which four languages? Chinese, English, Spanish, and another of your choice, just for fun; Intellectual - It's not about what you know; it’s all about how you think about what you know. Therefore, it's ridiculous to think that there’s only one answer and one way to examine our life. Most students are extremely dumb because they lack the ability to educate themselves, despite their certificates or where they’ve studied. They never read with an intention in mind. And as they graduate, they become completely futile as individuals. This situation is the same all over the world. Millions are graduating every year, without any significant knowledge to live with. Their books are often outdated once they graduate and they're unable to learn by themselves and develop the necessary skills to adjust to the economic society in which we live. Maybe they can keep a job for 3 or 5 years of their life, but then are surprised to lose it and never finding a suitable job again. The world is changing very fast and most people can’t or are unwilling to recognize this fact.” ― Robin Sacredfire"},{"quote":"“GOD SAYS; YOU'LL NEVER LOSE A FIGHT THAT WASN'T FIXED!#HOPENATION” ― Qwana M. BabyGirl Reynolds-Frasier"},{"quote":"“BEING GREEDY IS NOT TRUSTING THAT GOD WILL PROVIDE MORE!PLEASE BELIEVE HIM!#HOPENATION” ― Qwana M. BabyGirl Reynolds-Frasier, Friend In Your Pocket Conversations Session One"},{"quote":"“IF THEY DON'T INVITE YOU TO THE PARTY TODAY; STRIVE TO BE THE REASON THEY \"TRY\" TO CELEBRATE WITH YOU TOMORROW!#HOPENATION” ― Qwana M. BabyGirl Reynolds-Frasier, Friend In Your Pocket Conversations Session One"},{"quote":"“WRITE YOURSELF OUT OF THE WRONG PLACE!WRITING IS SPIRITUAL THERAPY✏#HOPENATION” ― Qwana M. BabyGirl Reynolds-Frasier, Friend In Your Pocket Conversations Session One"},{"quote":"“STAY THE COURSE BY FORCE!” ― Qwana M. BabyGirl Reynolds-Frasier, Friend In Your Pocket Conversations Session One"},{"quote":"“YOUR TWIN-FLAME IS ON BACK ORDER.THE HEAVENLY FATHER IS BUILDING YOUR SOULMATE TAILOR MADE FOR YOU SPECIAL ORDER.WHEN YOUR MATE IS COMPLETE THE UNIVERSE WILL SHIP THEM OUT SPECIAL DELIVERY, WITH A BOW. WHEN YOU MEET THEM YOU'LL KNOW!YOU DESERVE THE BEST. SINCERELY,#FRIENDINYOURPOCKET ” ― Qwana M. BabyGirl Reynolds-Frasier, Friend In Your Pocket Conversations Session One"},{"quote":"“On the hot, fragrant afternoon of my graduation from college it seemed that good fortune was not merely latent but unavoidable, folded and in the bag.” ― Geoffrey Wolff, A Day at the Beach: Recollections"},{"quote":"“And by the way, I know my title said “10 Reasons” and I only listed “6”. I didn’t learn to count in college.” ― James Altucher, 40 Alternatives to College"},{"quote":"“In almost 25 years of experience as a high school guidance counselor, a regional college representative, and a private college counselor, I have noted the kinds of things that make the college process productive, successful, and enjoyable. I have worked with so many students who have blossomed in part due to their college search and application process. It can be a period of maturation and of self-exploration, with an honest assessment of skills and interests, development of task organization and discipline, renewed intrafamily communication, and travel to interesting cities and small college towns. I firmly believe when the journey to college is fully embraced, it can truly be loved.” ― Jill Madenberg, Love the Journey to College: Guidance from an Admissions Consultant and Her Daughter"},{"quote":"“College stirred in her a certain contempt for virtues like kindness and persistence. She would have appeared to have been a kind and persistent person herself, but a steady diet of Antonioni films and an introductory course on existentialism had awakened her to the fact that she wanted more.” ― Garth Risk Hallberg, City on Fire"},{"quote":"“In the wasteland of metro Boston, at thirteen, fourteen, his big dream had been of a gun to his own head, putting him out of his misery—a misery that by sophomore year of college was indistinguishable from everybody else's.” ― Garth Risk Hallberg, City on Fire"},{"quote":"“There's very little authentic study of the humanities remaining. My research assistant came to me two years ago saying she'd been in a seminar in which the teacher spent two hours saying that Walt Whitman was a racist. This isn't even good nonsense. It's insufferable.” ― Harold Bloom"},{"quote":"“I don’t want us to be ashamed anymore (we all were crying by this point) of being pregnant or gay or poor or having a crackhead dad! I want us to be fucking proud of ourselves. (...) So we have to be proud and always remember who we are and when we make it to college, who we were.” ― Isabel Quintero, Gabi, a Girl in Pieces"},{"quote":"“I can say little more than I have studied, and that question's out of my part.” ― William Shakespeare, Twelfth Night"},{"quote":"“Voglio solo che sia chiaro che...\" bisbigliò, direttamente al mio orecchio. Trattenni il respiro. \"Quando ti bacio... quando ti sfioro... quando ti tocco... sono io. E voglio te.” ― Chiara Venturelli, Lezioni di seduzione"},{"quote":"“Carmen: “I want you to leave me alone, but not ignore me. I want you to miss me when I go away to college, but not be sad. I want you to stay exactly the same, but not be lonely or alone. I want to do the leaving, and not have you ever leave me.” ― Ann Brashares, The Second Summer of the Sisterhood"},{"quote":"“You are more likely to find three TVs inside a randomly selected house than you are to find a single book that is or was not read to pass an exam, to please God, or to be a better cook.” ― Mokokoma Mokhonoana"},{"quote":"“Being graded for memorizing male accomplishments with the deep message that we can learn what others do but never do it ourselves.” ― Gloria Steinem, Revolution from Within: A Book of Self-Esteem"},{"quote":"“I don't recall that when I was in high school or college, any novel was ever presented to me to study as a novel. In fact, I was well on the way to getting a Master's degree in English before I really knew what fiction was, and I doubt if I would ever have learned then, had I not been trying to write it. I believe that it's perfectly possible to run a course of academic degrees in English and to emerge a seemingly respectable Ph.D. and still not know how to read fiction.” ― Flannery O'Connor, Mystery and Manners: Occasional Prose"},{"quote":"“Il mio cactus ha il reggiseno.” ― Chiara Venturelli, Lezioni di seduzione"},{"quote":"“Tranquilla, miciotta. Sarò un fidanzato modello\" ammiccò. Sarebbe finita in tragedia.” ― Chiara Venturelli, Lezioni di seduzione"},{"quote":"“Well, I should like to see you go to college, Anne, but if you never do, don't grow discontented about it. We make our own lives wherever we are, after all... college can only help us do it more easily.” ― L.M. Montgomery, Anne of Avonlea"},{"quote":"“As long as high schools strive to list the number of Ivy League schools their graduates attend and teachers pile on work without being trained to identify stress-related symptoms, I fear for our children’s health. I am not mollified by the alums of my daughter’s school who return to tell everyone that the rigor of high school prepared them for college, making their first year easier than they’d anticipated.If they make it that far.” ― Candy Schulman"},{"quote":"“It was quiet, the old wood creaking and the snow barely visible outside the stained glass. And I sat down. And I looked up. At this giant room I was in. At this place where thousands of people had sat before me. And alone, at night, in the middle of a New Haven storm, I felt so remarkably, unbelievably safe.” ― Marina Keegan, The Opposite of Loneliness: Essays and Stories"},{"quote":"“Before you start your full day of watching Equestrian Square Dancing, Soccer Balling, Hoop Dreaming, Cricket Batting, Rugby Punching, Volleyball Chopping, Skateboard Falling, Martial Arts Bowing, Bicycle Peddlers, and College Football Hecklers, maybe we have time to learn somethingScientifically.” ― James Hauenstein"},{"quote":"“The problem with studying is that it gets in the way of education.” ― Neel Burton"},{"quote":"“[To admit that college isn't for everyone] may sound élitist. It may even sound philistine, since the purpose of a liberal-arts education is to produce well-rounded citizens rather than productive workers. But perhaps it is more foolishly élitist to think that going to school until age 22 is necessary to being well-rounded, or to tell millions of young adults that their futures depend on performing a task that only a minority of them can actually accomplish.It is absurd that people have to get college degrees to be considered for good jobs in hotel management or accounting — or journalism. It is inefficient, both because it wastes a lot of money and because it locks people who would have done good work out of some jobs. The tight connection between college degrees and economic success may be a nearly unquestioned part of our social order. Future generations may look back and shudder at the cruelty of it.” ― Ramesh Ponnuru"},{"quote":"“He's like the anti-Ben, but his attention is like a shot of adrenaline.” ― Jessica Calla, She Laughs In Pink"},{"quote":"“I'm sure there's drama in their past that I know nothing about, but when someone like Juliet- colorful, beautiful, determined Juliet- begs you to love her, how do you say no?” ― Jessica Calla, She Laughs In Pink"},{"quote":"“An HBCU that is not inherently revolutionary is irrelevant.” ― Darnell Lamont Walker"},{"quote":"“An HBCU that is not inherently revolutionary in 2016 is irrelevant.An African American Studies class that is not inherently revolutionary in 2016 is irrelevant.” ― Darnell Lamont Walker"},{"quote":"“You sound like a college freshman taking his first philosophy class way too seriously, but that's good.” ― Michael Grant, Eve & Adam"},{"quote":"“Collegiate life presents a student with innumerable opportunities to engender personal growth by responding to a dynamic social, athletic, and academic environment. Students instigate personal development by making calculated and rash personal decisions pertaining to what activities to pursue and by measuring their string of reactions to new experiences.” ― Kilroy J. Oldster, Dead Toad Scrolls"},{"quote":"“It is a shock to many college graduates that their segway into the real world is one of obligation, profound debt, and countless sacrifices of the soul.” ― Chris Matakas, The Tao of Jiu Jitsu"},{"quote":"“When I worked in astronomy, I routinely observed young college and university students working with liquid nitrogen and breathing nitrogen gas as they discharged it into the indoor environment at high altitude.” ― Steven Magee"},{"quote":"“I loved college... I knew exactly why I was there and what I wanted to get out of it. I wished I could take every course in the curriculum and read every book in the library. Sometimes after I finished a particularly good book, I had the urge to get the library card, find our who else had read the book, and track them down to talk about it.” ― Jeanette Walls"},{"quote":"“selling my soul for student loans and an education.” ― Shareca Cole., Carpel Tunnel."},{"quote":"“If you are going to start, don't quit. But if you are going to quit, don't even start!” ― Hannah Sulfridge"},{"quote":"“Harder still was the pretense her studies demanded: the need to dissemble, to parrot her professors' orthodoxies, to feign interest in theories that were of no use to her.” ― John Wray, The Lost Time Accidents"},{"quote":"“TO LIVE A LIFE VOID OF NEED ISA LIFE FILLED WITH DEPRIVATION” ― Qwana M. BabyGirl Reynolds-Frasier, Friend In Your Pocket Conversations Session One"},{"quote":"“WORDS HAVE NO EXPIRATION DATE; YOU CAN EAT THEM WHENEVER YOU WANT.SO BE SURE TO MAKE EM' YUMMY!” ― Qwana M. BabyGirl Reynolds-Frasier, Friend In Your Pocket Conversations Session One"},{"quote":"“Being smart and rich are lucky, but being curious and compassionate will save your ass. Being curious and compassionate can take you out of your ego and edge your soul towards wonder.” ― Mary Karr, Now Go Out There"},{"quote":"“And all those things you listed right now, they’rethings Garrett and I do together. Dude, you don’t want me. You want me andGarrett.” ― Elle Kennedy, The Mistake"},{"quote":"“So on a scale of one to Adele, how bad was this breakup?” ― Jennifer Lane, Aced"},{"quote":"“someone like Grace. Someone exactly like Grace, with her Ted Bundy rantsand her calming presence and—hello, irony.” ― Elle Kennedy, The Mistake"},{"quote":"“At the end of the day, if you’re wasting your time by not investing in yourself, you’re going to waste away—and that would be the greatest waste of all.” ― Richie Norton"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“I hate reading poems—school made me hate them. I’d spend hours interpreting one, just to read the memorandum and realize I’d be fucked during exams. I remember making a little asterisk next to every question I struggled with, and at the end of the paper, I’d realize I was looking at the fucking Milky Way.” ― Danielle Esplin, Give It Back"},{"quote":"“His eyes are a hazy swirl ofgray, like a thick mass of clouds gathering before an impending storm” ― Elle Kennedy, The Deal"},{"quote":"“I broke up with her to avoid getting into a serious relationship with her, and now it” ― Elle Kennedy, The Mistake"},{"quote":"“A university is a city of ideas, and we're grateful you became citizens of our city.” ― Mary Karr"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“When you're reaching the end of the semester and you just wanna die. Coffin Making 101 is literally killing me.-Karen Quan and Jarod Kintz” ― Karen Quan, liQUID PROse QUOtes"},{"quote":"“And the final product of our training must be neither a psychologist nor a brick mason, but a man. And to make men, we must have ideals, broad, pure, and inspiring ends of living, not sordid money-getting... The worker must work for the glory of his handiwork, not simply for pay; the thinker must think for truth, not fame.” ― W.E.B. Du Bois, The Souls of Black Folk"},{"quote":"“I should move away from his touch. But he’s a constant storm in my life, clouding my head, ensuring I make bad decisions. He doesn’t do it on purpose, he knows we’re not good for each other, but there’s something about us that makes us fight back harder, thinking we can overcome it.” ― Brittany Butler, Hazed"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"},{"quote":"“If I'll be funnier than this, I'll become a joke.” ― Chandan Sharma"},{"quote":"“He fell in with the quiet revolutionaries on campus—those who felt that the disenfranchisement of half the population was ridiculous, those who did not accept that rights were predicated on skin tone—partly because he couldn’t bring himself to avoid tempting trouble. He agreed with all their points, but understood that they were freer to make them purely because they had the money to build a wall around their experiences. That was what people did, wasn’t it? Ignore the majority of experience and actively disengage from those telling them otherwise.” ― Thomm Quackenbush, Flies to Wanton Boys"},{"quote":"“I rub my hand down my face, frustrated. This girl in front of me tests my patience like hell. When she ran to me after her dad kicked her out, I thought she still had feelings for me. She needed a place to stay, and I needed her. I offered her a room, thinking if she was around me every day, she would remember she loves me. I was dead wrong. Somewhere along the way, we switched roles, I became the one who so desperately needed her and she became cold and closed off. She isn’t my savior; she’s my punishment.” ― Brittany Butler, Unfazed"},{"quote":"“Don't take on more student loans than your future-self can handle.” ― Carol H. Cox"},{"quote":"“Education leads to intellectual life.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Gee, you don’t sugarcoat things, do you?” “At least if I’m at a club, I won’t have you pressuring me.”“No, you’ll have heaps of strangers instead.” ― Shaye Evans"},{"quote":"“Colt, you’re going to be a nurse, not a cop. If anything happens, I’ll pay the fines for you.”“Still don’t need it.”“Why?” She paused for a moment, thinking. “Because you’re still trying to get into Daddy’s good books?”“Shut up,” I muttered, blowing my frustrations into another balloon—it grew between my palms. This had nothing to do with my father.“From what you’ve told me of the guy, he’s a jerking dick, Colt. I don’t know why you’re seeking his approval.” ― Shaye Evans, Rescued"},{"quote":"“This was one of those non-glamorous parts about college that people never tell you about - worrying that the dilapidated apartment hosting a party would fall apart with you in it.” ― Alyssa Rose Ivy, Focus"},{"quote":"“They [students] had two common, strongly held expectations: the college should exhibit the behavior it expected from students and hold true to its espoused values.” ― Gregory S. Prince, Jr., Teach Them To Challenge Authority: Educating for healthy societies"},{"quote":"“When colleges, both within the Hudson Valley and throughout the country, encouraged women to do little beyond attaining their Mrs. degree in Husbandry, Annandale offered rigorous and prestigious degrees irrespective of gender.” ― Thomm Quackenbush, Flies to Wanton Boys"},{"quote":"“A college provides a means of accrediting and laundering one’s existence, so that what was may be forgotten under the weight of something far more mundane.” ― Thomm Quackenbush, Flies to Wanton Boys"},{"quote":"“While you can't hold on to everything forever, you're a fool if you sell back your college books at semester's end: have you learned nothing of this life?” ― Ander Monson"},{"quote":"“How easy it is for so many of us today to be undoubtedly full of information yet fully deprived of accurate information.” ― Criss Jami, Healology"},{"quote":"“It is a healthy approach not to expect persons to turn out precisely how you would have wished.” ― Criss Jami, Healology"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Read to find life treasures” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“We find paradise in every library and bookshop.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“It was a time when a degree was expected but not much respected.” ― Pawan Mishra, Coinman: An Untold Conspiracy"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“Max sent Scottie some literary advice, the same dictum he gave every college student who called on him. He stressed the importance of a liberal arts education but urged her to avoid all courses in writing. \"Everyone has to find her own way of writing,\" he wrote Scottie, \"and the source of finding it is largely out of literature.” ― A. Scott Berg, Max Perkins: Editor of Genius"},{"quote":"“Everyone must be given the opportunity to think, read and write.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You can begin to dream, to love, to dance, to read, to sing, to study, to paint, to teach, to draw, to swim, to exercise, to write….!” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Laurie piped up again. 'At State, everybody calls diversity dispersity. What happens is, everybody has their own clubs, their own signs, their own sections where they all sit in the dining hall--all the African Americans are over there? . . . and all the Asians sit over't these other tables? -- except for the Koreans? -- because they don't get along with the Japanese so they sit way over there? Everybody's dispersed into their own little groups -- and everybody's told to distrust everybody else? Everybody's told that everybody else is trying to screw them over--oops!' -- Laurie pulled a face and put her fingertips over her lips -- 'I'm sorry!' She rolled eyes and smiled. 'Anyway, the idea is, every other group is like prejudiced against your group, and no matter what they say, they're only out to take advantage of you, and you should have nothing to do with them -- unless your white, in which case all the others are not prejudiced against you, they're like totally right, because you really are a racist and everything, even if you don't know it? Everybody ends up dispersed into their own like turtle shells, suspicious of everybody else and being careful not to fraternize with them. Is it like that at Dupont?” ― Tom Wolfe, I Am Charlotte Simmons"},{"quote":"“The stress of it all. How the hell are we expected at the age of sixteen (and seventeen, in your case) to decide what we want to do for the rest of our lives? Right now all I want to do is get out of school, not start planning to get into another one. You're lucky you've always known what you want to do.” ― Cecelia Ahern, Love, Rosie"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“Curiosity is the art of creativity.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Aim for the stars. You will sooner reach the moon.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“In the learning process, a learner does encounter some difficulty. But with diligent, you will master the act.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Tell me, who in this life, were never guided in course of their realization of their goal?” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“I see the beatitudes of books displayed on a bookshelf.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Read a short story every day. By the end of the week you would have read volumes of stories.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“May you have strength to complete studies.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“If you want to be a graduate student, you have to fall in love with reading.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You can achieve the goal with courage, confidence and commitment.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“THE BROKEN HEART STILL HAS HEART BEATS. THOUGH YOU MAY FEEL LIKE DEATH, YOU ARE STRONGER THAN YOU THINK!” ― Qwana M. BabyGirl Reynolds-Frasier"},{"quote":"“WRITERS ARE \"SPIRITIAL VENTRILOQUIST\" WHO HAVE THE ABILITY TO MAKE PAPER TALK!” ― Qwana M. BabyGirl Reynolds-Frasier, Friend In Your Pocket Conversations Session One"},{"quote":"“ENERGY IS EVERYTHING!IT'S EVEN INSIDE OF THE WORD\"EVERYTHING\"!” ― Qwana M. BabyGirl Reynolds-Frasier, Friend In Your Pocket Conversations Session One"},{"quote":"“I doubted I could survive in the woods without these very basic things to help me. It seemed like a tremendous leap of faith to forsake the tools I’d always been told I needed. And yet leaving college to walk was such a massive leap of faith already, and nothing I’d ever trusted and believed in seemed true any longer.” ― Aspen Matis, Girl in the Woods: A Memoir"},{"quote":"“Graduate study is an intensive education.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Be passionate persistent in the pursuit of your dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“...make sure if you're working hard at something it's in a subject you actually want to remember something about ten years later.” ― Felicia Day, You're Never Weird on the Internet"},{"quote":"“Rather than swallowing our pride and simply asking what we do not know, we choose to fill in the blanks ourselves and later become humbled. Wisdom was often, in its youth, proven foolish, and ones humiliated were meant to become wise.” ― Criss Jami, Healology"},{"quote":"“If only we were all better educated. If then, higher education would at last be a journey for skill and knowledge rather than for power and status.” ― Criss Jami, Healology"},{"quote":"“With great enthusiasm and determination you will master the art in your field.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“The world needs great inspires, who will encourage every living soul to reach their highest potential. You can be one.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Knowledge is learning without a limit.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“The only way to know is to learn, relearn and unlearn.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“How could we have improved ourselves, if we had not dared to read, learn and write?” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“It is the possibility of the dream, which quickens my spirit to take action.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“I can do it! I can do it!! I can do it!!!” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“We must pursue knowledge and wisdom above all other things.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Reading illuminates our path with the brightest light.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“So often we quit on the first failure. We must persistent long enough to achieve success.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Self education is holy mission.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Keep the goal in mind and push onward to accomplish it.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“holding grudges is like letting someone live rent free in your mind” ― J.L. Beck"},{"quote":"“The more we read, the better we are informed.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“There is nothing better than expressions in words.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You will discover all that pertains to life by reading.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Failure is a teacher. It teaches what you ought to learn.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Breathe, Emma. Now is not the time to swoon.” ― Eva Lauren Walker, Hanging by a Moment"},{"quote":"“We should keep learning so long as we have grace and breathe.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Always work enthusiastically.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Nick wanted to meet on campus at Love Library. (That was the actual name; thank you for your donation, Mayor Don Lathrop Love.)” ― Rainbow Rowell, Fangirl"},{"quote":"“There's always Time and Place for Everything called College” ― Manoj Hande"},{"quote":"“I am so glad; I had the opportunity to study at University of Jena, the city of light.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You ought to endure and complete your own race of life.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Knowledge is enthusiasm to learn.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“What matters is not how long it takes but the grace of fulfilled dream.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“The search for wisdom is like a search for gold.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“He gave her a smile that wasn’t really a smile at all. “Eh, it wouldn’t be so bad. I wouldn’t have to study for the SATs or get a summer job or figure out my major. I can drink Elderflower wine all day, dance all through the night, and sleep on a bower of roses.”Hazel made a face. “I’m pretty sure there are some colleges where you can do that. I bet there are some colleges where you can major in that.” ― Holly Black, The Darkest Part of the Forest"},{"quote":"“The purpose of college, to put this all another way, is to turn adolescents into adults. You needn't go to school for that, but if you're going to be there anyway, then that's the most important thing to get accomplished. That is the true education: accept no substitutes. The idea that we should take the first four years of young adulthood and devote them to career preparation alone, neglecting every other part of life, is nothing short of an obscenity. If that's what people had you do, then you were robbed. And if you find yourself to be the same person at the end of college as you were at the beginning - the same beliefs, the same values, the same desires, the same goals for the same reasons - then you did it wrong. Go back and do it again.” ― William Deresiewicz, Excellent Sheep: The Miseducation of the American Elite and the Way to a Meaningful Life"},{"quote":"“You can't learn to write in college. It's a very bad place for writers because the teachers always think they know more than you do—and they don't. They have prejudices. They may like Henry James, but what if you don't want to write like Henry James? They may like John Irving, for instance, who's the bore of all time. A lot of the people whose work they've taught in the schools for the last thirty years, I can't understand why people read them and why they are taught. The library, on the other hand, has no biases. The information is all there for you to interpret. You don't have someone telling you what to think. You discover it for yourself.” ― Ray Bradbury"},{"quote":"“But the compulsive overachievement of today's elite college students - the sense that they need to keep running as fast as they can - is not the only thing that keeps them from forming the deeper relationships that might relieve their anguish. Something more insidious is operating, too: a resistance to vulnerability, a fear of looking like the only one who isn't capable of handling the pressure. These are young people who have always succeeded at everything, in part by projecting the confidence that they always will. Now, as they get to college, the stakes are higher and the competition fiercer. Everybody thinks that they are the only one who's suffering, so nobody says anything, so everybody suffers. Everyone feels like a fraud; everybody thinks that everybody else is smarter than they are.” ― William Deresiewicz, Excellent Sheep: The Miseducation of the American Elite and the Way to a Meaningful Life"},{"quote":"“Adversity quickens the mind, awakens the spirit and strength the soul.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“My books, my paradise!” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Fortunately, our colleges and universities are fully cognizant of the problems I have been delineating and take concerted action to address them. Curricula are designed to give coherence to the educational experience and to challenge students to develop a strong degree of moral awareness. Professors, deeply involved with the enterprise of undergraduate instruction, are committed to their students' intellectual growth and insist on maintaining the highest standards of academic rigor. Career services keep themselves informed about the broad range of postgraduate options and make a point of steering students away from conventional choices. A policy of noncooperation with U.S. News has taken hold, depriving the magazine of the data requisite to calculate its rankings. Rather than squandering money on luxurious amenities and exorbitant administrative salaries, schools have rededicated themselves to their core missions of teaching and the liberal arts. I'm kidding, of course.” ― William Deresiewicz, Excellent Sheep: The Miseducation of the American Elite and the Way to a Meaningful Life"},{"quote":"“When you encounter unexpected situation, don’t panic. Close our eyes, take a deep breath and pray. It will relief you of any anxiety.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Encouragement is a fire of flame. It refreshes the soul and revives the spirit.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Focus on your destination but enjoy every sacred moments of the journey” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Education is one of the greatest gift for mankind. Each one of us must seek this enlightenment.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“The obstacles were intended to be a distraction from the goal.You must keep a persistence focus to realise the goal.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“If I had known how much I would miss these sensations I might have experienced them differently, recognized their shabby glamour, respected the ticking clock that defined this entire experience. I would have put aside my resentment, dropped my defenses. I might have a basic understanding of European history or economics. More abstractly, I might feel I had truly been somewhere, open and porous and hungry to learn. Because being a student was an enviable identity and one I can only reclaim by attending community college late in life for a bookmaking class or something.” ― Lena Dunham, Not That Kind of Girl: A Young Woman Tells You What She's \"Learned\""},{"quote":"“She glared at me. I didn't care. One word was playing a loop in my heaad: mine.” ― Kristen Callihan, The Hook Up"},{"quote":"“Never waste your energy to dwell on the past failures and mistakes.May you find renewed energy, courage and hope to pursue new adventures.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Quinton: I think if every person had a Nova Reed in this world, then life would be a little sunnier.” ― Jessica Sorensen, Nova and Quinton: No Regrets"},{"quote":"“Keep on exploring.Keep on evolving.Keep on experimenting.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“The whole people must take upon themselves the education of the whole people, and must be willing to bear the expense of it,\" [John] Adams wrote. \"There should not be a district of one mile square, without a school in it, not founded by a charitable individual, but maintained at the public expense of the people themselves.\" Jefferson's fear was that without such a system of public education, the country would end up being ruled by a privileged elite that would recycle itself through a network of private institutions that entrenched their advantage.” ― Fareed Zakaria"},{"quote":"“Now students all seem to be converging on the same self, the successful upper-middle-class professional, impersonating the adult they've already decided they want to become.” ― William Deresiewicz"},{"quote":"“Do not dwell on the past. Focus on the precious moments and gracious future.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“The truest and noblest gift for yourself is personal development.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“She’d always pictured her future self as a lone wolf traveling around the world, ensnaring romantic conquests and achieving her wildest and most ambitious goals. She didn’t think that at nineteen she would be so dependent on other people; she pictured herself as an autonomous and untouchable force that occasionally flitted back home to show off her new feathers before flying away to her life that was much more exciting than theirs.” ― Katie Neipris"},{"quote":"“We must keep on learning for self-development.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“I did not know of any single soul who succeed in life without a mentorship.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Unbeknownst to me, from the beginning of freshman year Rob and Oswaldo had been drawn away from Yale via their friends on the dining hall and custodial staffs, outward into the city of New Haven. Rob considered these excursions a much-needed dose of reality, the social equivalent of an antidepressant.” ― Jeff Hobbs, The Short and Tragic Life of Robert Peace: A Brilliant Young Man Who Left Newark for the Ivy League"},{"quote":"“I go back to Oberlin in the dead of winter to give a \"convocation speech\" in Finney Chapel, the largest and most historic of campus structures. In a subconscious nod to my college experience I forget to pack both tights and underwear and have to spend the weekend going commando in a wool skirt and knee socks. I am toured around the school like a stranger by a girl who didn't even go here. We stop at a glossy new cafe for tea and scones. She asks if I want a tour of the dormitories- no, I just want to wander around alone and maybe cry.” ― Lena Dunham, Not That Kind of Girl: A Young Woman Tells You What She's \"Learned\""},{"quote":"“I stayed with him for three days, and he then asked: ‘Do you know any craft by which to make your living?’ I told him: ‘I am a lawyer, a scientist, a scribe, a mathematician and a calligrapher.’ ‘There is no market for that kind of thing here,’ he replied. ‘No one in this city has any knowledge of science or of writing and their only concern is making money.’ ‘By God,’ I said, ‘I know nothing apart from what I have told you.” ― Anonymous"},{"quote":"“Creation is scientific.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Day by day, there exists the possibility for the dream to come true.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Education is acquisition of intellectual knowledge to be what we ought to be.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Never take advice about never taking advice. That is an old vice of men - to dish it out without being able to take it - the blind leading the blind into more blindness.” ― Criss Jami, Healology"},{"quote":"“if you do not share the universities' values, it could be a big mistake to send your children to college before they are intellectually and morally prepared for the indoctrination-rather-than-education they will receive there. Therefore, prepare them morally and intellectually and, if possible, do not send them to college right after high school. Let them work for a year, or perhaps travel (for example, given the antipathy to Israel on campuses, a trip to Israel would be both morally clarifying and maturing). The younger the student, the less life experience and maturity they have, the more they are likely to embrace the rejection of your values.” ― Dennis Prager"},{"quote":"“He doesn’t want to step out of the present, this present. Because once he does, there will be college applications and college acceptances (just one will do) and the last of everything (last class, last party, last night, last day, last goodbye), and then the world will change forever and he will go to college and eventually become an adult. That is not what he wants. He does not want those complications, that change. Not now.” ― David Levithan, Are We There Yet?"},{"quote":"“As though I had displeased the gods with my erotic hubris, I managed to be the only bisexual girl in the history of colleges who failed to arouse the interest of the campus queers immediately upon setting foot in the dorms.” ― Valentine Glass, Between Kay and You: A Bisexual Girl's Cumming-of-Age Confession"},{"quote":"“Young women are not putting themselves in danger. The people around them are doing the real damage. Who? you might wonder. The abstinence teacher who tells her students that they'll go to jail if they have premarital sex. The well-founded organizarion that tells girls on college campuses that they should be looking for a husband, not taking women's studies classes. The judge who rules against a rape survivor because she didn't meet whatevel standard for a victim he had in mind. The legislator who pushes a bill to limit young women's access to abortion because he doesn't think they're smart enough to make their own decisions. These are the people who are making the world a worse place, and a more dangerous one, at that, for girls and young women. We're just doing our best to live in it.” ― Jessica Valenti, The Purity Myth: How America's Obsession with Virginity is Hurting Young Women"},{"quote":"“If you're not a smart worker, it's about how hard you work double the amount from the heart; if you're not a hard worker, it's about how smart you work but times two from the brain.” ― Criss Jami, Healology"},{"quote":"“Spending $100 million on a fancy gym is completely unremarkable in contemporary American higher education. Yet $10 million for a really good online biology course that could serve millions of students is seen as an outlandish, unaffordable expense.” ― Kevin Carey, The End of College: Creating the Future of Learning and the University of Everywhere"},{"quote":"“How could he encapsulate in a pithy admissions-interview line all of his unique ideas and interests?” ― Alexandra Robbins, The Geeks Shall Inherit the Earth: Popularity, Quirk Theory and Why Outsiders Thrive After High School"},{"quote":"“Keep learning, keep learning!” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“I ate so many Ramen noodles that I wouldn't even touch a package of them now.” ― Jeremy Camp, I Still Believe"},{"quote":"“The message for all students should be: Put down the bong and get to work, because the number of curious, eager-to-learn peers around the world with the means and ambition to get a great college education is about to increase a thousandfold.” ― Kevin Carey"},{"quote":"“We care (about prison education), very simply, because (prisoners) get out. Almost everyone who is locked up now is going to be set free one day. If we treat prisoners like animals the whole time they are locked up, that's what we'll get when they're back on the streets: wild, dangerous animals.” ― Christopher Zoukis, College for Convicts: The Case for Higher Education in American Prisons"},{"quote":"“We've reached a point in human history where higher education no longer works. As a result of technology, higher education in its traditional college setting no longer works. It will never be effective or progressive enough to keep up with the growing needs of employers who look to college institutions for their future employees.I can appreciate the good intent the college system set out to achieve. For previous generations, the formula actually worked. Students enrolled into universities that were affordable, they gained marketable skills and they earned good jobs. Since there was a proven track record of success, parents instilled the value of college in their children thinking they would achieve the same success story they did, but unfortunately Wall Street was watching. Wall Street, the federal government and the college system ganged up and skyrocketed the cost of tuition to record highs. This was easy to do because not only did they have posters blanketing high schools showing kids what a loser they would be if they didn't go to college, they also had Mom and Dad at home telling them the same thing.This system - spending 4+ years pursuing a college education when the world is changing at the speed of light - no longer works and it's not fixable. We now have the biggest employer's market in human history, where employers have their pick of the litter, and because of this employees will get paid less and less and benefits will continue to erode.” ― Michael Price"},{"quote":"“I had a dream. In the dream someone was critical of my newest novel The Snail's Castle. I said, \"don't worry about it. If you don't like it, just throw it out the window.\" I awoke, grinning, with a wonderful feeling of freedom.” ― Mark Gordon, The Snail's Castle"},{"quote":"“Borrow money only for an education that will yield enough of a return in the job market to allow you to pay your loans back.” ― Kevin Carey, The End of College: Creating the Future of Learning and the University of Everywhere"},{"quote":"“The colleges and other institutions of learning are going too far, in my opinion. I think 50% of those attending educational institutions, having the professions in view, would be better off with a common school education that would enable them to earn a living, rather than sit around in offices and wait for clients. W.A. Clark (MT Senator, 1901-1907)” ― Bill Dedman, Empty Mansions: The Mysterious Life of Huguette Clark and the Spending of a Great American Fortune"},{"quote":"“This is the generation that thinks of itself as global citizens but knows little about the world and acts locally. It is the most diverse generation in collegiate history with the strongest relationships between races but they have limited interest in talking about race or reaching across political or generational divides.” ― Arthur Levine"},{"quote":"“Oswaldo was flummoxed by the fact that his friend could be so quiet, almost embarrassed, about his academic acumen, yet so damn loud and proud of his status as a premier campus drug dealer.\"I've never met anyone so smart but so fucking dumb,\" he told Rob.” ― Jeff Hobbs, The Short and Tragic Life of Robert Peace: A Brilliant Young Man Who Left Newark for the Ivy League"},{"quote":"“In the wake of his breakdown, Oswaldo had become hyperattuned to the way he, and people like him, were perceived. For his first three years at Yale, he'd been frustrated by these perceptions, feeling that they were inescapable, allowing that caged feeling to overwhelm him. The perspective granted him by two weeks of near total isolation had led him to believe that he––and in a much bigger way, Rob––had only propagated the ignorance of their peers. Because they did get stoned all the time, they did get angry, they did dress like thugs, they did talk shit about a college education that might set them up for fulfilling lives, they did set themselves apart. For Oswaldo, the issue had ceased to be a philosophical and historical one, and instead had come to revolve around a simple goal: to graduate from Yale without making that task harder than it needed to be. After all, that was the point of college––not freedom, not alcohol, not relationships, but to obtain a degree.” ― Jeff Hobbs, The Short and Tragic Life of Robert Peace: A Brilliant Young Man Who Left Newark for the Ivy League"},{"quote":"“I don’t understand why Universities only offer undergraduate classes during the day when their professional staff should be smart enough to know that a large percentage of their students are non-traditional.” ― Heather Chapple, Write like no one is reading"},{"quote":"“You see, at Rugby I was rather a great man. There one had a share in the ruling of 300 boys, and a good deal of responsibility; but here one has only just to take care of oneself, and keep out of scrapes; and that's what I never could do.” ― Thomas Hughes, Tom Brown at Oxford"},{"quote":"“The faces of your young people in general are not interesting—I don't mean the children, but the young men and women—and they are awkward and clownish in their manners, without the quaintness of the elder generation, who are the funniest old dears in the world.\" \"They will all be quaint enough as they get older. You must remember the sort of life they lead. They get their notions very slowly, and they must have notions in their heads before they can show them on their faces.” ― Thomas Hughes, Tom Brown at Oxford"},{"quote":"“One thing they do not teach you in college is what you will actually be doing in a career of your choosing.” ― Joanie Connell, Flying Without a Helicopter: How to Prepare Young People for Work and Life"},{"quote":"“Campuses are bubbles, artificial environments that insulate students from the life of the competitive marketplace. The more exact truth is that our campuses offer students the privileges of liberty without the corresponding responsibilities.” ― Peter Augustine Lawler"},{"quote":"“Guerilla warfare? I was in way over my head. I told myself that I could do this. It was guerilla warfare every time I went to sleep.” ― Laura Thalassa, The Vanishing Girl"},{"quote":"“I love to teach children science.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“College towns [are] all the same in that way; same burger, different wrapper.” ― Sheri Webber, Devil Went Down: And Hell Came Running"},{"quote":"“Despite all the challenges facing higher education in America, from mounting student debt to grade inflation and erratic standards, our system is rightly the world's envy, and not just because our most revered universities remain on the cutting edge of research and attract talent from around the globe. We also have a plenitude and variety of settings for learning that are unrivaled. In light of that, the process of applying to college should and could be about ecstatically rummaging through those possibilities and feeling energized, even elated, by them. But for too many students, it's not, and financial constraints aren't the only reason. Failures of boldness and imagination by both students and parents bear some blame. The information is all out there. You just have to look.” ― Frank Bruni"},{"quote":"“The student body, too, felt more diverse. Rob spoke often of \"real people\" with his friends, by which he meant people who struggled, like they all did. On the Ivy League campus visits, any sense of daily or long-term struggle had seemed airbrushed. At Johns Hopkins––and maybe he was only imagining this because of the Ivy League stigma absent in Baltimore––Rob believed the average student had worked harder and sacrificed more to be there.” ― Jeff Hobbs, The Short and Tragic Life of Robert Peace: A Brilliant Young Man Who Left Newark for the Ivy League"},{"quote":"“The word \"fronting\" was important to Rob. A coward who acted tough was fronting. A nerd who acted dumb was fronting. A rich kid who acted poor was fronting. Rob found the instinct very offensive, and in college he saw it all around.” ― Jeff Hobbs, The Short and Tragic Life of Robert Peace: A Brilliant Young Man Who Left Newark for the Ivy League"},{"quote":"“Loneliness wasn't just a state of mind, was it? It was tactile. She could feel it. It was a sixth sense, not in some fanciful play of words, but physically. It hurt... it hurt like phagocytes devouring the white matter of her brain. It was merely that she had no friends. She didn't even have a sanctuary in which she could simply be alone.” ― Tom Wolfe, I Am Charlotte Simmons"},{"quote":"“That's not the end of the world! This is the time to cut loose! To really learn about everything! To learn about guys, to really get to know them! Really find out what goes on in the world! You just have to let yourself fly for once, without constantly thinking about what you left behind on the ground! You're a genius. Everybody knows that. I'm being sincere, Charlotte. Totally. Now there's other things to learn, and this is the perfect time to do it. Take a chance! That's one reason people go to college! It's not the only reason, but it's a big reason.” ― Tom Wolfe, I Am Charlotte Simmons"},{"quote":"“So we might say that the most important thing one can acquire in college is a well-functioning bullshit meter.” ― Andrew Delbanco"},{"quote":"“Loneliness wasn't just a state of mind, was it? It was tactile. She could feel it. It was a sixth sense, not in some fanciful play of words, but physically. It hurt... it hurt like phagocytes devouring the white matter of her brain. It wasn't merely that she had no friends. She didn't even have a sanctuary in which she could simply be alone.” ― Tom Wolfe, I Am Charlotte Simmons"},{"quote":"“One cannot get rid of a good education, nor, unfortunately, of a bad one, which often is such because one has not wanted to defray the expenses of a good one.” ― Denis Diderot"},{"quote":"“The chance that you will become a master in something after the first attempt is neither here nor there. You don't get master's degree by attending school on the first day! Time will tell, so you got to persist!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Rather than literally burning the midnight oil, which he judged to be unhealthy, John Adams advised his son to make the most of college by developing an inquisitive outlook that would prompt him to get to know the most exceptional scholars and question them closely. \"Ask them about their tutors, manner of teaching. Observe what books lie on their tables. Fall into questions of literature, science, or what you will.” ― David McCullough"},{"quote":"“A degree helps to a degree, but your work is largely what you create it to be.” ― Ryan Lilly"},{"quote":"“Twice I'd come home as they were finishing, and, honestly, I cannot think of a lonelier sound on a Saturday night than one's roommate having a giant orgasm and then making an embarrassed sssh sound, realizing that maybe through her pleasure she'd heard the front door open and close.” ― Aimee Bender, The Color Master: Stories"},{"quote":"“Molly. I have an opportunity for you.”“An opportunity?” I repeated, without enthusiasm. Oh, good. Next comes the part where he tells me to be a “team player” and then dumps some tedious task on me.“It’s a chance for you to show that you can be a team player,” Bill Vogel said.” ― Frankie Bow, The Musubi Murder"},{"quote":"“Never be discouraged. The fact that you will be a winner at the first attempt is unclear. You don’t get master’s degree after attending school on the first day. You got to endure till you get there.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“I tried to lose myself in school and friends as best as I was able, trying to put Dorian's world out of my mind. But that was pretty much impossible with Clarrisa's constant, homicidally cheerful presence, which was, I supposed, something like making friends with a live grenade.” ― V.M. Black, Time Out of Mind"},{"quote":"“Lucia opened the door. \"They say not to discuss politics and religion on the first date.\"“Well, then.” I gave her a huge smile. “We’re screwed.” ― Jennifer Lane, Blocked"},{"quote":"“I discovered that night (in his college's student politics) that an audience has a feel to it, and, in the parlance of the theater, that audience and I were together.” ― Ronald Reagan"},{"quote":"“I thought i had been educated well enough until i left college.” ― Paul Bamikole"},{"quote":"“Tall, dark, and hot leaned against a pillar, watching me as I took my place in line. Tousled dark hair went every which way on his head. His eyes were slitted and intense, like he might need to have sex at any moment. Maybe even with me.” ― Veronica Wolff, Isle of Night"},{"quote":"“And then he winked.Jeez, I thought my heart would explode on the spot. The last time a guy winked at me was years ago, and that’d been a creepy mall Santa.” ― Veronica Wolff, Isle of Night"},{"quote":"“I love having to attend the one class that is being taught by a professor who feels that their class is the only class being taught at the University and gives nothing but busy work.” ― Heather Chapple, Write like no one is reading"},{"quote":"“Do I have to give you hair torture to get it out of you?”What is that? From the light in her eyes and the jaunty uptick of her mouth, I had a sense it would be pleasurable. “Do what you must.”In a dash, she pinned my wrists above my head. Her head dipped and her thick hair engulfed me, sweeping across my face and filling my mouth. “Nooo!” I half-heartedly pressed against her hold.“Give it up, Dane.” I could hear the laughter in her voice.“Never!” I thrashed my head from side to side, trying to breathe through the black curtain blinding and drowning me. “You’re killing me!”“Jeez, you take this even worse than Matty.”I groaned. “With a sister like you, I feel sorry for him.”There was a sharp rap on the door. “Are you okay in there?” China asked.Lucia glanced at me, and we both cracked up.” ― Jennifer Lane, Blocked"},{"quote":"“In this neighbourhood people don't venture out after dark. It's not safe for them. Only the terminally stupid and the criminally motivated come out at this hour.” ― J.J. Bonds, Crossroads"},{"quote":"“I couldn’t bring myself to call him either “Bill,” which would signal friendly familiarity, or “Doctor Vogel,” which would imply respect.” ― Frankie Bow, The Musubi Murder"},{"quote":"“Did he talk about silos?”“Of course he did,” I said. “We have to break down the silos that separate the academic side of the house from the Student Retention Office, apparently.”Emma wrinkled her nose. “Why is it a good thing to break silos? All that happens when you break a silo is that the grain spills out. Or the missile falls over.” ― Frankie Bow, The Musubi Murder"},{"quote":"“A month into the semester, I would start showing up twenty minutes late to class again. The rewards weren't enough to keep me on task, and life got in the way. My mind wandered to the future, postcollege, when I'd create my own schedule that served my need to eat a rich snack every five to fifteen minutes. As for the disappointment written across the teacher's face? I couldn't, and wouldn't, care.” ― Lena Dunham"},{"quote":"“What we have before us then, is three distinct purposes for a university: the commercial purpose (starting a career), Stephen Pinker’s cognitive purpose (acquiring information and learning how to think) and (William) Deresiewicz’s moral purpose (building an integrated self).” ― David Brooks"},{"quote":"“Universities, he (William Dershowitz) says, have been absorbed into the commercial ethos. Instead of being intervals of freedom, they are breeding grounds for advancement. Students are too busy jumping through the next hurdle in the résumé race to figure out what they really want. They are too frantic tasting everything on the smorgasbord to have life-altering encounters. They have a terror of closing off options. They have been inculcated with a lust for prestige and a fear of doing things that may put their status at risk.” ― David Brooks"},{"quote":"“One of the ironies of college is that the impossibility of reading your way out of the modern predicament is something you learn about, as a student, by reading. Part of the value of a humanistic education has to do with a consciousness of, and a familiarity with, the limits that you’ll spend the rest of your life talking about and pushing against.” ― Joshua Rothman"},{"quote":"“Ukiwa na kipaji nenda shule kurekebisha kipaji chako, ukiwa na ujuzi nenda shule kurekebisha ujuzi wako.” ― Enock Maregesi"},{"quote":"“Think I have made a terrible mistake going to college. Have decided to become a shepherd and spend my days tending to flocks of goats” ― Scott Frost"},{"quote":"“Colleges seem to want candidates that are so well-rounded they'd have to be two different people use together with mutually exclusive characteristics! They have to be gung ho athletes and sensitive artists, studious nerds and gregarious social networkers, future rulers of the universe and selfless altruists.” ― Rebecca Goldstein, Plato at the Googleplex: Why Philosophy Won't Go Away"},{"quote":"“Surely there was at least one other girl on campus not sporting a French pedicure (do girls really think we’re fooled by the little white lines painted across their toenails?), who had some black in her wardrobe, and actually thought about things. You know, someone who knew the word French could imply more than just a way to kiss.” ― Veronica Wolff, Isle of Night"},{"quote":"“When the point of education becomes the production of credentials rather than the cultivation of knowledge, it forfeits the motive recognized by Aristotle: \"All human beings by nature desire to know.” ― Matthew B. Crawford, Shop Class as Soulcraft: An Inquiry Into the Value of Work"},{"quote":"“On the first day of a college you will worry about how will you do inside the college? and at the last day of a college you will wonder what will you do outside the college?” ― Amit Kalantri"},{"quote":"“The last year of her college career was wheeling slowly round. She could see ahead her examination and her departure. She had the ash of disillusion gritting under her teeth. Would the next move turn out the same? Always the shining doorway ahead; and then, upon approach, always the shining doorway was a gate into another ugly yard, dirty and active and dead. Always the crest of the hill gleaming ahead under heaven: and then, from the top of the hill only another sordid valley full of amorphous, squalid activity.” ― D.H. Lawrence, The Rainbow"},{"quote":"“What are the purposes of examinations anyhow? Are they to increase our educational attainment? Or are they instruments used to bring suffering and humiliation and deep hurt to a person who is trying so hard to succeed?” ― Virginia Mae Axline, Dibs in Search of Self"},{"quote":"“Of course he had a female following. Was there anything college girls found sexier than being told what to think?” ― Mira Jacob, The Sleepwalker's Guide to Dancing"},{"quote":"“College = A place where you spend a ton of money for a piece of paper that says you're qualified.” ― Korey Miracle"},{"quote":"“For Jefferson, William and Mary was largely about what university life is supposed to be about: reading books, enjoying the company of like-minded, and savoring teachers who seemed to be ambassadors from other, richer, writer worlds. Jefferson believed Williamsburg \"the finest school of manners and morals that ever existed in America.” ― Jon Meacham, Thomas Jefferson: The Art of Power"},{"quote":"“At this very moment with my girl in my arms, I feel like there’s nothing I can’t do for her, for us. — Duke” ― Stephanie Witter, Fix Up"},{"quote":"“Don't see me as a girl. See me as a buddy of yours or something.\" He cast his eyes downward and didn't look back up to my face. I looked down and groaned. Such a guy. \"My buddies don't have boobs, as far as I know.\" \"Because you felt them up to be sure?\" I chuckled, against my better judgement. Once again, his mouth dropped open.” ― Stephanie Witter, 2B or Not 2B?"},{"quote":"“AVERT DISASTER, in fact, would have been a perfect school motto—the purpose of the place, as far as Schwartz could tell, was to keep three thousand would-be maniacs sedated by boredom until a succession of birthdays transformed them into adults.” ― Chad Harbach, The Art of Fielding"},{"quote":"“Jefferson and Washington had no idea these idiots would exist, otherwise they would not have made killing illegal.” ― Anonymous"},{"quote":"“People who enroll themselves in the schools of pride, eventually graduate with and high degree of fall. Failure employs “prides” scholars. Get rusticated now!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“I listen closely to her breathing getting slower, deeper until her hand settles over my heart, only beating for her. — Duke” ― Stephanie Witter, Fix Up"},{"quote":"“The truth is this: The rich will rule even at a place like Oberlin, where their kind is technically forbidden. They will simply invert the power structure to suit their needs. They will come out on top no matter what. Stuyvesant was hard but hopeful; Oberlin, on the other hand, reminds me yet again how the world works. I guess that's why they call it an education.” ― Gary Shteyngart, Little Failure"},{"quote":"“Being in love changes a person…a modest touch changes one’s mind, a lone thought one’s reasoning, but a kiss my friend, well that changes one’s existences.” ― Christina Marie Morales, Ambience"},{"quote":"“Will you be able to touch me again without thinking about Sean? I don't want you to be disgusted by me.” ― Stephanie Witter, Fix Up"},{"quote":"“What a fucking charade.Happy. That shit isn’t in our cards. — Duke” ― Stephanie Witter, Fix Up"},{"quote":"“There’s only so much a man can survive and as fucking weak as it sounds, I reached my limits when Skye disappeared. —Duke” ― Stephanie Witter, Fix Up"},{"quote":"“At least, for once I was there for her. I didn’t fail her. She wasn’t alone. — Duke” ― Stephanie Witter, Fix Up"},{"quote":"“For this very short time in your life, and possibly never again, you will be given a very unique gift: a supremely rich environment with ample time, space, safety and people to explore whatever interests you intensely, to push yourself, to make mistakes and recover from them, and to live as deeply as you'd like in the hope of finding yourself or, at least, the beginnings of yourself.Such an opportunity may never present itself again. So, embrace it and.... Carpe College!” ― Michael Metzler, Carpe College! Seize Your Whole College Experience"},{"quote":"“Jaxon snorted in disbelief. He cupped his sac just to make sure his balls and dick were still there. If he hadn’t been so content in his life he would’ve thought he was growing a vagina.” ― Senayda Pierre, Temptation"},{"quote":"“It is not easy to find someone your size once the Freshman Fifteen turns to the Sophomore Forty or the Senior Sixty. Even when, through some miracle of self-restraint and bulimia, college girls managed to continue to have feminine bodies, so many of these tacky sluts have never heard word one about what fashion entails.” ― Thomm Quackenbush, Danse Macabre"},{"quote":"“In College average and numbers means everything to a guy.” ― Slicktor Victor Robinson"},{"quote":"“You know she needs you. Think for a minute instead of playing the wounded ego card.’’ — Derek” ― Stephanie Witter, Fix Up"},{"quote":"“It only wakes up the burning desire I always feel whenever I'm close to this man and the shadows of my fears back away. — Skye” ― Stephanie Witter, Fix Up"},{"quote":"“I love you to insanity. I'm not even sure if it's a good thing.'' — Duke” ― Stephanie Witter, Fix Up"},{"quote":"“It’s a matter of when I’ll stop fighting. — Duke” ― Stephanie Witter, Fix Up"},{"quote":"“Therapy can’t erase scars, it only makes it easier to live with them. — Duke” ― Stephanie Witter, Fix Up"},{"quote":"“Fucking is easy, dating is not. — Duke” ― Stephanie Witter, Fix Up"},{"quote":"“The most effective learning takes place in the classroom, where you can easily raise your hand, engage in spontaneous discussions with classmates and faculty, turn to the person next to you to ask for clarification, or approach the professor after class or during office hours to ask questions or exchange viewpoints in a way that practically guarantees an instant response and is not constrained by typing, software interfaces, or waiting for a response.” ― Ian Lamont"},{"quote":"“College: two hundred people reading the same book. An obvious mistake. Two hundred people can read two hundred books.” ― John Cage, M: Writings '67–'72"},{"quote":"“The best university in the world is neither Oxford nor Harvard. The best university is \"youniversity\". YOU got the lecture halls of thoughts in YOU! You got everything you need to graduate with first class accomplishments put in you! YOU can do it!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“But I know I didn't love school for school's sake. I had never really been what people call an 'academic' person, nor did I see myself becoming one. Instead, I took pleasure in the fact that my work existed in a social setting, one that was based on the promise of a brighter future. I knew that what I adored about school was that each of my assignments - readings, essays, or in-class presentations - was inseparable from my relationships [...] If I loved school at all, I loved it for what it provided me access to: bonds with people I grew to cherish. And nothing was better than working toward my dreams alongside people I loved who were doing the same.” ― Liz Murray, Breaking Night: A Memoir of Forgiveness, Survival, and My Journey from Homeless to Harvard"},{"quote":"“What I want to get out of my college course is some knowledge of the best way of living life and doing the most and best with it. I want to learn to understand and help other people and myself.” ― L.M. Montgomery, Anne of Avonlea"},{"quote":"“Most of us are pseudo-scholars...for we are a very large and quite a powerful class, eminent in Church and State, we control the education of the Empire, we lend to the Press such distinction as it consents to receive, and we are a welcome asset at dinner-parties.Pseudo-scholarship is, on its good side, the homage paid by ignorance to learning. It also has an economic side, on which we need not be hard. Most of us must get a job before thirty, or sponge on our relatives, and many jobs can only be got by passing an exam. The pseudo-scholar often does well in examination (real scholars are not much good), and even when he fails he appreciates their inner majesty. They are gateways to employment, they have power to ban and bless. A paper on King Lear may lead somewhere, unlike the rather far-fetched play of the same name. It may be a stepping-stone to the Local Government Board. He does not often put it to himself openly and say, \"That's the use of knowing things, they help you to get on.\" The economic pressure he feels is more often subconscious, and he goes to his exam, merely feeling that a paper on King Lear is a very tempestuous and terrible experience but an intensely real one. ...As long as learning is connected with earning, as long as certain jobs can only be reached through exams, so long must we take the examination system seriously. If another ladder to employment were contrived, much so-called education would disappear, and no one be a penny the stupider.” ― E.M. Forster, جنبه‌های رمان"},{"quote":"“I spent three days a week for 10 years educating myself in the public library, and it's better than college. People should educate themselves -- you can get a complete education for no money. At the end of 10 years, I had read every book in the library and I'd written a thousand stories.” ― Ray Bradbury"},{"quote":"“Computer mistake in grade-giving resulted in academic failure of several brilliant students. After some years the mistake was discovered. Letter was sent to each student inviting him to resume his studies. Each replied he was getting along very well without education.” ― John Cage, M: Writings '67–'72"},{"quote":"“Carmyn drops her glass from her lips first and bites into the slice of lime she's holding in her other hand. Her lips wrap around the flesh of the fruit, and my dick flexes in earnest. I've watched women suck on me and not look nearly that seductive.” ― Angeline Kace, Wicked Thing"},{"quote":"“I’m a fan of Belle from Beauty and the Beast. Brunette and doesn’t mind a guy that’s an animal? Hell yeah.” ― Magan Vernon, The Only One"},{"quote":"“Don't think about that. Just believe I'll be okay.” ― Shane Morgan, Impossibly Love"},{"quote":"“Love doesn’t conquer all; it’s a powerful tool to overcome everything because it means you’re not alone.” ― Stephanie Witter"},{"quote":"“I love you, Skye. You’re in my heart, in my head, under my skin. You’re my present and my future.” ― Stephanie Witter, Patch Up"},{"quote":"“When it was time to board my flight, I took one last glance back. I knew that I had everything with me so it was not a \"make sure I have everything\" glance. It was more like a parting glance to Philadelphia, my home, America- for I would not be coming back for ten months. (Ch 5- Twenty in Paris)” ― Andrea Bouchaud, Twenty in Paris: A Young American Perspective of Studying Abroad in Paris"},{"quote":"“If everyone could learn how to read books properly and how to use them as effective tools for daily living, the facilities of colleges could easily go out of existence without any loss to society.' -From a speech by the president of Mount Holyoke College, as reported in the Philadelphia Public Ledger, May 13, 1938” ― Francis Beauchesne Thornton, How to Improve Your Personality by Reading"},{"quote":"“Maybe Duke was just the kind of person you don’t keep in your life, but the kind of person that changes your life forever.” ― Stephanie Witter, Patch Up"},{"quote":"“President Obama smoked so much pot in college he never learned to spell. Which is why he's confusing the word \"ruining\" the country with \"running\" the country.” ― Kilburn Hall"},{"quote":"“i don't think college is something you should tough out.” ― Kevin Roose, The Unlikely Disciple: A Sinner's Semester at America's Holiest University"},{"quote":"“Boy needs to get a good night's sleep. Otherwise, he'll be lucky to get accepted at SUNY-So Far Upstate You Might As Well Be In Canada, eh?” ― Rachel Cohn, Naomi and Ely's No Kiss List"},{"quote":"“{...]I began to feel tears of frustration build up in my eyes, yearning to free themselves from their glandular prisons.” ― Andrea Bouchaud, Twenty in Paris: A Young American Perspective of Studying Abroad in Paris"},{"quote":"“Stop Dieting...Start Eating CUte” ― Alexandra Catalano, From Beer Bongs to Broccoli: The College Kid's Guide To Health and Wellness"},{"quote":"“Oh, hell no!\" I yell at them. They are not about to negotiate as to whether they get to see my goods. \"Denton, I swear to God, if you come over here, I am sending you anthrax in the mail!” ― Angeline Kace, Wicked Thing"},{"quote":"“some students look at the problems that they're facing and they draw global conclusions from them. They say this is not just a professor giving me a bad grade or someone not sitting next to me in the cafeteria. This reflects that fact that I am not ready for college, or I shouldn't be in this college at all.” ― Shankar Vedantam"},{"quote":"“It’s YOUR journey. Ask yourself who you are, where you want to go, and how you’d like to get there. Graciously accept advice from everyone, but don’t look left and right and wonder why you’re not taking the path of your peers. Enjoy the path you’re on and make the most of it. Carpe College!” ― Michael Metzler, Carpe College! Seize Your Whole College Experience"},{"quote":"“It was always embarrassing when professors assigned their own books. Even Madeleine, who found all the reading hard going, could tell that Zipperstein’s contribution to the field was reformulative and second-tier.” ― Jeffrey Eugenides, The Marriage Plot"},{"quote":"“If you see yourself as other people see you, it means you are lost, you don't know yourself and you have closed down a world class university of diligence!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“The appearance of Professor Benjamin Peirce, whose long gray hair, straggling grizzled beard and unusually bright eyes sparkling under a soft felt hat, as he walked briskly but rather ungracefully across the college yard, fitted very well with the opinion current among us that we were looking upon a real live genius, who had a touch of the prophet in his make-up.” ― William Elwood Byerly"},{"quote":"“Although the terms teaching and learning are typically paired, those of us who teach know that students don't always learn. When I complained about this early in my teaching career, a colleagues chided me: \"Saying 'I thaught the students something, they just didn't learn it' is akin to saying 'I sold them the car, they just didn't but it'\".” ― Elizabeth F. Barkley, Student Engagement Techniques: A Handbook for College Faculty"},{"quote":"“Relationships, the ones that last anyway, are really an extended game of Let's Make A Deal.” ― Claire Cook, Multiple Choice"},{"quote":"“Gareth Miller grabbed the beer first, then the hotdog, because if there’s one thing you don’t want to be caught dead without at these sorts of events it’s beer. The hotdog was strictly for show, a prop, a way of blending in.Burst of static in his right ear: “G-man, you read me? What’s yo’ twenty, dawg?”Gareth departed the concession stand, stopped, looked down at his hands, and tossed the hotdog into the first trash receptacle he saw. Raising his wrist to his mouth, he spoke into the cuff of his long-sleeved tee. “Concession stand, Section B. Over.”Allowing his hand to linger by his chin, he gingerly scratched his cheek as if he had meant to do it all along. The same voice: “Yo, I’m in position. Ready when you is.”Gareth cringed while crossing the wide concourse, checking both directions. The giant hallway was the main drag of a ghost town, its only residents a solitary custodian sweeping debris into a portable waste bin and the concession crew to his rear.” ― Jay Nichols, Uprising"},{"quote":"“You can't change generational poverty by sitting on your ass. Let's get to work!” ― Damen Lopez"},{"quote":"“uh, yeah, I love...worms\" Classic. Someone should record the gold that flows from my mouth.” ― Rachel Van Dyken, Elite"},{"quote":"“Don't ever let anyone tell you that college is for smart people. College eats smart people alive.” ― Hannah Moskowitz, Invincible Summer"},{"quote":"“Our first kiss was there on the bridge in the woods. How do you describe a first kiss? It is like trying to hold water in your hands. There is an ancient Chinese proverb that compares kissing to drinking salted water. “You drink, and your thirst increases,” it says. Time, I’m sure, passed by, but we remained unavailable for comment.” ― Kirstie Collins Brote, Beware of Love in Technicolor"},{"quote":"“It was about how men walk into a forest afraid because they know all the things that can happen. They might wake the noisy birds and cause chaos. But kids come into the trees and see the magic. They climb them and see stars that the men were too afraid to see.” ― Laura Anderson Kurk"},{"quote":"“Success comes with failure which leads to doubts but with determination we can still achieve.” ― Jonathan Anthony Burkett"},{"quote":"“College isn't half as much fun as they told us it was going to be.\"\"It's not one-hundredth as much fun.” ― Molly Ringle, Relatively Honest"},{"quote":"“Sometimes people graduate but they don't leave. They hang around for years, for no reason. I would think of ghosts like that, I decided.” ― Maureen Johnson, The Name of the Star"},{"quote":"“I've learned a lot playing college ball,\" Mark says.\"What you do in high school doesn't mean shit. You can be the best ballplayer in your high school. The best in the country or state, but when you get to college, you're going to meet fifty other guys who can brag the same thing. You'll meet guys better than you, stronger than you, faster than you, and then you're up against better teams. The world changes when you leave Groveton.” ― Katie McGarry, Dare You To"},{"quote":"“She told her therapist it reminded her of coming home the summer after her freshman year at Rutgers, stepping back into the warm bath of family and friends, loving it for a week or two, and then feeling trapped, dying to return to school, missing her roommates and her cute new boyfriend, the classes and the parties and the giggly talks before bed, understanding for the first time that that was her real life now, that this, despite everything she'd ever loved about it, was finished for good.” ― Tom Perrotta, The Leftovers"},{"quote":"“I'll keep you here.' He taps his temple. 'Where you can't get lost.” ― Gayle Forman, Just One Day"},{"quote":"“A lonely person on a college campus is never more than a few minutes and a bad decision from company.” ― Thomm Quackenbush, We Shadows"},{"quote":"“You look incredible, Kavanagh,” Quinn whispered close to my ear. “Are you trying to kill me?”“Ssshhh,” I hissed. “They’re going to hear you.”“I can’t tell my date she’s beautiful?”I turned my head. “No. No, you can’t.” ― Laura Anderson Kurk, Perfect Glass"},{"quote":"“I thought back to Meg’s advice about Hemingway sentences—simple declarative statements that showed the truth and distilled the meaning. My first attempt at that had been cynical and messed up. I gave it a go again.Find one lost sheep.The angels rejoice.” ― Laura Anderson Kurk, Perfect Glass"},{"quote":"“High school and college students like to torture their bodies. They pull countless all-nighters, continually skip breakfast, eat nothing but ramen noodles for dinner, find creative new ways to guzzle alcohol, transform into couch potatoes, and gain 15 pounds at the freshman dinner buffet. At least, that's the stereotype.” ― Stefanie Weisman, The Secrets of Top Students: Tips, Tools, and Techniques for Acing High School and College"},{"quote":"“When I was young, I thought it is thunder that kills people. But when I learnt physics in the high school, I discovered that it is rather the lightning that does the killing. The voice of the thunder itself is just a noise. The lightning is the poise!” ― Israelmore Ayivor"},{"quote":"“I've asked around and haven't found a B.A. yet who doesn't still have nightmares (and I don't speak figuratively) about not being able to find the room where the exam is to be given or about realizing at the last moment that he has not once attended the course.” ― Elizabeth Savage, The Last Night at the Ritz"},{"quote":"“Her problem is with pretty,” Tennyson said. \"She thinks I’ll need all these dresses in college. Like I would ever in a billion years pledge a sorority. I’ll pack a few of these to be ironic, though. I can wear them to, like, truck stops at night with mascara running down my cheeks and stuff.” ― Laura Anderson Kurk, Perfect Glass"},{"quote":"“Look at this one.” I picked up a small painting of a man with dark hair and a short, dark beard. He wore a loose shirt, cobalt blue, unbuttoned at the top, showing a prominent, knobby collarbone. He looked…complicated and hungry. She’d captured him focused intensely on a book, his face pressed against a wall like he was resting. Or waiting.” ― Laura Anderson Kurk, Perfect Glass"},{"quote":"“College is a blossoming new world of genital opportunity.” ― Thomm Quackenbush, We Shadows"},{"quote":"“The style of flirtation specific to classrooms was of service to the students all their lives.” ― Renata Adler, Speedboat"},{"quote":"“Educate thyself through reading” ― Ann Shannon"},{"quote":"“Outside the study hall the next fall, the fall of our senior year, the Nabisco plant baked sweet white bread twice a week. If I sharpened a pencil at the back of the room I could smell the baking bread and the cedar shavings from the pencil.... Pretty soon all twenty of us - our class - would be leaving. A core of my classmates had been together since kindergarten. I'd been there eight years. We twenty knew by bored heart the very weave of each other's socks....The poems I loved were in French, or translated from the Chinese, Portuguese, Arabic, Sanskrit, Greek. I murmured their heartbreaking sylllables. I knew almost nothing of the diverse and energetic city I lived in. The poems whispered in my ear the password phrase, and I memorized it behind enemy lines: There is a world. There is another world. I knew already that I would go to Hollins College in Virginia; our headmistress sent all her problems there, to her alma mater. \"For the English department,\" she told me.... But, \"To smooth off her rough edges,\" she had told my parents. They repeated the phrase to me, vividly. I had hopes for my rough edges. I wanted to use them as a can opener, to cut myself a hole in the world's surface, and exit through it. Would I be ground, instead, to a nub? Would they send me home, an ornament to my breed, in a jewelry bag?” ― Annie Dillard, An American Childhood"},{"quote":"“Henry drew a shaky breath. “Do me a favor, Meg.”“Anything,” I whispered.“Don’t fall for Quinn O’Neill. If you’re going to do this thing with him…go to this dance, don’t fall for him.”“Never,” I said. “I promise.”“Because I’m all filled up on sad right now.” He sniffed again and I could tell he was more in control. “And you can’t ask me to sit by and watch you get all caught up in this guy. I can’t handle that—thinking he swept you off your feet because he bathed in body spray and dressed up.” His voice sounded rough. “I know you think I’m being funny right now, but I’m completely serious. Don’t make me watch that happen.”“You know my heart,” I said. “It’s yours.” ― Laura Anderson Kurk, Perfect Glass"},{"quote":"“Thanet is having a moment,” I said, leaning forward so Quinn could see him.“What’s wrong, man?” Quinn said. “Were you not aware high school dances suck? That they always have sucked and they will continue sucking as long as the world turns?” ― Laura Anderson Kurk, Perfect Glass"},{"quote":"“If you were ready to sleep with me we wouldn't be in this bar, but in my room not wasting any more time.” ― Stephanie Witter, Patch Up"},{"quote":"“There are three types of student: The golden student pays and loans, the silver student pays but does not learn, the bronze student learns but does not pay.” ― J.C. McKeown, A Cabinet of Greek Curiosities: Strange Tales and Surprising Facts from the Cradle of Western Civilization"},{"quote":"“The college diploma has no more power to hold the knowledge you have gained in college than a piece of tissue paper over a gas jet can hold the gas in the pipe.” ― Orison Swett Marden, Pushing to the Front"},{"quote":"“I didn’t look at Thanet. I couldn’t because he would see the hurt on my face.“He loves you,” Thanet said. “He’s hurting and it’s not just the Quinn thing. It’s being away from you and wondering if you’re hurting, too. Or if you’re having too much fun to hurt. What he really needed was to laugh, though. So we laughed…until he cried.”That undid me. I looked at Thanet with so many questions on my lips.” ― Laura Anderson Kurk, Perfect Glass"},{"quote":"“In my freshman and sophomore years of college, I read dozens of books by the great thinkers of Western civilization. From Plato to Nietzsche, Homer to Shakespeare - you name it, I read it. At times it drove me crazy - picture reading hundreds of pages that sound like this every week: \"All rational knowledge is either material and concerned with some object, or formal and concerned only with the form of understanding and of reason themselves and with the universal rules of thought in general without regard to differences of its objects.\" Come again, Kant?” ― Stefanie Weisman, The Secrets of Top Students: Tips, Tools, and Techniques for Acing High School and College"},{"quote":"“Ah, group projects. Some people love 'em, some people hate 'em - okay, most people hate 'em. Your grade now depends on other people whom you may never have met before, and you've somehow got to do the impossible: find some time when a bunch of super-busy high school or college students can actually meet in person.” ― Stefanie Weisman, The Secrets of Top Students: Tips, Tools, and Techniques for Acing High School and College"},{"quote":"“There are some things you can’t learn at any university, except for one, the University of Life... the only college where everyone is a permanent student.” ― E.A. Bucchianeri, Brushstrokes of a Gadfly"},{"quote":"“She was as lovely sleeping as she was dripping in sensuality at the fundraiser” ― Kailin Gow, The Protege"},{"quote":"“If there was ever a dress that can be an aphrodisiac the one Serena was wearing now had to be it” ― Kailin Gow, The Protege"},{"quote":"“Tanned, toned, curves in the right places and that small waist…lips, hair, eyes all packaged up like a siren. If she’s a siren, I heard her call, and I’m diving in hook, line, and sinker. - Drew Donovan” ― Kailin Gow, Falling for Summer"},{"quote":"“His music was an outlet of that romantic energy and sensitivity.” ― Kailin Gow, The Protege"},{"quote":"“That's what I don't like about college, by the way. It's like a lot of people don't believe these years really count, so you're allowed to experiment with... whatever. There's such a casual view about things like sex and drinking and even drugs. I know that sounds really old-fashioned, but I just don't get it...to be honest, I'm kind of disappointed in those two people I heard about, and I don't want to sit there trying to pretend that I'm not. I know I shouldn't judge,...but still, what was the point? Shouldn't you save things like that for someone you love? So that it really means something?\" - Savannah” ― Nicholas Sparks, Dear John"},{"quote":"“Maybe we were being a bit unrealistic, but we had this hope that if we could just get into the Ivy League, everything would be set. We dreamed of Gothic libraries and leafy green quads and romantic dorms with fireplaces and guys who were not only cute but also smart and charming, and, quite possibly, British. In college, we believed, we’d finally find our people.” ― Sarah Strohmeyer, Smart Girls Get What They Want"},{"quote":"“You have a college degree? You can barely talk.” ― Susan Elizabeth Phillips, The Great Escape"},{"quote":"“It was a running joke; everyone was aware of how ridiculous the rumor mill was, and yet they all shamelessly participated in it.” ― Jamie McGuire, Beautiful Disaster"},{"quote":"“The primary purpose of going to college isn't to get a great job. The primary purpose of college is to build a strong mind, which leads to greater self-awareness, capability, fulfillment, and service opportunities, which, incidentally, should lead to a better job.” ― Sean Covey, The 6 Most Important Decisions You'll Ever Make: A Guide for Teens"},{"quote":"“This is not hyperbole. It is possible for the average professor to have been taught by leftists, grown up in a left-leaning city, read only left-leaning books, entertained by leftists in pop culture and became a professor without holding a job outside academia. How can we expect these professors to adequately explain what people who oppose them believe?” ― Lee Doren, Please Enroll Responsibly: Avoid Indoctrination at College"},{"quote":"“It is good for a student to be poor. Getting and spending, the typical American college student lays waste his powers. Work and contemplation don't mix, and university days ought to be days of contemplation.” ― Russell Kirk"},{"quote":"“I remembered learning from my favorite professor at Belmont to “surround yourself with people who are better than you,” and I was now living that mantra.” ― Kimberly Novosel, Loved"},{"quote":"“...the most important thing you must remember when dealing with a politically biased professor is to be friendly.” ― Lee Doren, Please Enroll Responsibly: Avoid Indoctrination at College"},{"quote":"“College mostly makes people like bladders—just good for nothing but t’ hold the stuff as is poured into ‘em.” ― George Eliot, Adam Bede"},{"quote":"“Going to college don't make you from somewhere, any more than a cat born in an over can call itself a biscuit.” ― Laura Lippman, Pony Girl"},{"quote":"“College is a different scene than it was ten years ago. It used to be all about sex and drugs. Now it’s all about texting and fast food.” ― Aaron B. Powell, Priority"},{"quote":"“Brockhurst, the champion of individualism, was soon launched on his favorite topic.\"The great fault of the American nation, which is the fault of republics, is the reduction of everything to the average. Our universities are simply the expression of the forces that are operating outside. We are business colleges purely and simply, because we as a nation have only one ideal—the business ideal.\"\"That's a big statement,\" said Regan.\"It's true. Twenty years ago we had the ideal of the lawyer, of the doctor, of the statesman, of the gentleman, of the man of letters, of the soldier. Now the lawyer is simply a supernumerary enlisting under any banner for pay; the doctor is overshadowed by the specialist with his business development of the possibilities of the rich; we have politicians, and politics are deemed impossible for a gentleman; the gentleman cultured, simple, hospitable, and kind, is of the dying generation; the soldier is simply on parade.\"\"Wow!\" said Ricketts, jingling his chips. \"They're off.\"\"Everything has conformed to business, everything has been made to pay. Art is now a respectable career—to whom? To the business man. Why? Because a profession that is paid $3,000 to $5,000 a portrait is no longer an art, but a blamed good business. The man who cooks up his novel according to the weakness of his public sells a hundred thousand copies. Dime novel? No; published by our most conservative publishers—one of our leading citizens. He has found out that scribbling is a new field of business. He has convinced the business man. He has made it pay.” ― Owen Johnson, Stover at Yale"},{"quote":"“In your temporary failure there is no evidence that you may not yet be a better scholar, and a more successful man in the great struggle of life, than many others, who have entered college more easily.” ― Abraham Lincoln"},{"quote":"“I used to think all that game playing was par for the course and even kind of exciting. It just felt logical to pursue a boy the same way I applied to college—by expending exorbitant time and energy showing what a great catch I am and what a perfect match we’d be, so that after a lengthy waiting period I might get accepted. But now the idea of reliving any version of that charade seems like hell.” ― Daria Snadowsky, Anatomy of a Single Girl"},{"quote":"“I couldn’t help but notice how hot he looked tonight with his strong build lining his t-shirt. He should never cover his beauty with clothes and such things. - Ariel” ― Victoria H. Smith, The Crimson Hunt"},{"quote":"“When he flashed that rockin’ smile of his again, I couldn’t help but think that me being cute was what might be crossing his mind. Then again, maybe he thought I was a dumbass. Either way, he smiled, which was good enough for me. - Ariel” ― Victoria H. Smith, The Crimson Hunt"},{"quote":"“He gazed deeply into my eyes. Placing his hand to my cheek, he caressed my skin with his fingertips. “Ariel, you have a strength that cannot be hindered by anything. A strength that I admire greatly.” - Luca” ― Victoria H. Smith, The Crimson Hunt"},{"quote":"“Once I've been told that college is fun, a mixture of education and pleasure. I really don't understand where the F did they brought this conclusion from.” ― Amjed Rajab"},{"quote":"“For a lack of education, a child's future may hold no fortune.” ― Dennis E. Adonis"},{"quote":"“...\"There’s really no way I can explain it to her without *still* sounding like scum,\" I complained to Sinter.\"The 'sympathy shack-up' doesn’t score many points,\" he agreed.*” ― Molly Ringle, Relatively Honest"},{"quote":"“What would be the natural thing? A man goes to college. He works as he wants to work, he plays as he wants to play, he exercises for the fun of the game, he makes friends where he wants to make them, he is held in by no fear of criticism above, for the class ahead of him has nothing to do with his standing in his own class. Everything he does has the one vital quality: it is spontaneous. That is the flame of youth itself. Now, what really exists?\"\"...I say our colleges to-day are business colleges—Yale more so, perhaps, because it is more sensitively American. Let's take up any side of our life here. Begin with athletics. What has become of the natural, spontaneous joy of contest? Instead you have one of the most perfectly organized business systems for achieving a required result—success. Football is driving, slavish work; there isn't one man in twenty who gets any real pleasure out of it. Professional baseball is not more rigorously disciplined and driven than our 'amateur' teams. Add the crew and the track. Play, the fun of the thing itself, doesn't exist; and why? Because we have made a business out of it all, and the college is scoured for material, just as drummers are sent out to bring in business.\"Take another case. A man has a knack at the banjo or guitar, or has a good voice. What is the spontaneous thing? To meet with other kindred spirits in informal gatherings in one another's rooms or at the fence, according to the whim of the moment. Instead what happens? You have our university musical clubs, thoroughly professional organizations. If you are material, you must get out and begin to work for them—coach with a professional coach, make the Apollo clubs, and, working on, some day in junior year reach the varsity organization and go out on a professional tour. Again an organization conceived on business lines.\"The same is true with the competition for our papers: the struggle for existence outside in a business world is not one whit more intense than the struggle to win out in the News or Lit competition. We are like a beef trust, with every by-product organized, down to the last possibility. You come to Yale—what is said to you? 'Be natural, be spontaneous, revel in a certain freedom, enjoy a leisure you'll never get again, browse around, give your imagination a chance, see every one, rub wits with every one, get to know yourself.'\"Is that what's said? No. What are you told, instead? 'Here are twenty great machines that need new bolts and wheels. Get out and work. Work harder than the next man, who is going to try to outwork you. And, in order to succeed, work at only one thing. You don't count—everything for the college.' Regan says the colleges don't represent the nation; I say they don't even represent the individual.” ― Owen Johnson, Stover at Yale"},{"quote":"“I was not use to that kind of hunger, even as a poor college student.” ― Julie Wenzel, Alone I Walk"}]
