[{"quote":"“The Seven Social Sins are: Wealth without work. Pleasure without conscience. Knowledge without character. Commerce without morality. Science without humanity. Worship without sacrifice. Politics without principle.From a sermon given by Frederick Lewis Donaldson in Westminster Abbey, London, on March 20, 1925.” ― Frederick Lewis Donaldson"},{"quote":"“How dreadful are the curses which Mohammedanism lays on its votaries! Besides the fanatical frenzy, which is as dangerous in a man as hydrophobia in a dog, there is this fearful fatalistic apathy. The effects are apparent in many countries. Improvident habits, slovenly systems of agriculture, sluggish methods of commerce, and insecurity of property exist wherever the followers of the Prophet rule or live. A degraded sensualism deprives this life of its grace and refinement; the next of its dignity and sanctity. The fact that in Mohammedan law every woman must belong to some man as his absolute property – either as a child, a wife, or a concubine – must delay the final extinction of slavery until the faith of Islam has ceased to be a great power among men. Thousands become the brave and loyal soldiers of the faith: all know how to die but the influence of the religion paralyses the social development of those who follow it. No stronger retrograde force exists in the world. Far from being moribund, Mohammedanism is a militant and proselytizing faith. It has already spread throughout Central Africa, raising fearless warriors at every step; and were it not that Christianity is sheltered in the strong arms of science, the science against which it had vainly struggled, the civilisation of modern Europe might fall, as fell the civilisation of ancient Rome.” ― Winston Churchill, The River War"},{"quote":"“The superior man understands what is right; the inferior man understands what will sell.” ― Confucius"},{"quote":"“Doing business without advertising is like winking at a girl in the dark. You know what you are doing but nobody else does.” ― Steuart Henderson Britt, Marketing Management and Administrative Action"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“She felt the cold blast from the sterile air conditioning on her bare arms and thighs, as she ambled down the center of the shopping complex's ground floor.The scene was a swirl of candy bright lights--the Victoria's Secret fuchsia signboard, signboards which lured one to purchase \"confidence,\" or \"sexual appeal,\" or whatever it was that was being advertised--the fluorescent lights in each store, contrasting with the shiny, black-tiled walls and eye-catching speckled marble tiles on the ground.One could lick the floor--the tiles were spotless, clean like the fake air she was breathing in, like the atoms and cells in her that were decaying in stale neglect.” ― Jess C Scott, Jack in the Box"},{"quote":"“Whomsoever controls the volume of money in any country is absolute master of all industry and commerce and when you realize that the entire system is very easily controlled, one way or another, by a few powerful men at the top, you will not have to be told how periods of inflation and depression originate.” ― James Garfield"},{"quote":"“A pickpocket is obviously a champion of private enterprise. But it would perhaps be an exaggeration to say that a pickpocket is a champion of private property. The point about Capitalism and Commercialism, as conducted of late, is that they have really preached the extension of business rather than the preservation of belongings; and have at best tried to disguise the pickpocket with some of the virtues of the pirate.” ― G.K. Chesterton, The Outline of Sanity"},{"quote":"“Trade has all the fascination of gambling without its moral guilt.” ― Walter Scott, Rob Roy"},{"quote":"“Privacy is something you can sell, but you can't buy it back.” ― Bob Dylan"},{"quote":"“In international commerce, India is an ancient country-(19th October, 1899)” ― Virchand Raghavji Gandhi"},{"quote":"“The neighborhood stores are an important part of a city child's life.” ― Betty Smith, A Tree Grows in Brooklyn"},{"quote":"“All the products of one period have something in common; the artists who illustrate the poetry of their generation are the same artists who are employed by the big financial houses. And nothing reminds me so much of the monthly parts of Notre-Dame de Paris, and of various books by Gérard de Nerval, that used to hang outside the grocer's door at Combray, than does, in its rectangular and flowery border, supported by recumbent river-gods, a 'personal share' in the Water Company.” ― Marcel Proust, In the Shadow of Young Girls in Flower"},{"quote":"“When you put yourself in the customer’s shoes and begin your dialog from there, an immediate connection develops that stems beyond basic commerce and encourages loyalty.” ― Steve Maraboli"},{"quote":"“Children, awkward, isolate, their bodies crammed to bursting with caffein and sugar and pop music and cologne and perfume and hairgel and pimple cream and growth hormone-treated hamburger meat and premature sex drives and costly, fleeting, violent sublimations. It's all part of the conspiracy . . . all of it trying to convince them that they're here to be trained for lives of adventure and glamor and heroism, when in fact they're here only to be trained for more of the same, for lives of plunking in the quarters, paying a premium for the never-ending series of shabby fantasies to come, the whole lifelong laser light show of glamorous degradation and habitual novelty and fun-loving murder and global isolation.” ― Alex Shakar, The Savage Girl"},{"quote":"“An ironic religion -- one that never claims to be absolutely true but only professes to be relatively beautiful, and never promises salvation but only proposes it as a salubrious idea. A century ago there were people who thought art was the thing that could fuse the terms of this seemingly insuperable oxymoron, and no doubt art is part of the formula. But maybe consumerism also has something to teach us about forging an ironic religion -- a lesson about learning to choose, about learning the power and consequences, for good or ill, of our ever-expanding palette of choices. Perhaps . . . the day will come when the true ironic religion is found, the day when humanity is filled with enough love and imagination and responsibility to become its own god and make a paradise of its world, a paradise of all the right choices.” ― Alex Shakar, The Savage Girl"},{"quote":"“You can get anything you want from anywhere in the world at a bargain price, but don't [whatever you do] expect to understand how it was made or how it got to you.” ― Ed Conway, Material World: The Six Raw Materials That Shape Modern Civilization"},{"quote":"“That's the positive aspect of trade I suppose. The world gets stirred up together. That's about as much as I have to say for it.” ― Isabel Hoving, The Dream Merchant"},{"quote":"“Why pay someone else ten dollars for one item that does two things, when for five dollars apiece I can sell you two items that each does one thing? It’s the same price, and the same things, but it’s not the same thing.” ― Jarod Kintz, There are Two Typos of People in This World: Those Who Can Edit and Those Who Can't"},{"quote":"“Commerce is a cure for the most destructive prejudices; for it is almost a general rule, that wherever we find agreeable manners, there commerce flourishes; and that wherever there is commerce, there we meet with agreeable manners.” ― Montesquieu, The Spirit of the Laws"},{"quote":"“It's clear: North Korea is a total sham. Officially, it outlaws private business, but in the shadows it lets it thrive. Since there are hardly any markets, merchants warehouse their Chinese products at home and sell them to their neighbors and acquaintances. This farce is the only thing preventing the bankruptcy of the North Korean state and the pauperization of its citizenry.” ― Kang Chol-Hwan, The Aquariums of Pyongyang: Ten Years in the North Korean Gulag"},{"quote":"“There was nothing he needed or wished to buy; but he liked to see the display of goods, any goods, objects made by men, to be used by men. He enjoyed the sight of a prosperous street;” ― Ayn Rand"},{"quote":"“...the difference between honest and dishonest commerce is that when an honest man or woman of business ruins someone, they don’t have the courtesy to cut their throat to finish the affair.” ― Scott Lynch, The Lies of Locke Lamora"},{"quote":"“Scotland's passage from a mainly pastoral and agrarian society to a commercial and industrial one was brutal, rapid and relentless. In that transition, an entire peasant class, the cottars - perhaps as much as half of the rural population - was lost forever. They and tens of thousands of even poorer people were forced off the land across the Lowlands, Highlands and islands. They ended up in towns, cities and planned villages, they worked in mills, mines, quarries and iron works, or they emigrated to other parts of the world, or became soldiers, sailors, engineers, administrators and merchants in the service of the British Empire or the companies that thrived under its bellicose protection. Many prospered, many did not.” ― James Robertson, Irish Pages, Vol. 12, No. 2: Scotland"},{"quote":"“The ability to free oneself from the common tradition, a sort of liberal enlightenment, seems likely to be the most suitable basis for such a business man’s success. And today that is generally precisely the case. Any relationship between religious beliefs and conduct is generally absent, and where any exists, at least in Germany, it tends to be of the negative sort. The people filled with the spirit of capitalism today tend to be indifferent, if not hostile, to the Church. The thought of the pious boredom of paradise has little attraction for their active natures; religion appears to them as a means of drawing people away from labor in this world. If you ask them what is the meaning of their restless activity, why they are never satisfied with what they have, thus appearing so senseless to any purely worldly view of life, they would perhaps give the answer, if they know any at all: “to provide for my children and grandchildren.” But more often and, since that motive is not peculiar to them, but was just as effective for the traditionalist, more correctly, simply: that business with its continuous work has become a necessary part of their lives. That is in fact the only possible motivation, but it at the same time expresses what is, seen from the viewpoint of personal happiness, so irrational about this sort of life, where a man exists for the sake of his business, instead of the reverse.” ― Max Weber, The Protestant Ethic and the Spirit of Capitalism"},{"quote":"“For the sake of wealth there're 7 types of commerce: perfume trade, moneylending, cow related trade & activities, serving known customers (because he wouldn't use foul language), false pricing of products (buying at less & selling at higher prices), underweighing, importing.Of all saleable products, perfume trade is the best, which is incomparable to gold etc; and which can be sold for 100 times its cost” ― Vishnu Sharma, Panchatantra"},{"quote":"“Business is war disguised as commerce.” ― Hadrian"},{"quote":"“Marketing is not communication - it is psychological warfare.” ― Hadrian"},{"quote":"“Obscurity is death. Visibility is survival.” ― Hadrian"},{"quote":"“Marketing is not communication - it is psychological domination.” ― Hadrian"},{"quote":"“For their never-ending endeavours to obtain or retain wealth, countries desperately need companies, because they—unlike most human beings—have the means of production, and human beings, because they—unlike all companies—have the means of reproduction.” ― Mokokoma Mokhonoana, The Use and Misuse of Children"},{"quote":"“If you'd like to gain a new understanding of commerce, get into gardening.” ― Hendrith Vanlon Smith Jr, CEO of Mayflower-Plymouth"},{"quote":"“Art is the expression of human creativity and imagination, which produces works to be appreciated primarily for their beauty. It’s emotional.Commerce is the activity of buying and selling, particularly on a grand scale. It’s black and white: either a purchase is made or it isn’t. It’s practical.” ― Alan Philips, The Age of Ideas: Unlock Your Creative Potential"},{"quote":"“Restaurant, hey. That's what I've got. Whole goddam country lives selling hot dogs to each other.” ― James M. Cain, The Postman Always Rings Twice"},{"quote":"“Use the data from the clients you already have to help you find new clients just like them.” ― Hendrith Vanlon Smith Jr, CEO of Mayflower-Plymouth"},{"quote":"“Today it was commerce that Europe valued and it was the businessmen who, having exploited what the scientists and thechnologits had done for the world, now reaped the rewards.” ― Stephen Fry, Making History"},{"quote":"“Paying coin to the usurper is proof of naught but treason.” ― George R.R. Martin, Fire & Blood"},{"quote":"“... I was disturbed by how many of my classmates disliked Thoreau, railed against him even, as if he (who claimed never to have learned anything of value from an old person) was an enemy and not a friend. His scorn of commerce--invigorating to me--nettled a lot of the more vocal kids in Honors English. \"Yeah, right,\" shouted an obnoxious boy whose hair was gelled and combed stiff like a Dragon Ball Z character--\"some kind of world it would be if every-body just dropped out and moped around in the woods--” ― Donna Tartt, The Goldfinch"},{"quote":"“When only one party makes a profit that's robbery when all parties make profit that's business.” ― Amit Kalantri, Wealth of Words"},{"quote":"“For most of the period following the fall of Rome, the adherents of a powerful new monotheistic religion dominated medieval long distance commerce as completely as the West dominates such commerce today; the legacy of that former dominance is still all too visible.” ― William J. Bernstein, A Splendid Exchange: How Trade Shaped the World"},{"quote":"“The blessed lives of model-types, banking on the envy of the unwashed populace to earn their keep.” ― Mahvesh Murad, The Djinn Falls in Love & Other Stories"},{"quote":"“I go out most nights. There's always something new to find. Always something unneeded that I need.” ― Kirsty Logan, The Djinn Falls in Love & Other Stories"},{"quote":"“Very few things make a fool feel smart better than negotiating.” ― Mokokoma Mokhonoana"},{"quote":"“Sometimes money finds its own expression,” Jake said. “Like water flowing through a canyon, only the walls are laws and regulations. It follows the path of least resistance and leaves the landscape altered behind it.” ― E.F. Coleman, immechanica"},{"quote":"“People in markets find a way of getting down to the essentials of I have, you want; you have, I want.” ― Audre Lorde, Sister Outsider: Essays and Speeches"},{"quote":"“... cooptation of the rhetoric of beauty, morality and duty into the realm of commercial life set in train the development of other rhetorics designed to sell growing numbers of products that promised both surface change and inner transformation.” ― Elaine Stratford, Home, Nature, and the Feminine Ideal: Geographies of the Interior and of Empire"},{"quote":"“it isn’t just talent which is mobile today, the work itself is highly mobile too.” ― Gyan Nagpal, The Future Ready Organization: How Dynamic Capability Management Is Reshaping the Modern Workplace"},{"quote":"“Helen recognised that she, and Edward, and Dorothy herself, for that matter, were not as others are when it came to possession. She seldom wanted anything. Edward was the same. Her mother had hated spending money, not out of parsimony but laziness. Whatever it was in the make-up of most people that responds to the sight of goods for sale had been left out, in their case.” ― Penelope Lively, Passing On"},{"quote":"“Economics is a knack of managing unlimited demand with limited supply.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Nobody fails as often as an economist, a meteorologist, and a fortuneteller.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Statistics surpasses sentiments.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Economics qualifies the test of education but fails the test of emotions.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Economics is not as simple as philosophy and not as complex as mathematics.” ― Amit Kalantri, Wealth of Words"},{"quote":"“The efficient execution of industrial and administrative activities by the people promises an enduring economy for the province.” ― Amit Kalantri, Wealth of Words"},{"quote":"“An entrepreneur is more useful and valuable to the economy than an economist.” ― Amit Kalantri, Wealth of Words"},{"quote":"“An economist doesn't know how to make money, but he claims to know what to do with it once someone else makes money.” ― Amit Kalantri, Wealth of Words"},{"quote":"“An economy where even a few people cannot afford a snack, shelter, and survival is a failed economy.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Instead of casting doubt, encourage and support your friends when they open a business or start a new job!” ― Jason Langella"},{"quote":"“I can picture purchasing a product, such as a vehicle, a bicycle, or even grocery items, and seeing the emissions to produce the item and transport it to its location on its product tag, or by scanning its bar code. Items with top quartile emissions or high ESG performance for the category may have a different color-coded tag. The price tag will become a product tag and information about the item and the producer would be available in its online description,” ― Paul Pierroz, The Purpose-Driven Marketing Handbook: How to Discover Your Impact and Communicate Your Business Sustainability Story to Grow Sales, Retain Talent, and Attract Investors"},{"quote":"“Returning to Jamaica, he had the sense of re-entering a place much less likely to alter in the coming years. Year in, year out, the cane fields produced their riches, the gangs swung their way through them, slaves were brought, seasoned, used up, replaced. Planters would go on making improvements to their great houses, to methods of production, and yes, to the conditions in which their slaves lived and worked, because it was in their interest to do so. But fundamentally the structure of life and of society did not change.” ― James Robertson, Joseph Knight"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“no concept of danger, reality, flow or compassion. you can feel the despair escaping from their machines, their lives as hopeless and as numbed as yours.” ― Charles Bukowski, Sifting Through the Madness for the Word, the Line, the Way: New Poems"},{"quote":"“Most women sell sex; most of them just don’t take cash (nor do they each sell to more than one ‘client’ at a time).” ― Mokokoma Mokhonoana"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“Today's partners can be your competitors tomorrow. And today's competitors can be your partners tomorrow.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“The sunset was a massive canvas of gold and orange, green and rose, gray and indigo and blue. It reminded him of beaches on the North American west coast, except there were no vendors clogging the place and no advertising drones muttering about the joys of commerce.” ― James S.A. Corey, Cibola Burn"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“We live in an age where corporations are people and employees are not.” ― Clifford Cohen"},{"quote":"“The oldest profession [prostitution] is the most honest, for it exposes the bare bones of what civilization is all about. It's the root of all professions.” ― Daniel Suelo, The Man Who Quit Money"},{"quote":"“THINGS MONEY CAN'T BUYMannersMoralsRespectTrustPatienceClassIntegrityLoveCharacterCommon sense” ― Hyacil Han, Dropshipping Ultimate Guide: The Expeditive and Accessible Scheme to Earn a Substantial Revenue at Home"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"},{"quote":"“Just when you see a kid selling a mascot,If you don't buy it because he winks, Not only that will be considered a \"boycott\",Xenophobically, it will also be a jinx!” ― Ana Claudia Antunes, ACross Tic"},{"quote":"“Quality is the best business plan.” ― Hyacil Han, Dropshipping Ultimate Guide: The Expeditive and Accessible Scheme to Earn a Substantial Revenue at Home"},{"quote":"“There is no elevator to success to have to take the stairs.” ― Hyacil Han, Dropshipping Ultimate Guide: The Expeditive and Accessible Scheme to Earn a Substantial Revenue at Home"},{"quote":"“Такое уж это дело – коммерция. Что с него спросишь? Человек хочет… Видишь, вывеска у дороги? «Обслуживание путешественников. По вторникам сервируется завтрак. Отель Колмадо». А-а, наше вам с кисточкой! Это обслуживание путешественников! Знаешь, мне один рассказывал. Пришел он на собрание, где заседают разные дельцы, и преподнес им всем такую историю: я, говорит, был тогда еще мальчишкой, вот отец как-то вывел телку и говорит мне: отведи к быку, ее надо обслужить. Я отвел. И с тех пор как услышу про обслуживание, так думаю – кто же тут кого?(«Гроздья гнева»)” ― John Steinbeck, The Grapes of Wrath"},{"quote":"“When truth and honesty is successfully intertwined into the business world of a nation, the result is a boost in commerce.” ― Sunday Adelaja"},{"quote":"“Knowledge was scattered treasure, education organized it into art, commerce and science.” ― Amit Kalantri"},{"quote":"“- J’aidais justement Ghezumi et Kassergh à bâter l’hypocras : du vin au miel avec de la cannelle et du gingembre mélangé à du musc, de l’ambre gris, de la cardamome, du poivre long, de la graine de paradis et de la fleur de muscade. On ne trouve cette variété qu’à Chaz.- J’ignorais que les sujets de Sahr’Lim consommaient l’hypocras, avoua le hérisson géant.- Ha ! Certes non, nous n’en buvons pas ! le détrompa Dazhirk d’un ton affable. Mais cela se vend bien dans l’empire de Tawag, demandez donc à votre compagne.- Effectivement les gens de notre empire en sont friands, affirma Selamawit, et il arrive aussi que les sujets du royaume de Kambu l’achètent quand ils s’approchent de nos frontières.- C’est pourquoi j’en transporte souvent, cela assure déjà les frais de caravane. Mais c’est très délicat au départ, confia Dazhirk avec un regard soucieux vers les lézards géants qui acceptaient docilement leur chargement.- Comment cela ? questionna Nyssa.- Il faut soigneusement sangler les lézards, jeune damoiselle, répondit-il après un silence pendant lequel il scruta attentivement la jeune fille. Ni trop lâche, ni trop serré avec ces reptiles dont le corps se gonfle une fois chargé. Puis, il faut équilibrer très exactement les charges, les envelopper dans une toile épaisse qui les protège de la lumière et de la chaleur, enfin ficeler correctement le tout. Cela fait, on peut alors accomplir des journées entières de voyage sans crainte de semer tout le chargement au long du parcours ou de le renverser, ce qui casserait les récipients et nous ferait perdre notre investissement.” ― Cyrille Mendes, Les Épieurs d'Ombre"},{"quote":"“Your people sell the weapons. My people use them.” ― Henry V. O'Neil, CHOP Line: The Sim War: Book Four"},{"quote":"“The most successful people started from NOTHING... they didn't wait for the opportunity to knock but created the opportunity on their own... worked hard and made history.” ― Hyacil Han"},{"quote":"“It doesn't matter what others are doingIt matters what YOU are doing.” ― Hyacil Han, Dropshipping Ultimate Guide: The Expeditive and Accessible Scheme to Earn a Substantial Revenue at Home"},{"quote":"“Don't find customer for your products,find products for your customers.” ― Hyacil Han, Dropshipping Ultimate Guide: The Expeditive and Accessible Scheme to Earn a Substantial Revenue at Home"},{"quote":"“La classe des ouvriers modernes, qui ne vivent qu'à la condition de trouver du travail, et qui n'en trouvent plus dès que leur travail cesse d'agrandir le capital. Les ouvriers, contraints de se vendre au jour le jour, sont une marchandise comme tout autre article de commerce ; ils subissent, par conséquent, toutes les vicissitudes de la concurrence, toutes fluctuations du marché.” ― Karl Marx, The Communist Manifesto"},{"quote":"“...the average Frenchman would shrug, as if to say: \"These notions of yours are all very fascinating, no doubt, but we make a decent living. Nobody has ulcers. I have time to work on my monograph about Balzac, and my foreman enjoys his espaliered pear trees. I think as a matter of fact, we do not wish to make the changes that you suggest.” ― Julia Child, My Life in France"},{"quote":"“When the state itself is held to the same moral standards as everyone else, it dies. And that's a wonderful thing.” ― Jeffrey Tucker"},{"quote":"“I have heard your orators speak on many questions. One among them the so-called vital question of money which is above all things the most coveted commodity but I, as a Jainist, in the name of my countrymen and of my country, would offer you as the medium of the most perfect exchange between us, henceforth and forever, the indestructible, the unchangeable, the universal currency of good will and peace, and this, my brothers and sisters, is a currency that is not interchangeable with silver and gold, it is a currency of the heart, of the good life, of the highest estate on the earth.” ― Virchand Raghavji Gandhi"},{"quote":"“The only grown-up other than Jacob who ever came into his schoolroom was Eli Willard.School was in session one day when the Connecticut itinerant reappeared after long absence, bringing Jacob's glass and other merchandise. Jacob seized him and presented him to the class. 'Boys and girls, this specimen here is a Peddler. You don't see them very often. They migrate, like the geese flying over. This one comes maybe once a year, like Christmas. But he ain't dependable, like Christmas. He's dependable like rainfall. A Peddler is a feller who has got things you ain't got, and he'll give 'em to ye, and then after you're glad you got 'em he'll tell ye how much cash money you owe him fer 'em. If you ain't got cash money, he'll give credit, and collect the next time he comes 'round, and meantime you work hard to git the money someway so's ye kin pay him off. Look at his eyes. Notice how they are kinder shiftly-like. Now, class, the first question is: why is this feller's eyes shiftly-like?” ― Donald Harington, The Architecture of the Arkansas Ozarks"},{"quote":"“When forging money, I had always salved my conscience by concluding that I was merely extending the lie of commerce.” ― Richard Flanagan, Gould's Book of Fish: A Novel in Twelve Fish"},{"quote":"“...Merchant's Ware, the city most people thought of as the real city. Normally its narrow streets were crowded with stalls, and people from all over the Carpet. They'd each be trying to cheat one another in that open-and-aboveboard way known as \"doing business.” ― Terry Pratchett, The Carpet People"},{"quote":"“It is honor that makes commerce possible, dear brother. And the law courts, when men lack it.” ― Edward Cline"},{"quote":"“Commerce is the new green. Spend your money where your beliefs are.” ― S. Kelley Harrell"},{"quote":"“In no time we roll into Sedona proper and find a Cirlce K. The place is full of men with silver ponytails and ratty sandals, old hippie women in loose flowing pants grinning vacantly as they molest the produce, and I am reminded of my old neighborhood in San Francisco. We buy enough fruit and bread and jerked meat for three days, as well as a couple spare handlers of SoCo and a big bottle of cheap Chianti for me. As I'm paying I wonder at how we cling so relentlessly to the little conventions like commerce, as though they can save us.” ― Ron Currie Jr., Everything Matters!"},{"quote":"“Most people don't know what they're blowing anyway -- they know what they've been buying. You offer them pure and they won't meet your price -- they say it's shit because it doesn't look like what they're used to. So you hit it with some borax and they pay your price. But that takes time. After you unload most of it at an honest price, then you can fuck around with what's left for the sucker trade.” ― Robert Sabbag, Snowblind: A Brief Career in the Cocaine Trade"},{"quote":"“Once he traveled to a village to purchase a large rice harvest, but when he arrived the rice had already been sold to another tradesman. Nevertheless, Siddhartha remained in this village for several days; he arranged a feast for the peasants, distributed copper coins among their children, helped celebrate a marriage, and returned from his trip in the best of spirits.Kamaswami reproached him for not having returned home at once, saying he had wasted money and time.Siddhartha answered, \"Do not scold me, dear friend! Never has anything been achieved by scolding. If there are losses, let me bear them. I am very pleased with this journey I made the acquaintance of many different people, a Brahmin befriended me, children rode on my knees, peasants showed me their fields, and no one took me for a tradesman.\"\"How very lovely!\" Kamaswami cried out indignantly. \"But in fact a tradesman is just what you are! Or did you undertake this journey solely for your own pleasure?\"\"Certainly.\" Siddhartha laughed. \"Certainly I undertook the journey for my pleasure. Why else? I got to know new people and regions, enjoyed kindness and trust, found friendship. You see, dear friend, had I been Kamaswami, I'd have hurried home in bad spirits the moment I saw my purchase foiled, and indeed money and time would have been lost. But by staying on as I did, I had some agreeable days, learned things, and enjoyed pleasures, harming neither myself nor others with haste and bad spirits. And if ever I should return to this place, perhaps to buy some future harvest or for whatever other purpose, I shall be greeted happily and in friendship by friendly people and I shall praise myself for not having displayed haste and displeasure on my first visit. So be content, friend, and do not harm yourself by scolding! When the day arrives when you see that this Siddhartha is bringing you harm, just say the word and Siddhartha will be on his way. But until that day, let us be satisfied with each other.” ― Hermann Hesse, Siddhartha"},{"quote":"“There is no commerce without community. And there is no community without commerce” ― Michele Jennae"},{"quote":"“Designing posters, for me, is not only a commercial pursuit but also a philosophical endeavor.” ― Fang Chen"},{"quote":"“Commerce they say, encourages the bourgeois virtues of thrift, hard work,self -reliance,and self discipline.” ― Gurcharan Das, India Unbound: The Social and Economic Revolution from Independence to the Global Information Age"},{"quote":"“The principle victims of British policies are Unpeople—those whose lives are deemed worthless, expendable in the pursuit of power and commercial gain. They are the modern equivalent of the ‘savages’ of colonial days, who could be mown down by British guns in virtual secrecy, or else in circumstances where the perpetrators were hailed as the upholders of civilisation.” ― Mark Curtis, Unpeople: Britain's Secret Human Rights Abuses"},{"quote":"“I thought buying at the local market would be an excellent way to build positive relationships with the local villagers.” ― Eric Greitens, The Heart and the Fist: The Education of a Humanitarian, the Making of a Navy SEAL"}]
