[{"quote":"“There is strange comfort in knowing that no matter what happens today, the Sun will rise again tomorrow.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Some people are born with tornadoes in their lives, but constellations in their eyes. Other people are born with stars at their feet, but their souls are lost at sea.” ― Nikita Gill"},{"quote":"“The struggles we endure today will be the ‘good old days’ we laugh about tomorrow.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Dare to believe in the reality of your assumptionand watch the world play its partrelative to to its fulfillment.” ― Neville Goddard"},{"quote":"“It's in those quiet little towns, at the edge of the world, that you will find the salt of the earth people who make you feel right at home.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Life's trials will test you, and shape you, but don’t let them change who you are.”~ Aaron Lauritsen, ‘100 Days Drive” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“True friends don't come with conditions.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Without struggle, success has no value.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“From this point forward, you don’t even know how to quit in life.”~ Aaron Lauritsen, ‘100 Days Drive” ― Aaron Lauritsen"},{"quote":"“If your dream is a big dream, and if you want your life to work on the high level that you say you do, there's no way around doing the work it takes to get you there.” ― Joyce Chapman"},{"quote":"“At some point, you just gotta forgive the past, your happiness hinges on it.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Those who achieve the extraordinary are usually the most ordinary because they have nothing to prove to anybody. Be Humble.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“The problem isn’t that I think so highly of myself. It is just that you think so little of yourself. Live life BIG, BOLD and OUT LOUD!” ― Shannon L. Alder"},{"quote":"“When the actions becomes frequent than the words, success becomes heavier than the dreams. Do more, say less.” ― Israelmore Ayivor"},{"quote":"“Explore, Experience, Then Push Beyond.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“When you optimize your talents very well, you can pick money from people's pockets and nobody will ever get the guts to call you a thief.” ― Israelmore Ayivor"},{"quote":"“That's what we storytellers do. We restore order with imagination. We instill hope again and again and again.” ― Kelly Marcel & Sue Smith"},{"quote":"“There's more to a person than flesh. Judge others by the sum of their soul and you'll see that beauty is a force of light that radiates from the inside out.” ― Aaron Lauritsen"},{"quote":"“If you didn't earn something, it's not worth flaunting.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“If you want to be big, you have to start behaving big.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“The possibility of the dream gives strength.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“The excitement of dreams coming true is beyond the description of words.” ― Lailah Gifty Akita"},{"quote":"“Building bridges is the best defence against ignorance.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Other people don’t get to tell you what you can have!Someone else doesn’t get to tell you who you can be!The world doesn’t get to decide what you can try.You are the only one who can make that decision.” ― Rachel Hollis, Girl, Stop Apologizing: A Shame-Free Plan for Embracing and Achieving Your Goals"},{"quote":"“Great leaders get people to admit the truth because they know that dreams are buried under the lies they tell themselves, in order to feel okay with giving up.” ― Shannon L. Alder"},{"quote":"“The sky is NOT the limit. Beyond the universe is.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“There’s no justifiable negligence of a dream. None. Never.” ― Ayura Ayira, Sidikat"},{"quote":"“You have to dream before your dreams can come true.” ― A. P. J. Abdul Kalam"},{"quote":"“This is how we dreamed. Moonlight in our mouths, love on our lips and summer in our skies.” ― Marie-Kristin Hofmann, Remember the wild girl"},{"quote":"“Brighten your picture! Refuse to be blurred; agree to be bright!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“Life is a dream. We wake up when we die” ― Bangambiki Habyarimana, The Great Pearl of Wisdom"},{"quote":"“Step out of the crowd of average people. Enter that game and change the values on the scoreboard.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“It’s the ‘everyday’ experiences we encounter along the journey to who we wanna be that will define who we are when we get there.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“When a dream is fulfilled, it is always a glorious feeling.” ― Lailah Gifty Akita"},{"quote":"“He who has the audacity to stop you from dreaming is he who had given you the imaginations to think, but not those who watch you as you explore the dreams!” ― Israelmore Ayivor"},{"quote":"“Having a dream is like having sunshine. Without it, you cannot see as clear. With it, your world shines. Have a dream, and the light will fill your eyes with hope.” ― J.R. Rim"},{"quote":"“You got the eggs in you; the world is fully ready to celebrate the chicks out of your laying labour. Never give up. Go and breed! Go and breed great dreams.” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“You can go as far as you dream, think and imagine.” ― Lailah Gifty Akita"},{"quote":"“Dreams are fulfilled at the right.Be patient and wait for the fulfillment of your dreams.” ― Lailah Gifty Akita"},{"quote":"“If your thoughts are as tall as the height of your ceiling, you can’t fly above your room.” ― Israelmore Ayivor, You Can Rise"},{"quote":"“The will to dream, the courage to act and the hope to win are the stuffs that make life meaningful! Create the life you wish to live and live it fully!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Whatever you dream of, there will be fulfillment.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Keep your cherished photos of your destiny at the fore-front of your mind. No one gets the gut to make them blurred. Always think about it; dream about it and work it out!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“With great passion, observe every details of the sacred journey.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Vin was coming to realize that her old goal in life - simply staying alive - was uninspired. There was so much more she could be doing.” ― Brandon Sanderson, Mistborn: The Final Empire"},{"quote":"“The act of writing down your goals solidifies your commitment to your dreams. When you review them, you refine your focus, energize your efforts, and awaken your inner drive. Goals are not merely tasks to complete; they are stepping stones to a life of purpose and meaning.” ― Linsey Mills, Currency of Conversations: The Talk You've Been Waiting For About Money"},{"quote":"“There is no victory in living a life of what-ifs that are fuelled by fear. Dream big and work towards those dreams until they manifest.” ― Gift Gugu Mona, Exploring the Explosive Power of Big Dreams"},{"quote":"“Those who call you mad will one day worship you.” ― Abhijit Naskar, Mad About Humans: World Maker's Almanac"},{"quote":"“In the face of relentless challenges that test the very core of human strength, I’ve emerged, not unscathed, but enduring. Each day I choose to persevere, transforming despair into determination and self-loathing into a quest for moments of beauty amidst chaos. It’s those fleeting joys, those breaths of peace, that remind us of life’s worth. I’ve faced near-death, yet here I am, dreaming boldly and planning grandly because life is fleeting. So let’s embrace our struggles, celebrate our victories, and never shy away from our dreams. Life may be harsh, but our spirit is unbreakable. Live fully, love fiercely, and never apologize for seeking the light in the darkest of times.” ― Jonathan Harnisch"},{"quote":"“Every challenge you face is an opportunity to grow. Embrace it.” ― Glody Kikonga, MENTAL TOUGHNESS: Unbreakable Mind"},{"quote":"“No backing, only backbone.No benefactor, only brain power.No industry, only integrity.No contract, only character.” ― Abhijit Naskar, Neurosonnets: The Naskar Art of Neuroscience"},{"quote":"“A distracted mind cannot build a disciplined life.” ― Glody Kikonga, MENTAL TOUGHNESS: Unbreakable Mind"},{"quote":"“If you have a dream, go for it! Will it be hard? Not as hard as spending the rest of your life telling yourself why you shouldn't.” ― Pamela Storch"},{"quote":"“Jackfruit dreams don't grow from berry seeds,Great outcomes rise from daring deeds. Water your faith, let patience shine,And success will bloom in its own time.” ― Srinivas Mishra"},{"quote":"“Nobody offered me a seat at their table, so I built my own universe. Now they are all pilgrims in my universe.” ― Abhijit Naskar, The God Sonnets: Naskar Art of Theology"},{"quote":"“Dream big, study smart, and let the world become your classroom.” ― Clear view"},{"quote":"“The people telling you to play it safe already gave up on their dreams.” ― Joseph C. Kunz Jr., Money's Dirty Little Secrets: How to Break the Rules, Get Filthy Rich, and Laugh All the Way to the Bank"},{"quote":"“Cut the wings of a dove at birth, and it'll spend its life crawling like vermin.” ― Abhijit Naskar, Kral Fakir: When Calls The Kainat"},{"quote":"“The size of your dream will determine the size of your success.” ― Onipede Ayomide"},{"quote":"“Dream big; let your aspirations be everything.” ― Mouloud Benzadi"},{"quote":"“I got dreams so big they'd scare some people.” ― Dolly Parton, Behind the Seams: My Life in Rhinestones"},{"quote":"“You were thinking about how suburbs are perfect cradles for dreaming: they practically beg you to imagine another life, one lived at a burning voltage. The dreaming hidden in this place — murmuring beneath the comfort of the uniform gardens in their perfect rows, the mowed lawns, each driveway that bit too small for the two large cars — you couldn't have become what you are if you hadn't always been from this.” ― Colin Walsh, Kala"},{"quote":"“Every time you try, even when you fall,you get up stronger, ready to stand tall.” ― Gel See, With Love, From Mom: The Journey of Dreams"},{"quote":"“But I think if your dreams are small they can get lost, like trying to find a needle in a haystack...When a dream is big, you can see it better and hold on to it.\" -Ruthie” ― Ruth Behar, Lucky Broken Girl"},{"quote":"“You were thinking about how suburbs are perfect cradles for dreaming: they practically beg you to imagine another life, one lived at a burning voltage. The dreaming hidden in this place - murmuring beneath the comfort of the uniform gardens in their perfect rows, the mowed lawns, each driveway that bit too small for the two large cars you couldn't have become what you are if you hadn't always been from this.” ― Colin Walsh, Kala"},{"quote":"“Dreaming of hugs and your happy sight,Your first hello made everything right.No guidebook needed, just me and you,We'd make our own story, just us two.” ― Gel See, With Love, From Mom: The Journey of Dreams"},{"quote":"“In a world so big, you can reach the sky,You can be anything, just give it a try!Climb every mountain, sail every sea,Be who you want to be, happy and free.” ― Gel See, With Love, From Mom: The Journey of Dreams"},{"quote":"“Dream so big it scares you.” ― Brian Reese"},{"quote":"“Es justamente la posibilidad de realizar un sueño lo que torna la vida interesante.” ― Paulo Coelho, The Alchemist: A Graphic Novel"},{"quote":"“Embracing discomfortis a great way to grow. Growth rarely happens in comfort zones.” ― Christine Willson, The Screen Saver"},{"quote":"“Embracing discomfort is a great way to grow. Growth rarely happens in comfort zones.” ― Christine Willson"},{"quote":"“Remember, O Mighty Soldiers, destiny has no power over you, for you are the mothers and fathers of destiny.” ― Abhijit Naskar, Hurricane Humans: Give me accountability, I'll give you peace"},{"quote":"“Goals are the secret agents of your dreams; equip your mind, and watch as it attracts the covert missions of success into your life.” ― Linsey Mills, Your Business Venture: The Prep. The Pitch. The Funding."},{"quote":"“If you really wanna live big,don't ask yourself,where'll you be in five years;ask instead,where'll you be in 500 years?” ― Abhijit Naskar, Iman Insaniyat, Mazhab Muhabbat: Pani, Agua, Water, It's All One"},{"quote":"“Dream big, and one day you shall fly. Kill the dream, and you shall never see the other side of the sky.\" (Till There Are Stars by Bob Bello)” ― Bob Bello"},{"quote":"“Better abandon citizenship than abandon your dream.” ― Abhijit Naskar, Visvavatan: 100 Demilitarization Sonnets"},{"quote":"“Dream big, work hard and start pursuing your success every single day.” ― Onipede Ayomide"},{"quote":"“It is good to be a dreamer, but you can only achieve your dream and change the world with hard work.” ― Onipede Ayomide"},{"quote":"“People think dreams are not real just because they are not for weak people. Only strong people work for their dream in order to make it a reality.” ― Onipede Ayomide"},{"quote":"“This is the stage in your life where it’s critical to stay away from people who doubt the possibility of living a life of freedom. Let them ruminate on their own limited beliefs. You have much more to look forward to.” ― Robin S. Baker"},{"quote":"“Don't - just don't! If you let it, the world'll coerce you into believing, you're worth no more than the content of your pocket.” ― Abhijit Naskar, World War Human: 100 New Earthling Sonnets"},{"quote":"“Innovation's current stirs the soul and ignites imagination, propelling us beyond the horizon of what's possible. In the digital heartbeat, I found my life's rhythm.” ― Emmanuel Apetsi"},{"quote":"“Survival is a dance in shadows; win by being unseen until the moment is yours.” ― Emmanuel Apetsi"},{"quote":"“Build a legacy that outlives the world’s fleeting moments; make your mark unforgettable.” ― Emmanuel Apetsi"},{"quote":"“Your dream is your duty.” ― Abhijit Naskar, Generacion Justicia: Día de Los Vivos, Abigitano 2"},{"quote":"“Analyze like a scientist, plot like a politician, execute like a soldier. Don't expose your faculties, unless absolutely necessary - better sober pretending drunk, than drunk pretending sober.” ― Abhijit Naskar, Visvavictor: Kanima Akiyor Kainat"},{"quote":"“Your dream is your duty, it's your right. Let no mediocrity dim your ambitious light.” ― Abhijit Naskar, Little Planet on The Prairie: Dunya Benim, Sorumluluk Benim"},{"quote":"“Goals are the foundation of every meaningful achievement. Writing them down is not merely a task; it’s a declaration of your intent to pursue a better version of yourself. When you review them regularly, you remind yourself of what truly matters, keeping your focus sharp and your determination alive. Goals guide your steps and transform your dreams into actionable plans.” ― Linsey Mills, Your Business Venture: The Prep. The Pitch. The Funding."},{"quote":"“Your goals are the blueprint for your future self. Writing them down makes them visible, and reviewing them regularly keeps them alive in your mind and heart. This simple yet profound practice connects you with your purpose, helping you navigate challenges and seize opportunities with clarity and confidence.” ― Linsey Mills, Currency of Conversations: The Talk You've Been Waiting For About Money"},{"quote":"“Impossible means that you just didn’t do it yet.” ― Frank Sonnenberg, The Path to a Meaningful Life"},{"quote":"“Only you can fulfil your dreams, only you can make your dreams your reality, because only you really know what your dreams are.” ― Annie Chopra, Sayings For A Good Life"},{"quote":"“BIG THINKERS OFTEN DO BIG THINGS. SMALL THINKERS NEVER DO BIG THINGS.” ― Karen Blumenthal, Steve Jobs: The Man Who Thought Different: A Biography"},{"quote":"“Dear Daughter,Revolutionise your life. Rise and cease looking down on yourself. You have what it takes to dream big and manifest big dreams. Do it. Do it now. Do not wait for tomorrow. The clock is ticking.” ― Gift Gugu Mona , Dear Daughter: Short and Sweet Messages for a Queen"},{"quote":"“The sky lights up with fireworks when you follow your dreams.” ― Avijeet Das"},{"quote":"“Don't measure your dream by sense or logic. If your dream is making sense, it's not really a dream.” ― Hiral Nagda"},{"quote":"“Outside forces will always be out of your control. One thing you can control is how you choose to live. If you wake up fearful of every bad thing that might happen, you miss out on the good. Death will come for us all one day. Worrying about tomorrow only accomplishes ruining today.” ― Kerri Maniscalco, Capturing the Devil"},{"quote":"“Catching your big dream, touching it by hand is not an easy thing like catching fish, you have to give your years, not hours or whole day!” ― Mehmet Murat ildan"},{"quote":"“What others think means nothing in the pursuit of your dreams.” ― Emmanuel Apetsi"},{"quote":"“Everything that breaks us, is everything that makes us. Life molds us into sheer perfection. Be not fearful of the heavy storms in life. They are merely here to shape our dreams and to allow our Soul to unfold.” ― Ulonda Faye, Sutras of the Heart: Spiritual Poetry to Nourish the Soul"},{"quote":"“DARE to Dream the Impossible Dream.....DARE to DREAM SOMETHING BIGGER THAN YOURSELF.” ― John Hagee"},{"quote":"“- But if I am going to fail, I say. - If I am not going to end up in LA after all spending weekends with you and watching our dreams come true, I don’t want to risk falling for you again just to say goodbye, I guess.” ― Robby Weber, If You Change Your Mind"},{"quote":"“The size of your success is measured by the strength of your desire; the size of your dream; and how you handle disappointment along the way.” ― Robert Kiyosaki"},{"quote":"“Your dreams require your actions to manifest, don’t deny them.” ― Emmanuel Apetsi"},{"quote":"“Be ambitious! Be daring! For dreams won’t dream you, you have to dream them and aspire to achieve them.” ― Emmanuel Apetsi"},{"quote":"“I fear nothing but a life of unrealized dreams.” ― Emmanuel Apetsi"},{"quote":"“Live your life not as a sample of what is, but as an example of what could be.” ― Abhijit Naskar, Find A Cause Outside Yourself: Sermon of Sustainability"},{"quote":"“Reach for the stars, but remain grounded.” ― Frank Sonnenberg, The Path to a Meaningful Life"},{"quote":"“A prominent person would utilize his or her talent to inspire and benefit others instead of excessively craving for fame and wealth to only benefit him or herself.” ― Saaif Alam"},{"quote":"“Your dream can become a reality if you set realistic goals for yourself and associate with others who would help you to achieve it.” ― Saaif Alam"},{"quote":"“We are not getting out of here alive, so why settle?” ― Chris Jankulovski"},{"quote":"“Dream your dreamscreate your artsing your songsand play your best game ever.We are all blessed, and we are all herefor a purpose for which only our Soul truly knows. Tune in to your call,listendream.Do only that which brings happiness and well-being. If it feels good and makes you happy, then do more of it. Spend time with people who believe in you and support you.Be with those who feed your Soulfor, when you grow and blossom, there are fields of flowers to nurture all.Wish the best for yourself and the perceived other. Everything is possible.” ― Ulonda Faye, Sutras of the Heart: Spiritual Poetry to Nourish the Soul"},{"quote":"“To Those Who Mean Well(Sonnet From A God)Dear vermin of the greedy gutters of earth,I permit you to live as your whims may dawn.I just wish, expired cigarette buts wouldn'tshow the moronic audacity to advise the sun.I don't hate you for your life of greed and filth,But the most you are gonna get from me is pity.Apes who are alien to the concept of accountability,Are no more significant than a termite community.With all your googling expertise, how about youspend some data researching the term \"ambition\".Know your place, my dear armchair intellectuals,Chimps should speak only when spoken to by a human.To you who mean well,your death is the end of your story.My death is the beginning of a legend.” ― Abhijit Naskar, Vande Vasudhaivam: 100 Sonnets for Our Planetary Pueblo"},{"quote":"“I want every dreamer on this planet that has a dream to realize that no matter how young or old you are that life doesn't come with a blueprint. Always remember, it's never too late to achieve your dreams if you never give up.” ― Marcus Moutra"},{"quote":"“Dream big, it is the first step towards creating a history.” ― Ambreen Nadeem, The Algorithm of Life: The Code to Choose Your Destiny"},{"quote":"“Never stop dreaming, never stop striving for excellence” ― Luvvie Ajayi Jones, Professional Troublemaker: The Fear-Fighter Manual"},{"quote":"“I may throw my youthful fun years away, but what better way to do it than in search of greatness?” ― Emmanuel Apetsi"},{"quote":"“It doesn't matter what happens to you on earth, just look in the sky, and look at the stars. Go deep into the galaxy, and dream.” ― Veronica Braila, Blue House: Ten Years on The Way Home"},{"quote":"“You shit on my dreams and fertilize my faith in them.” ― Curtis Tyrone Jones, Sleeping With Enormity: The Art Of Seducing Your Dreams & Living With Passion"},{"quote":"“Make love to your dreams like you want them to come.” ― Curtis Tyrone Jones"},{"quote":"“Dreams remain dreams until we decide to act upon them.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“Remember in the world of business, you keep your friends close but your enemies even closer.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“When it comes to opportunities, timing is very important.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“Everyone dreams, but only some people are dreamers. The non-dreamers, by far more numerous, are those who see the world as it is. Then there are the few dreamers, who see the world as they are. The moon, the river, the train station, the sound of rain, and even something as mundane as porridge become something else with many layers. The world feels like an oil painting rather than a photograph, and the dreamers are forever seeing hidden colors where others just see the top shade. The nondreamers look through glasses, and the dreamers through a prism” ― Juhea Kim, Beasts of a Little Land"},{"quote":"“They say you dream too big, I say they think too small.” ― Domagoj Kurmaic"},{"quote":"“The vastness of the magnificent sky is a reason enough to dream insanely big.” ― Hiral Nagda"},{"quote":"“In order to move our culture forward, revolutionaries have had to speak and plan from the unseen order inside them. For those of us who were not consulted in the building of the visible order, igniting our imagination is the only wya to see beyond what was created [before us]. If those who were not part of the building of reality only consult reality for possibiliies, reality will never change. [...]Each of us was born to bring forth something that has never existed: a way of being, a family, an idea, art, a community - something brand-new. We are here to fully introduce outselves, to impose ouselves and ideas and thoughts and dreams onto the world, leaving it changed forever by who we are and what we bring forth from our depths, So we cannot contort ourselves to fit into the visible order. We must unleash ourselves and watch the world reorder itself in front of our eyes.” ― Glennon Doyle, Untamed: Stop Pleasing, Start Living / A Toolkit for Modern Life"},{"quote":"“Where there is no vision, there is no hope.” ― George Washington Carver"},{"quote":"“In the long run, you may have to let go of certain things; you must do what is good for your dreams.” ― Avijeet Das"},{"quote":"“If you keep standing on the verge of greatness, you'll eventually get the opportunity to leap into it.” ― Curtis Tyrone Jones, Giants At Play: Finding Wisdom, Courage, And Acceptance To Encounter Your Destiny"},{"quote":"“I wish that all your stars settle on your dreams - so you’ll still see them shine while the world may forgets them.” ― Laura Chouette"},{"quote":"“Whatever you do, do not match the room—Failure is when a person is seduced to what is now.” ― Karl Kristian Flores, The Goodbye Song"},{"quote":"“Dreams, like a fine wine, can take their own time to mature.” ― T.W. Lawless"},{"quote":"“Dreams don't have deadlines. Dreams don't have wrinkles!” ― Dedra Davis"},{"quote":"“Imagination is how personal and worldwide revolutions begin. 'I have a dream,' said Martin Luther King, Jr.” ― Glennon Doyle, Untamed: Stop Pleasing, Start Living / A Toolkit for Modern Life"},{"quote":"“​In the age of technology and abundant resources, it's more important for youth to understand the value of resources and believe what impact they can bring to their life.” ― Ankit Samrat"},{"quote":"“The cost of your unfulfilled dream is your forever regret.” ― Aiyaz Uddin"},{"quote":"“Your current income is not the final indicator of your ultimate outcome.” ― Curtis Tyrone Jones"},{"quote":"“For anyone out there who is afraid to follow your dream, don't be! I can't encourage you enough!” ― Christina Casino"},{"quote":"“We only write about the thingswe dare not dream about.” ― Laura Chouette"},{"quote":"“They dancedand yet they died;” ― Laura Chouette"},{"quote":"“And even the smallest of us can reach the stars - so why is it that once we’ve grown up we can't even see the sky (itself)?” ― Laura Chouette"},{"quote":"“And even the smallest of us can reach the stars - so why is it that once we grow up we can't even see the sky?” ― Laura Chouette"},{"quote":"“Dare to dream and don't stop until your dream becomes a reality.” ― Garima Soni - words world"},{"quote":"“The vastness of the magnificent sky is a clear indication to dream big.” ― Hiral Nagda"},{"quote":"“Sometimes we need to attempt things that don’t make sense to anyone but ourselves.” ― Michelle Muriel, Westland"},{"quote":"“No one is holding you back from your dream of being an author...unless you are.” ― Krista Dunk"},{"quote":"“You push on, do your best, and if you are really brave, you dream big, doubts and fears be damned. This is the stuff that miracles are made of, and the proof was there to see, on February 22, 1980.” ― Wayne Coffey, The Boys of Winter: The Untold Story of a Coach, a Dream, and the 1980 U.S. Olympic Hockey Team"},{"quote":"“Before Leonardo da Vinci painted The Last Supper, he saw the masterpiece in his mind. Before Winston Churchill led Britain during World War II, he envisioned winning the battle. Before Tiger Woods won his first championship, he saw himself holding the coveted trophy. There are times when God gives you a dream so distinctly that it changes the direction of your life.” ― Shaneen Clarke, Dare to Be Great"},{"quote":"“You are the dream, the dreamer, as well as its keeper.” ― Abhijit Naskar, Honor He Wrote: 100 Sonnets For Humans Not Vegetables"},{"quote":"“You are what you think all day every day. Focus your energy on positive thoughts that reflect who you want to be even if you don't see that person yet. ” ― Germany Kent"},{"quote":"“Persist. Even when you’re heavy with emotion, pick yourself up bringing the axe of your actions down, repeatedly chopping at the day until you bring the sun low with success.” ― Curtis Tyrone Jones"},{"quote":"“Dream Big. Expect Challenges To Pop Up Along the Way. Expect To Fall Many Times. Expect Your Mind To Doubt And Whisper, Give Up. In Those Moments, Recharge. Rethink. Replan The Best You Can. And Push Through Because Sometimes Its All You Can Do.” ― Wesam Fawzi"},{"quote":"“Think bigger than circle of environed issues,Study, be an ideal of dream society;Free of disgraceful attachment of values,Dream higher than those individualistic goals” ― Zakir Malik, The Wail Of The Woods"},{"quote":"“Don't plant your high hopes in a mud puddle.” ― Heather Babcock"},{"quote":"“‪Life can break you many times before you get your big break.‬” ― Curtis Tyrone Jones"},{"quote":"“If you’re not married to your vision, you’re fucking yourself and screwing your future.” ― Curtis Tyrone Jones"},{"quote":"“If it’s not strong enough to intoxicate, it’s probably not a great idea.” ― Curtis Tyrone Jones"},{"quote":"“Find your wings and follow your dreams...because you were made to fly.” ― Lin Rajan Thomas, Every Sparrow Was Made to Fly"},{"quote":"“Wake up! And lay claim to your dream with sacred determination flashing in your eyes, never to play small for the rest of your life.” ― Curtis Tyrone Jones, Mirrors Of The Sun: Finding Reflections Of Light In The Shittiness Of Life"},{"quote":"“Close your eyes to all that frightens your dream and visualize the envision that brightens your dream” ― P.S. Jagadeesh Kumar"},{"quote":"“I have not born with wings yet I have learned to fly” ― J. Nedumaan"},{"quote":"“The future belongs to those who anticipate it.” ― Baptiste Tricoire"},{"quote":"“You cannot crunch the numbers on a dream. Your biggest dreams defy conventional wisdom.” ― Ray A. Davis, The Power to Be You: 417 Daily Affirmations & Motivational Quotes"},{"quote":"“The first inclination of this generation is to talk, talk, talk-about anything and everything, at anytime and in any way. But the problem is, talk is a sham when it is from a person who knows not much and to whom talk is a pass-time. Know, stay silent, dream big, dare, take risks, talk, think, love...that's the definition of my zeal. And that's the definition of greatness” ― Asuni LadyZeal"},{"quote":"“These stories fed her dreams.” ― Maria Kuzniar, The Ship of Shadows"},{"quote":"“A comfort zone will never be the path to fulfilling your true destiny.” ― Anthon St. Maarten"},{"quote":"“Dream high. Aim for it as long as you can. Don’t let anyone ruin it. You have the power to make it come true.” ― Jennifer Magtagñob"},{"quote":"“Just as Geppetto persisted in his false wish to make his created toy into a real boy, even so you must persist with Pinocchio’s nose and courage in the belly of the fish, until the fairy of the universe waves her wand, enchants your dreams and gives genuine life to your every wish.” ― Curtis Tyrone Jones, Guru In The Glass: A Mysterious Encounter While Dying To Live The Unlived Life"},{"quote":"“If you want Clout, WORK for it!” ― Germany Kent"},{"quote":"“There is no vision until you decide what you deserve & staple it to your eyeballs.” ― Curtis Tyrone Jones"},{"quote":"“I felt like I'd just asked a child what he wanted to be when he grew up. And a child had answered me, honestly, with no adult filter telling him what was and wasn't possible.\"Your own planet,\" I said. I wanted to laugh but couldn't. In fact, I had goose bumps. This man sitting in front of me had no detectable talent, did everything wrong, wasn't comfortable saying how old he was or where he was from, and seemed to take an hour to learn what most people picked up in five seconds. Still, for that moment I believed him. I believed he could have his own planet.\"Yeah,\" he said, looking up. \"I see this big thing and big light and big events with stores and hotel and movie. All these things all together. It will be spectacular.\" He reached for his glass of hot water but hesitated before lifting it to his mouth. Tommy peered at me from beneath his large protruding brow. \"And you can live in my planet, if you decide. Maybe I let you stay for little while.\"What did I think of living on Tommy's planet? I wasn't sure. What I was sure of was that Tommy had something I'd never seen in anyone else: a blind and unhinged and totally unfounded ambition. He was so out of touch, so lacking self-awareness, yet also weirdly captivating. That night there was this aura around Tommy—an aura of the possible. Stick with him, I thought, and something would happen, even if I had no idea what that something might be. Maybe that was it: Tommy made me listen to the right voices in my head. This big, childish vision of his—what was it if not every actor's secret dream?” ― Greg Sestero, The Disaster Artist: My Life Inside The Room, the Greatest Bad Movie Ever Made"},{"quote":"“well I did get one good line out of Joe Biden... \"undermine the dignity of work\" = Unless you pay me a shitton of money so I can finally buy a goddamn Yacht, YOU're fucking undermining the dignity of MY work. There. Fixed it.” ― Dmitry Dyatlov"},{"quote":"“It is OK to be sad, hurt and to worry but you must drop the load and believe in yourself and dream big again.” ― Abhishek Ratna, small wins BIG SUCCESS: A handbook for exemplary success in post Covid19 Outbreak Era"},{"quote":"“Some words are too sober to be the driver designated to help me, reach the destination of my destiny.” ― Curtis Tyrone Jones, Sleeping With Enormity: The Art Of Seducing Your Dreams & Living With Passion"},{"quote":"“I Hope' Gets To The Gate, 'We Hope' Comes To Pass.” ― Martin Uzochukwu Ugwu"},{"quote":"“I don't mind getting a job, but You need to understand that I have an 80 foot motor yacht on my Vision board.” ― Dmitry Dyatlov"},{"quote":"“Being determined is to only know rivers but keep dreaming of oceans every single time.” ― Mitta Xinindlu"},{"quote":"“Dream big but always plan small” ― Davan Yahya Khalil"},{"quote":"“Fear isn’t the lack of gut wrenching emotions, it is the ability to connect with the courage inside and jump anyway!” ― Positively Sherry"},{"quote":"“Let all the dreamers wake the nation.” ― Carly Simon"},{"quote":"“Old lady failure died giving birth to twin giants named confidence & optimism, but her name lives on as the mother of success.” ― Curtis Tyrone Jones, Sleeping With Enormity: The Art Of Seducing Your Dreams & Living With Passion"},{"quote":"“My heartbeat speeds up again, coming from a place of hopeful anticipation instead of dreadful fear.” ― Dave Cenker, Second Chance"},{"quote":"“It's never foolish to have a dream. Even if it never comes to be. It can give you the hope you need to keep going” ― Laila Ibrahim, Paper Wife"},{"quote":"“Every time, I have a question how do people live without dreams?” ― Ronak Naneriya"},{"quote":"“No step forward is too small. Just be sure it's taking you to the right dream, then take more of those tiny steps.” ― Israelmore Ayivor, Let's go to the Next Level"},{"quote":"“If you are conscious of your own dreams, nobody can confuse you with their own goals. Wake up and live your dreams!” ― Israelmore Ayivor, Let's go to the Next Level"},{"quote":"“Dreams aren't what you leave behind when morning comes.They are the stuff that fill your every living moment.” ― David Cuschieri"},{"quote":"“As it comes down, carefully situate the sun on yourself like a paper crown, so the light of the universe never sets on your dreams.” ― Curtis Tyrone Jones, Mirrors Of The Sun: Finding Reflections Of Light In The Shittiness Of Life"},{"quote":"“Outdream yourself, then do an overtime!” ― Chinonye J. Chidolue"},{"quote":"“You must have a vision before you can manifest - anything.” ― Germany Kent"},{"quote":"“If I don’t dream, I just get bored” ― Jitendra Attra, chakravyuh The Land of the Paharias"},{"quote":"“Dreams are the manifestations of activities of mankind on a daily basis. They are vibrations happening inside everyone.” ― Neeraj Singhvi, Temple of Destiny"},{"quote":"“Jealous people can be quite mean in an attempt to feel better about themselves, but you do not have to give them that power.” ― Nyki Mack"},{"quote":"“The world around you may ask you to stop Dreaming Big, as it could create insecurity in theirlives. Dream Big anyway, dance to your own music and let them dance to theirs.” ― Mridula Singh, Live More: Magic Begins with You"},{"quote":"“The story of America is the story of an adventure that began with deep faith, big dreams and humble beginnings.” ― Donald Trump"},{"quote":"“One way to ruin your life is to have dreams bigger than your abilities.” ― Clifford Thurlow, Operation Jihadi Bride: The Covert Mission to Rescue Young Women from ISIS"},{"quote":"“Wishing is for wishers.Dreams are for dreamers.Goals are for doers.” ― David Cuschieri"},{"quote":"“You Can Create The Life Your Dream... Or You Can Just Watch Other People Live Their Dream. Think Smart And Decide Wisely... Your Success Depends On You!” ― Wesam Fawzi"},{"quote":"“I cast my eyeball into the depths of space as bait, vision-casting to see the unreal catch life is reeling in for me.” ― Curtis Tyrone Jones, Sleeping With Enormity: The Art Of Seducing Your Dreams & Living With Passion"},{"quote":"“It is hard to predict the growth of a man does not dream than it to calculate the progress of a sleeping man.” ― Kangoma Kindembo"},{"quote":"“A significant portion of what we call reality was shaped by human effort.” ― Mokokoma Mokhonoana"},{"quote":"“You have to dream big before doing big” ― Saif Rehman"},{"quote":"“It’s only a dream when your eyes are closed...” ― Niedria Dionne Kenny, Phenomenally Me: My Sweet 2016™"},{"quote":"“Hearty wishes and lofty dreams;Scream aloud in barritones and accoustic thrills.When you take a leap, and trust the steps and turns,As your dream, so shall you become.” ― Chinonye J. Chidolue"},{"quote":"“Dream Big! But don't forget to dream small too...” ― The Art Of Vikki"},{"quote":"“Many ideas fail to see the light of day and are buried in the same fertile mind they once originated in because of a single reason. People fail to take the first step and the next steps never happen.” ― Rajan Kumar, Balls & Strategy: Follow Your Dreams"},{"quote":"“Life is an experience so gain it and live your life.” ― iamsophie"},{"quote":"“Do not be scared to dream. Every big achievement began as a dream.” ― Gift Gugu Mona"},{"quote":"“You are not because you don’t dream. For if you were, you will dream bigger things for yourself.” ― Naide P Obiang"},{"quote":"“The 7 Steps to Transformation:1. Dream it.2. Envision it.3. Think it.4. Grow it.5. Become it.6. Live it.7. OWN it.” ― Germany Kent"},{"quote":"“Don't pay attention to people Who tell you can't do it at lenght. Trusting your own instincts Can lead to what's quintessential. Make their limitation be your strenght. You might as well contradict them And then reach your full potential.” ― Ana Claudia Antunes, A-Z of Happiness: Tips for Living and Breaking Through the Chain that Separates You from Getting That Dream Job"},{"quote":"“I know it will not happen in one day. I also know that it is definitely going to happen one day.” ― Manoj Arora, Dream On"},{"quote":"“Take a leap of faith on your dreams, not for me and not for the society, just for yourself.” ― Vinay Garg"},{"quote":"“Until you let go of that bitterness in your heart, it will find a comfortable place to destroy your dreams, your sight and most times, your sleep.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“My childhood dream came true, but now I have a new one. I dream that some of these young people, while they're out there clicking around, maybe they'll find out about this book and find a way to get their hands on it - and when they do, they'll know that even if you're a skinny kid from Long Island who's scared of heights, if you dream of walking among the stars you can do it. They'll know that finding a purpose, being dedicated to the service of others and to a calling higher than yourself, that is what's truly important in life. They'll be able to close their eyes and imagine what it's like in space, and when they open them again, they'll look up at the sun and the moon and the Milky Way and see them with the sense of awe and wonder that they deserve.And those young boys and girls, whatever their space dream is, they'll go for it. Whatever hurdles are in their way, they'll get past them. When they fall down, they'll get back up. They'll keep going and going, working harder and harder and running faster and faster until one day, before they know it, they'll find themselves flying through the air. The hand of a giant science fiction monster will reach down and grab them by the chest and hurl them up and up and up, out to the furthest limits of the human imagination, where they'll take the next giant leap of the greatest adventure mankind has ever known.” ― Mike Massimino, Spaceman: An Astronaut's Unlikely Journey to Unlock the Secrets of the Universe"},{"quote":"“In the garden of dreams, there are many great seeds of possibilities waiting to sprout - looking for your attention - the water and the light.” ― Amit Ray, Peace Bliss Beauty and Truth: Living with Positivity"},{"quote":"“Dreams come true with much work.” ― Lailah Gifty Akita"},{"quote":"“Never take tiny dreams for granted. They contain giant success stories.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“A leader’s meal is that unstoppable desire to stay late to see his dreams achieved. They never give up.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“The dream is for a distant time.” ― Lailah Gifty Akita"},{"quote":"“Smash the Goals in your Life! You are the Unstoppable! ” ― Avijeet Das"},{"quote":"“You can make you most cherished dreams come true..” ― Lailah Gifty Akita"},{"quote":"“You can only take too much in pursuit of something you don't really want.” ― Joyce Rachelle"},{"quote":"“Soar your wings high in the heavenly sky.” ― Lailah Gifty Akita"},{"quote":"“It's not how good you are, It's how good you want to be.” ― Paul Arden, It's Not How Good You Are, It's How Good You Want To Be"},{"quote":"“Dream big. Start small. Begin today.” ― Sravani Saha Nakhro"},{"quote":"“Don’t only think of which job to get and live on. Think about which problem to solve and the jobs will keep suggesting themselves.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Sometimes the only things preventing your dreams from becoming realities is the long time it is taking you to start.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Don’t just have dreams. Take actions too. To make it possible, begin every dream with a simple action and your interest will beam out.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“A dream without an action is like a fish without gills. It can’t survive.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Be passionate about your dreams and never give sleep to your eyes until your good becomes better and your better becomes the best.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Take risks. Whoever risk, shall know how far they can reach.” ― Lailah Gifty Akita"},{"quote":"“You will never be rewarded for the dreams you slept over day in day out. You will be rewarded for dreams you stay awake and achieved.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Dream again, think again, and live again.” ― Kyle Vidrine, Wake Up The Winner In You: Your Time Is Now"},{"quote":"“A counterfeit can never be a substitute for the real thing” ― Sipho Bayeto, Saving Scarlett"},{"quote":"“To delight is to desire.” ― Lailah Gifty Akita"},{"quote":"“Have you ever had a dream so strong it slapped you in the face every time you looked away?” ― Joyce Rachelle"},{"quote":"“Dream big, work with passion, and then let it be.” ― Debasish Mridha"},{"quote":"“Dare to dream big. Dream while you are awake, and let those dreams take your sleep away.” ― Debasish Mridha"},{"quote":"“At the very moment when people underestimate you is when you can make a breakthrough.” ― Germany Kent"},{"quote":"“7 keys to getting more things done: 1 start 2 dont make excuses3 celebrate small steps4 ignore critics5 be consistent6 be open7 stay positive” ― Germany Kent"},{"quote":"“Integrity is something we show, not proclaim.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“There are three categories of people exist in the world; “the wanters”, “the wishers” and “the makers.” ― Israelmore Ayivor, 101 Keys To Everyday Passion"},{"quote":"“If you sincerely want to be successful in life, all you need is one person to believe in you, and that one person should be YOU. As long as you genuinely believe in yourself, you can and will be a success. Your mindset is a powerful force! What you think and how you think will be the ultimate factor of your journey’s end.” ― Stephanie Lahart"},{"quote":"“Live in the shadow of the moon until you're bright enough to give birth to your own suns.” ― Curtis Tyrone Jones"},{"quote":"“Life is a dream of roses and the thorns prick us back to reality.” ― Daljit Ranajee, Echoes from Punjab: Metamorphosis of a Woman"},{"quote":"“You'd corner me in your conformity but even in dormancy i'm sleeping with enormity, stretching the belly of the earth & everything i was born to be.” ― Curtis Tyrone Jones"},{"quote":"“You'll always be curious yet deliriously sinking into whatever your nightmare is until you let your wings know you're serious by leaping into your wildest dreams of self love.” ― Curtis Tyrone Jones"},{"quote":"“Do not be an average person, average is not normal, average is lazy. set goals, dream more, break the rules and become a better person you want be. BE HUMBLE AND KIND” ― Futty-fuze"},{"quote":"“Hope dreams into being what is possible but not yet formed.” ― Sharon Weil, ChangeAbility: How Artists, Activists, and Awakeners Navigate Change"},{"quote":"“You won’t accomplish or reach your greatest potential in life if your main focus is on what other people think of you. No matter how great you are, some people will form their own negative opinions of you. Don’t give your haters your time or energy! People that are negative, jealous, and envious of you aren’t worth your future. Go after your dreams with purpose and unwavering belief!” ― Stephanie Lahart"},{"quote":"“This America of yours, does it always build what you dream?” ― Laurie Fabiano, Elizabeth Street"},{"quote":"“I charge you; once you have the dream, decide to begin and begin right away. Wait for nobody to blow whistles for you to start.” ― Israelmore Ayivor, Become a Better You"},{"quote":"“Don’t wait for big opportunities. You can create small but wonderful ones by starting with what you have.” ― Israelmore Ayivor, Become a Better You"},{"quote":"“One of the first steps to successful leadership is to forget your age and remember your dream.” ― Israelmore Ayivor, Leaders' Ladder: Leadership Ideas from Successful Global Leaders"},{"quote":"“One of the first steps to successful leadership is to always forget your age and remember your dream regularly.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Whether the changes that are coming in your life will be unexpected or determined by your choices and actions, the wheels are in motion. The adventure has just begun.” ― Teresa R. Funke, Bursts of Brilliance for a Creative Life blog"},{"quote":"“Birds that cannot fly high into the sky rejoice exceedingly and sing sweet melodies when they get to the top of the tallest tree on the highest mountain!” ― Ernest Agyemang Yeboah"},{"quote":"“If people are not laughing at your Goals, your Goals are not big enough!” ― Alex Haditaghi, Softly, As I Leave Her"},{"quote":"“Never stop pushing for what you want! If something is truly important to you, stay diligent and find a way. Depending on whom you ask, the answer may be different. Never settle for the first answer! Do your own research, ask different people, go above other people’s head if you have to. Sometimes it’s necessary to push the envelope. Some people will purposely give you the wrong answer to try to stop you and/or hold you back. This, unfortunately, is a reality. Some people’s intentions are all wrong. Be mindful that not everyone will have your best interest at heart.” ― Stephanie Lahart"},{"quote":"“If you hate to think, you are not different from some who is peeing on his academic certificates. The goal of education is to help you to think and lead.” ― Israelmore ayivor , Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Quando sei preda dell'ispirazione... Ruggisci.” ― Anna Silvia Armenise"},{"quote":"“All it takes is one word, one action, one voice. Believe in yourself, and you can accomplish anything!” ― Samuel Colbran, Lake Merrin"},{"quote":"“They say “Dream Big” ,but the real concept Nothing Impossible.” ― Mohamed Saad"},{"quote":"“To become a better you, don’t dream of becoming a superior over other people. Dream of becoming a superior over your previous achievements.” ― Israelmore Ayivor, Become a Better You"},{"quote":"“Never let the weight of challenges and the duration of your dreams scare you to give up.” ― israelmore ayivor, Become a Better You"},{"quote":"“Blow out all negative attitudes and live true to your dreams. Talks less and act more. Be confident and see yourself wining even before the victory comes.” ― Israelmore Ayivor, Become a Better You"},{"quote":"“A person is only as big as the dream they dare to live.” ― Sravani Saha Nakhro"},{"quote":"“In every dream journey, there comes a moment when you have to quit living as if the purpose of life is to arrive safely at death.” ― Mark Batterson"},{"quote":"“The freedom of the open road is seductive, serendipitous and absolutely liberating.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“We love our partners for who they are, not for who they are not.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“The high road of grace will get you somewhere a whole lot faster then the freeway of spite.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“To become a better you, secure your dreams from the jaws of people who discredit your ambitions.” ― Israelmore Ayivor, Become a Better You"},{"quote":"“Travel is costly yes, but it pays dividends too.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Anyone can choose to have success, but only the patient ones will get rewarded by it. Be relentless in chasing your dreams.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Don't live off your past successes or failures, live for the next big pursuit.” ― aaron lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Be a team player, not a bandwagon jumper.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“The only real certainty is that if you get to live, you gotta die. Live life now.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Sow the seeds of hard work and you will reap the fruits of success. Find something to do, do it with all your concentration. You will excel.Show the world you are not here to just pass through. Leave great footprints wherever you pass and be remembered for the change you initiated.Flow wherever you go. You can’t be limited. Dare to rise above all limitations and become better than you were. Strive to arrive at the top.Glow wherever you go and let the light of God reflect in the world around you. You carry the light of God and wherever you pass, darkness must flee.Grow your talents and skills through a consistent practice and progressive learning. Learn to relearn and unlearn. Raise the bar for yourself always.Blow out all negative attitudes and live true to your dreams. Talks less and act more. Be confident and see yourself wining even before the victory comes.Know God and let Him be known. You were saved by grace for greater works apportioned for you even before you were born. Share the good news.I am proud of you because greater things that eyes have not seen yet, the Lord will do through you.” ― Israelmore Ayivor, Become a Better You"},{"quote":"“When it's your time you will walk right into your blessing.” ― Germany Kent, You Are What You Tweet: Harness the Power of Twitter to Create a Happier, Healthier Life"},{"quote":"“If you have more dreams than achievements-you're young.” ― Shimon Peres"},{"quote":"“The magic to attain victory is simple…..Just believe.” ― Omoakhuana Anthonia"},{"quote":"“There is no such thing as loving a child too much.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Goals and dreams are not purposed to please others. I'd rather be the jester who adds value to those around me than a King with no vision or intention of making a difference.” ― Janna Cachola, Short journey"},{"quote":"“The funny thing about money is that you can't take it with you, so don’t try to.” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“Çok hayal kuruyorum. Sayıca fazla olunca, biri gerçek oluyor!” ― Tunç Kılınç, Sıfır"},{"quote":"“Successes are those highlights of life we look back on with a smile. But it's the day to day grind of getting them that defines the laugh lines etched until the end of time. Enjoy each moment along the way” ― Aaron Lauritsen, 100 Days Drive: The Great North American Road Trip"},{"quote":"“The highway of grace will get you somewhere a whole lot faster then the freeway of spite.” ― Aaron Lauritsen"},{"quote":"“Dare to dream big. Never fear to fail. Take actions with love.” ― Debasish Mridha"},{"quote":"“To dream is to have a chest filled with stars, a mind captivated by possibilities and a heart enveloped in imagination.” ― Anastasia Bolinder"},{"quote":"“Surround yourself with people that love you and accept you exactly for who and what you are. The only explanation you owe is the one you give to yourself, for not living your authentic life with the love and purpose you were meant to live.” ― Luis Almonte"},{"quote":"“Reading doesn't put you to sleep... it makes you dream...” ― Nanette L. Avery"},{"quote":"“today start with a THOUGHT, turn it into IDEA tomorrow, next day you will see it in REALITY” ― shashidhar sa"},{"quote":"“The degree of concentration you give to your dream will determine your success percentage!” ― Israelmore Ayivor, Become a Better You"},{"quote":"“Only you can make your dreams come true ...or not.” ― Gavin Mills"},{"quote":"“Not one person can afford your dream; the execution of it is too expensive.” ― Johnnie Dent Jr."},{"quote":"“We get so wrapped up in what we should do, what we think we can’t do because of our problems, what material goods we need, what kind of person we wish we were…but we never ask our soul what it wants, at the core of everything.” ― Kristin Rath, Meant for More: Create Your Dream Life, Plan Your Path, and Start Living It Now"},{"quote":"“Everyone has a dream, so why not dream big... it just might happen!” ― Patrick Witz"},{"quote":"“I'd rather be the jester who adds value to those around me than a King with no vision or intention of making a difference.” ― Janna Cachola, Short journey"},{"quote":"“It's still ok to dream with a broken heart.” ― Nikki Rowe"},{"quote":"“You are not your past. You are the warrior that rose above it to become the example of someone who didn't survive, but thrived in creating the most beautiful last chapter of their life.” ― Shannon L. Alder"},{"quote":"“What separates a weak dreamer and a great dreamer is who is wishing and waiting or who is willing and working.” ― Israelmore Ayivor, You Can Rise"},{"quote":"“Nurture your Dream everyday. A strong dream will empower you to take bold decisions and allow you to follow your heart.” ― Manoj Arora, Dream On"},{"quote":"“We all think of doing something distinctive in life. We all do dream of becoming great and leaving distinctive footprints but, when we get that dream, we must get a clear understanding of what it takes to be great. We must get the real picture of what it takes to live and leave distinctive footprints. We need to understand the real reasons why we must pursue to the end notwithstanding how arduous the journey to greatness may be and the tangible and intangible costs we may have to pay. We must have a nimble mind, move with tenacity and dare without retreating. Though we may be ignorant of the certainty, uncertainty and serendipity we may meet, we must think ahead! Vision shall always be a vision until we take that step of fortitude to make it a reality. When you dream of what is distinctive, make it happen!” ― Ernest Agyemang Yeboah"},{"quote":"“Long live the dreamer inside of me.” ― Nikki Rowe"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“We all have the power within us, to make something of ourselves, the thing is very few believe it.” ― Nikki Rowe"},{"quote":"“Most great accomplishments do not look promising in the beginning. If you give up on a big dream too early, you have probably stepped on gold and mistook it for a rock.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Don't leave the dream, lead your dreams!” ― Akilnathan Logeswaran"},{"quote":"“Tell few about your dreams and show the rest in the way you make a life with it.” ― Nikki Rowe"},{"quote":"“When the lenses in the eyes of a leader captures tomorrow, they don't print the passport size of it. They make enlargements.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Be careful of what you dream and expect in life. You might just get it.” ― Manoj Arora, Dream On"},{"quote":"“You can't dream it unless you first see it.” ― Steven Chopade"},{"quote":"“Always stay strong to your dream because when you lose sight of it then that is when your dream dies!” ― Stephen Richards, Success is Only One Thought Away: Motivational and Inspirational Quotes from Mind Power Professional Stephen Richards"},{"quote":"“Admirable is excellent.” ― Lailah Gifty Akita"},{"quote":"“i want to become as big as my dreams are...” ― shivangi lavaniya"},{"quote":"“Some people just win, while others win with indelible styles. Don’t just dream to win; dare to be remain a winner!” ― Israelmore Ayivor, You Can Rise"},{"quote":"“He was pitching to me before I could walk. He gave me wooden bat before my mother let me use scissors. He said I could make the major leagues one day if I had \"a plan,\" and if I \"stuck to the plan\"Of course, when you're that young, you nest in your parents' plans, not your own.” ― Mitch Albom, For One More Day"},{"quote":"“Great dreams may not necessarily come to pass greatly at a twinkle of an eye. The best dream which survive greatly in reality takes great roots first before it grows in reality to bear great fruits. Delay is not death! Carefully and patiently nurture your dreams and make them happen distinctively in reality” ― Ernest Agyemang Yeboah"},{"quote":"“Once an angel said to the dreamer, \"You will get whatever you want in your life in this world and from this world\".” ― Newpostcard"},{"quote":"“Dream the impossible.See the invisible.Pursue the intangible.Achieve the incredible.” ― Matshona Dhliwayo"},{"quote":"“Dare to believe in your sacred dreams” ― Lailah Gifty Akita"},{"quote":"“Take the path less traveled and learn from your mistakes. Don’t just let life happen around you; control your future. Learn to ask questions, set small goals, and dream of big ones. Absorb any criticism and let it fuel you. Convince others that you are worthy of your dream, and show them that you are willing to put up a damn good fight for it.” ― Matthew T. Cross, The Resume Design Book: How to Write a Resume in College & Influence Employers to Hire You [Color Edition]"},{"quote":"“You can fly as high as you can.” ― Lailah Gifty Akita"},{"quote":"“Better to sink with tempests raging o'erMasts all dismantled and hull gaping wideThan rest and rot on some unclouded shoreThe idle plaything of the listless tide.Better the grime of battle on the brow,With grim defeat to crush thy dying handThan through long years of peace to tyrant bowOr dwell captive in a strangers land.Better the castle with beleaguered gate,By battle's lightning shivered in a dayThan peaceful walls in pomp of sullen state,Through centuries sinking to a dull decay.Better resolve to win thy heart's desire,And striving bravely, die in the endeavorThan have the embers of some smothered fireLie smouldering in thy saddened soul forever.” ― Sam Davis, Stop Procrastination: 12 Simple Anti-Procrastination Habits That Will Help You Stop Procrastinating And Boost Your Productivity"},{"quote":"“It’s okay to DREAM and dream BIG.” ― Abhishek Kumar, Stardust Family - We Are One!"},{"quote":"“Dream big, envision a glorious destiny, write your own story, and work each day to arrive @ that destiny. You're able!” ― Assegid Habtewold, The 9 Cardinal Building Blocks: For continued success in leadership"},{"quote":"“Believe in your dreams. Your passion will show you the way” ― Mani S. Sivasubramanian, The Icedrop"},{"quote":"“Keep running; keep dreaming, keep alive the flame of hope; defeat and despair will not catch up with you” ― Bangambiki Habyarimana, Pearls Of Eternity"},{"quote":"“When your dream turns into a nightmare, rise to the challenge and slaughter the dragons” ― Bangambiki Habyarimana, The Great Pearl of Wisdom"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“You will never get what you want if you believe that you are not worthy of having it. God doesn't create us to be defeated.” ― Shannon L. Alder"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“Dream bigger before you can't remember to dream at all.” ― Ellen Hopkins, Triangles"},{"quote":"“Some people spend the best part of their lives living the dreams of others” ― Bangambiki Habyarimana, The Great Pearl of Wisdom"},{"quote":"“The only way to stop a nightmare is to open your eyes, if perchance you realize you were dreaming” ― Bangambiki Habyarimana, The Great Pearl of Wisdom"},{"quote":"“Lift yourself to great heights.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“God can take you where you want to go.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“Got dreams in my mind that got me hustling all the time.” ― Osama Al-Hasan"},{"quote":"“When deciding whether or not to go for your dream, remember that you don't need a bigger net, you just need bigger wings.” ― Sheri Fink"},{"quote":"“Leaders don't cry for what country can do for them for free. They dream about what they can do for country at high cost.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Tell me, who in this life, were never guided in course of their realization of their goal?” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Design and produce yourself according to your dreams” ― Bangambiki Habyarimana, The Great Pearl of Wisdom"},{"quote":"“Leaders walk their talks. They don’t give theories that do not work. They have clarity into their dreams and insight into their directions!” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“It’s is good you are about something. But wait and ask, “why and how?”. Without “whys and hows”, not every energetic movement can be called progress.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Greed squeezes your dreams into a portable size, so that failure can easily carry them to dump somewhere.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Leaders find something to die for, not something to live on. If you haven't found something to die for yet, you can't lead.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“May you climb higher heights.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Stop letting unnecessary thoughts feed your mind. It's nugatory. Focus on your long-time goals and maximize your 86,400 seconds today.” ― Korina Mercado"},{"quote":"“Their disbelief doesn't make your dream any less true. You're a dreamer. And will be. Forever.” ― Sarvesh Jain, Naked Wisdom of the child"},{"quote":"“With all your heart, reach out to your divine-dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“While defending your Dream from Competing Opportunities, always be guided by your Valuesrather than perceived necessities” ― Manoj Arora, Dream On: Every setback is a little nudge from HIM to Dream On"},{"quote":"“Because of fear, most people don’t dream big. Because of fear, even those who dream big do not start working on them. Because of fear, those who start working on their dreams end up quitting too early.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“If you give up on a big dream too early, you have probably stepped on gold and mistook it for a rock.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“There is no limit to life. The only limit is the limit you put into life.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Live in your dream. Refuse to wake up until it is completely over. Then dream again.” ― Bangambiki Habyarimana, The Great Pearl of Wisdom"},{"quote":"“Imagination is an endless possibility.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Knowledge is learning without a limit.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You have to dream big to get big.” ― Sherman Alexie, The Absolutely True Diary of a Part-Time Indian"},{"quote":"“Timeless resources exist, if you will ask the Creator.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“The bigger the dream, the better the story.” ― Richelle E. Goodrich, Making Wishes: Quotes, Thoughts, & a Little Poetry for Every Day of the Year"},{"quote":"“What we believe in our heart, we must declare with our mouth.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“With persistent focus, commitment and enthusiasm, your dream will be reality.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“The grace of fulfilled dream is phenomenal.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“May you find the might, the power within you, to eagerly reach out to your dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“We were created for something higher than ourself.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You can pursue your dreams by grace.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“I don’t mind failing because that means I’m trying. But giving up, now that’s something that I’m just not willing to do. I will continue to try and try again. I will keep my peace, stay focused, and know that my time will come. My positive attitude will not depart me. I will hold it close and keep on striving, knowing that what’s meant for me, will be. Nothing and nobody can stop it! My dedication and hard work won’t fail me, but most importantly, I won’t fail myself. I’m a winner and I’m a fighter! I don’t allow challenges to stop me.” ― Stephanie Lahart"},{"quote":"“We can achieve our goals either by human effort or by the power of God. The dependence on God’s power is the best choice.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Dare to dream.Dare to reach beyond the stars.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Encouragement fuels great strength and great achievement.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“The greatest success is to live the life of your dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You ought to dare impossible things. These will be possible by ceaseless reliance on a higher power.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Every great dream, meet an opposing views.The certainty within our spirit made the dream reality.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Thy word O Lord is my great hope.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“We can accomplish great things by God’s grace.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Faith in God gives self-confidence.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Desire, dream and seek.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“I will pursue my dreams wholeheartedly.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Whatever you dream of, be bold and pursue it.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“We will never fail. We shall fulfil the dream.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You can reach higher heights by faith.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You must live the life of your dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Motivation enhances human worth and potential.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Too many people spend their life in fear of making a mistake. However, here is the truth: Fear is the mistake. If you block out all the doubts and listen only to what you feel in your heart, then follow that course, you waste less time in indecision and spend more time being authentic. Life is too short to settle for parttime happiness.” ― Shannon L. Alder"},{"quote":"“If your dreams don't scare you, they are not big enough.” ― Lorde"},{"quote":"“If life gives you a passport size dream, don't frame it... Order for a reprint... Go for the bigger picture of you! You deserve a bigger and bright image of you... Go and soar like an eagle!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“God holds the right key to every door.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“In the end, one detail is unarguable: There will always be those searching for treasure. Never forget: We are a country founded on legends and myths. We love them, especially legends of treasure. Looking for treasure isn't just part of being an American, it is America.” ― Brad Meltzer, History Decoded: The 10 Greatest Conspiracies of All Time"},{"quote":"“You are capable of anything. Dream great dreams.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You have to want your dream enough to pursuit it.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Be confident, be courageous!” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“I will pursue the dream, no matter how long it takes to fulfil it.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“It is the possibility of the dream, which quickens my spirit to take action.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You can do it. Go ahead and pursue your dreams.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Imagination is a reality.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“One main reason why most dreamers cannot take their dreams off the ground is that they keep their ideas to themselves alone. The fact that you think you can make it alone is the first step to your failure!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“The circumference of your breast may change; the shape of your hips may change; the size of your pants may also change. But your life never changes unless your thoughts, your plans and your actions change! Think big things!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Leaving your dreams and living someone's dreams is like dipping a pole into a pool to catch a weaver bird alive! It doesn't work that way... Pursue what God sent you for!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“You are capable of much more than you envisage.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Believe, believe and it shall be!” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Reach out to your great spirit and soul.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Be daring, be determined!” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“What you desire is what you attract to yourself.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Imagination is a glorious wonder.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“New dreams are like new wines; they grow sweeter over time. With patience, you will be able to climb your spiritual, financial, academic, marital and social ladders in Jesus' name!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Go forward and accomplish your God-given goals.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Dreams are the greatest imaginative power of mankind.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Dream Big! Never apologize for it!” ― Mrs.Mignon T.Padilla"},{"quote":"“Beware of those who love to give advice, but never want to receive it!” ― Mrs.Mignon T.Padilla"},{"quote":"“I would give up, but that will teach my kids that it's okay to be a failure and I refuse to ruin their lives like that!” ― Mrs.Mignon T.Padilla"},{"quote":"“I work with great gladness for what I want.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“What a great pleasure to work for your living?” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“I am so glad; I had the opportunity to study at University of Jena, the city of light.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Before God put that dream into you, he did not ask for the approval of anybody... It means anyone who tells you \"it's impossible\" is not from God!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“The dreams you have that may meet mockeries from the lips of negative people will yield the success that will squeeze tears from their eyes later! Dare to resist every negative criticism and persist to make it happen!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“You know what happens when you slide your cheek on the edge of a sharp razor blade? Yes! That's how it feels when you slide your dreams into the palms of toxic and negative people! Save your dreams from defamation and disfigurement!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“If you cannot see the rainbow because your face is down, don't argue that no rainbow is up there. Lift up your passion and take your dreams off the ground!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“The deeper the difficulty in fulfilling a dream, the brighter the outcome of its fulfillment and the sweeter the celebration thereof. Persist to the end; don't give up!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“We are all capable of being great dreamers. We must awaken the divinity within us.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Negativity may misguide a person to see daylight as moonlight; and then he goes to sleep instead of rising up to work. No every irresponsible act is caused by laziness; negative attitudes take a bigger share!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“You must passionately pursue all your dreams.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Think outside the box; if possible, think as if there is no box. Aim high, above the ceilings; aim as if no ceiling can limit you. Dream big!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Arise and pursue your dreams.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“We can make the dream come true” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“I am living my dreams.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Never allow anyone to stop you from pursuing your most cherished dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Every idea, both good and bad will definitely have an opposition. The fact that someone mocks your ideas and dreams does not mean they are bad. Take note!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“When you have nothing to show up for having lived for many decades, you are likely to borrow other people’s credibility which won’t fit! Live like you!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Your doubts do nothing than pouring cold water on your enviable dreams. Just keep doubts away from you and you will not dilute your success story!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“One more action to transform your dreams, one more passion to reform your brand; give one more trial and you’ll never regret your willingness to hold on!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Don't fall flat to deception; thousand criticisms can never drift your dream through one millimetre unless you give them the audacity. Be in-charge; you are unstoppable!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Take only actions that matter; some actions have weight but do not occupy space... some occupy space and also have weight! You matter; do what matters! Let your dreams count; DREAM BIG and be of VALUE…!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Go ahead and pursue your God-given dreams.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“If you have a dream as a child, but you let it go cold, you will grow old only to realize that you have sold your gold for no royalty!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“The difference between a successful and an unsuccessful person is that, one has preserved his potentials while the other has processed his own!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Most times, success does not come as tiny droplets of showers freely falling on every roof; it comes in heavy flows like a stream. Use the bigger dream barrels!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Success is not in the possession of multitudes of dreams; it is in the art of processing dreams into multiple realities!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Don't stop learning. A time will come when your dreams will go global and you will turn and laugh at how local you've been. Start local anyway!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“I find dreams of this type to be one of the wonders of the world and the human race. It is a miracle what can be built from a dream with nothing but two hands, and honest heart and ambition. Education is very important too, but even that is unnecessary if the dream is of sufficient strength and the cause is sufficiently noble and interesting to the individual.” ― Karl Kiekhaefer"},{"quote":"“Day by day, there exists the possibility for the dream to come true.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“We wonder with our thoughts.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“The world of possibilities surround you, if thy will look.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“DEPORT yourself from the coast of negative attitudes and you will give your dreams a lift up from a level of high concentration of repeated failure to an indelible success! God is with you!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“We are capable of great works through the mighty power of the Holy Spirit.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Those who find courage to pursue their dreams, manifest gladness of the soul.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“God doesn't create imitations, so He designed you naturally. It’s ungratefulness to dream of putting on unnatural self. You have no right to fake God’s design!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“Some people are murderers of their own gifts. They wait and see their dreams suffer from deficiency of actions. The end result is that the world is robbed as they baggage their dead dreams for the cemetery!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“Encouragement is a fire of flame. It refreshes the soul and revives the spirit.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Adventure begins with a thought, decision and action.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“If you believe in your dream with all your heart, you can achieve it.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Every true leader is a true follower. Every true follower is a true leader. You are followed because of the dreams you pursue; you pursue others because of the dreams they follow!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“You become a leader when you believe in what you can do. The eagle believes it can soar; it doesn’t believe it can swim. The day the eagle will attempt to swim will be the day it will fail!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“Dream big and dare to make it happen. You have a heavy power; don’t misuse it carrying a paperweight load. Make it big!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“Life is a dream so dream big!” ― Debasish Mridha"},{"quote":"“Once you have the vision and the passion to make it happen, you will achieve your dreams. It is up to you to decide when to make it happen; attitudes guide you to answer that!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“My wish is to create a huge library of books.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Dream high and exceed your expectations.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You are never late in the pursuit of the dreams. Once you recognised your dreams and visions. You must reach out passionately to fulfill them.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Leaders create a conducive environment for followers to accomplish their respective dreams. True leaders never fall for anything inferior!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“Lack of courage is what makes big dreams to sit in the ink of the paper instead of them running in the shoes of actions. Without courage, you remain a dreamer!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“If you can dream it, you can make it a reality. The possibility lies in your ability, enthusiasm and hardwork to realise it.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“I admire successful men and women who endured and overcome unusual circumstances to fulfill their dreams.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Make it a promise to be all that you must be. When you dream of reaching the 100th step; take the 99th as the beginning of your journey and you will go beyond the 101st!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“You can drive in your imaginations to make a tour to your future, visit it and see all kinds of good things hiding in there. But you have to take bold actions before you can truly relocate into what you see!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Think about what you are passionate about. Dream about it. Write it down. Read it always. Now, live it. Whatever you are passionate about will directly lead you to your purpose!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“The worst to ever happen to a person who aims at the sky is to fall on the tallest mountain; the best that can happen to a person who aims at the ceiling of his room is to fall on the carpet of his floor!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“Dare to take chances; there is no limit to the opportunities waiting for you.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Holy dreams.Holy decisions.Holy choices.Holy actions.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“When we write down our dreams we transform what we imagine into reality.” ― Gina Greenlee, Postcards and Pearls: Life Lessons from Solo Moments on the Road"},{"quote":"“The pursuit of our dreams is not without any difficulty. Those who triumph have learn’t to overcome the difficulty.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Great God of wonders, the Creator of all dreams.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“He who want to be great must first be a servant.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“In every step you take, keep your feet firmly on the ground.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Successful people are defined as ordinary people who never gave up on their dreams and passion is the secret of that persistence!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Think pleasantly;Think of how beautiful you are.Think of the families you are blessed with.Think of the dreams you have to achieve.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Don’t underestimate the dreams everyone has; you have no knowledge about the one that would later marry your own. Be each other’s keeper and know that beautiful dreams date only beautiful dreams!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“You can’t believe in your dreams if you don’t believe in the giver of the dreams. In all things, put God first. He is willing to put you ahead for excellence!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Hope is the believe that the promised will be fulfilled.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Build a solid courage behind what you believe you can do. Your dreams may drift and fall, but when your courage is strong and still, you can’t shift; you’ll lift your dreams again!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Research; the quest for in-depth knowledge and wisdom” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Your young, sitting back thinking about your future, you feel heavily in your heart your desire to create your dream; no matter the tasks set before you. You hold that feeling; close to you, and you age. Your told to grow up, get a job and become successful in ways that will make someone else proud, whilst ignoring the ache inside yourself. Truth is, we're all raised to conform; damn it our parents were raised to conform, but does that mean you have to, too? No, than unravel that long lost dream inside yourself and start to create a life from it, you'll walk alone for a while, you will break down every comfort zone you've ever known; slowly transforming into a being without one, and you know what..? even if it's going to be hard, possibly some of the greatest hurdles of your time; one thing will feel certain- you'll never have felt so empowered in all your life.” ― Nikki Rowe"},{"quote":"“Design a life! Don't maintain it.” ― Shannon L. Alder"},{"quote":"“Passion towards a dream is the fuel that fires every trace of impossibility in the environment, paving way for you to win with style.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Dare to think the unimaginable, imagine the unthinkable, dream of that which will never happen, yet continue to aspire and to test the limits of your very being and those around you.” ― Mark W Boyer"},{"quote":"“Earnestly and persistently pursue your dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You have got what it takes to live your dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Keep believing.Keep trusting.Keep praying.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Decide to dream big dreams and make them happen. Never let procrastination and excuses squeeze your dreams to become small. Do it early and do it big!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“If you will reach your dream land as sooner as possible you have to leave everything behind and fix your eyes on one thing; the journey ahead!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“You came to the earth with loads of inspirations and influence. Dare to offload them out of you before you die. Give out all you carry along into the world and when you are ready to go back, go empty handed!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Put into actions what you dream of achieving. It'll amaze you to discover that you can do more than you ever dream of. Just give it a try! Never be idle, take actions now!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Dreaming great dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“My prayer; Lord,open my eyes to see good visions.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Don't allow the circumstances to stop you from pursuing your passion.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You have to be enthusiastic enough to do what is required for achieving your dreams and goals.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“I wish we lived in a world where we'd be able to survive off our talents not money” ― Jill Telford"},{"quote":"“Never let the words of discouragement from others sway you away from reaching far with your dreams.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“When life gives you a passport dream, order for a reprint. Try again till you have the bigger image. Be passionate you become the real you!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Spark the dreams you have with integrity and honesty. It’s gonna catch up with excellence if you make it revive in truthfulness in the midst of this world of falsehood!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“It feels great to know that whatever you need to achieve your dreams are in you. Whatever the spider needs to make a cobweb is not in the housefly. Look to yourself; you have what it takes to weave your success!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Imagination is divinity.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“If we never challenge our shortcomings, we ensure that they remain our Achilles' heel.” ― Gina Greenlee, Postcards and Pearls: Life Lessons from Solo Moments on the Road"},{"quote":"“Your local dreams contain global elements; think global. On no account should you settle with a crowd when God has called you for multitudes! Dare to dream big!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Be determined that you will let every dream of yours be released to the fullest capacity. Brighten your picture!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Encourage yourself that you are good enough to be the owner of your own storehouse. Colour your world; redesign your mental pictures about yourself! Dream big and manifest the dreams!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Believe this, “the higher you go, the further you see” and also “the further you see the clearer you hear; “the clearer you hear, the wiser you become”!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“You don’t write a book when God called you to publish a library! You don’t plant a tree when God send you to cultivate a forest! You don’t evangelize to a crowd when God called you for a multitude! No matter the circumstances, find yourself doing something relevant and do it till all is well done!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Keep taking new paths to expand your horizon.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Change anything about your life that cannot be accepted. Accept everything about your life that cannot be changed and move on with your big dreams!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“You can do nothing you put your heart into it.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Your 'Ideal Parallel World' must be so grand that if you told it to 99% of your friends, they would laugh - some because they would think you were joking and some because they would think the goal impossible.” ― Kevin Michel, Moving Through Parallel Worlds To Achieve Your Dreams"},{"quote":"“Passionately desired, graciously received.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Visions are fulfilled in God's timing.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You can never have a successful end if you expect things to change as a result of miracles. Things will never change unless you take up the challenge to change them yourself.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“The only God who can lead you out of trouble when you are pursuing your dreams is the one who gave you that assignment. Neglecting him from your plans is tantamount to commitment of suicide.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Whatever you can think about, you can have it realized, provided you can work out the suggestions of your imaginations.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“God gave us imaginations because he wants us to see the photos of our destinies respectively and make proper graphical designs of them. You owe it to yourself to enlarge that image you carry into bigger sizes.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Man’s mind is a coast of great monuments, the source of wild and complex dreams and accomplishments that physical eyes have not seen.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“If you want to become a positive thinker, don't think lack, think abundance, for you and for everyone. Dream big; as bigger as the blue ocean. Become aware of your thoughts and you will be aware of yourself.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Become a positive person by seeing the bigger picture of whatever you dream of doing. Dream big and act big! It’s your time to have a bigger image of you!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Don’t forget, success is a product of choices. One of those choices is the willingness to make changes. Make changes and achieve your big dreams!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Be clear, conscious and circumspect about your dreams. Claim your blessings with your mouth.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Make good choices in order to manifest your true identity; manifest your true being. What others see in you now is just a mild photo of you. The wild copy is yet to come. Print that image; make it bigger!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Positive thoughts,Positive attitude,Positive action.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“when you create a lifestyle from a dream, you provide no room left; for failure.” ― nikki rowe"},{"quote":"“You can’t be a big dreamer if you don’t where you are going. You can’t know where you are going unless you first know where you are.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Money is not the priority. A step to dream big and planning of your dreams is a premier action that will see you through a start of your journey to success.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Talents are seeds of greatness. With big dreams well dispensed in form of achievements, you can pick money from people’s pockets and they will never get the guts to call you a thief.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“This is my calling.This is my destiny.I am living my dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Dream your dreams and go all out there to achieve it.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“To believe something and not live is like making fun of your abilities. You cannot be really trusted if you can dream and doubt its possibility.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Believe and acknowledge that God is the source of your big dreams, but not you!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Change the size of your dreams if that’s what’s keep you static. Go for bigger dreams, but start in a small way. See the bigger picture and live by the desire to become excellent!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“When the wounded were screaming, you dreamed of sharing a little house somewhere, of an ordinary life, of a family line, connection. All around him, men were walking silently with their thoughts, reforming their lives, making resolutions. If I ever get out of this lot... They could never be counted, the dreamed-up children, mentally conceived on the walk into Dunkirk, and later made flesh.” ― Ian McEwan, Atonement"},{"quote":"“Remember as there are people that can help you to roll the boat of your dreams, there are also people who can drill holes under that boat to make it sink.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Pick a mentor. Select and be closer to someone who is there to talk to you, inspire you, and be on you, monitoring your affairs and movements for the best reasons and ensuring that your dreams become fruitful.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“...dream BIG like a child!” ― Ken Poirot, Mentor Me: GA=T+E—A Formula to Fulfill Your Greatest Achievement"},{"quote":"“See the bigger picture of yours and refuse the passport size creature that people think you are! Your nature is large; go for it. Feel free to wake up and print your bigger picture!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“I am free to dream.I am free to love.I am free to write.” ― Lailah Gifty Akita"},{"quote":"“You can rise above any situation and achieve your dreams.” ― Lailah Gifty Akita"},{"quote":"“If you are determined to achieve your dreams, you must be ready to accept and affirm positive things about yourself. Affirm positively! Say positive things and encourage yourself that you can make it.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“The promise of a hopeful future is motivation for the pursuit of my dreams.” ― Lailah Gifty Akita"},{"quote":"“I believe most people are small dreamers because they dream about great things, however, they think those great things are going to come to them when they wait” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“How's daydreaming affecting nightmares?? Showing the light where is all dark!” ― Ana Claudia Antunes, Dearer Mirror"},{"quote":"“Dream big and see further! Sharpen your eyes; you have the eagle’s sight. Quicken your steps; you have the horse’s limbs. All that is a burden for others would be beaten several times by you!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Accept the fact that you are the pivot along which the loads of your efforts will turn. Acknowledge yourself as the chairperson at the center of affairs management for your dreams. Take the chair and be at the fore-front.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Don’t panic, you are never alone in building up your dreams. The storehouse of your success was built by the very supreme father who created it for you.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Success is guaranteed to those who dare to dream, are courageous enough to be devoted to their dreams, and have the determination to realise them. If you think you have these three qualities, then I welcome you to the club of SUCCESS!” ― Vishwas Chavan, VishwaSutras: Universal Principles For Living: Inspired by Real-Life Experiences"},{"quote":"“When the time comes for the fulfillment of the visions, all resources needed are made available by divine power.” ― Lailah Gifty Akita"},{"quote":"“You have to chase your dreams with all your heart.” ― Lailah Gifty Akita, The Alphabets of Success: Passion Driven Life"},{"quote":"“Dream big, you are powerful.You can exceed all your expectations” ― Lailah Gifty Akita, The Alphabets of Success: Passion Driven Life"},{"quote":"“We are to turn our backs for a space upon the insistent examination of the thing that is, and face towards the freer air, the ampler spaces of the thing that perhaps might be.” ― H.G. Wells"},{"quote":"“Don’t give up; try again. Be still and work it out till your good becomes the best! Dream high above the sky!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“If you don’t figure out your main reason of being born, chances are that, you will fall into another plan which is unlikely to make you to print out your bigger picture!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“What do you always think about? What do you think you can do easily? What do you find peace in your heart to do? Watch those things carefully because among them is something on which you can turn the entire environment surrounding you for your success.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Building up a dream is like building a room; the foundation must be deep, strong, firm and dependable.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Whatever you begin will see the light of day provided you can dream big and be a ruler over your dreams with persistent actions.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Prof. Christoph Heubeck said, \"Dream on, dreams can come true.” ― Lailah Gifty Akita"},{"quote":"“You must first dream, without worrying about how you will fulfill the dreams. There is a divine power that will attract the needed resources for the fulfillment of your dreams.” ― Lailah Gifty Akita"},{"quote":"“Y a pesar de que quizá alguien me llame loco o soñador, creo que en la vida todo es posible.” ― Nicholas Sparks, The Notebook"},{"quote":"“Life is filled with timeless opportunities. You need to seize every opportunity and make it great.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Dreaming is the art of thinking deep about who you want to be, what you are moved by your God-guided passion to do and what you are convinced to be the passion that moves the machinery of your body” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“You are an achiever, aim high.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Dream big dreams, but start small. A journey of thousand steps begins with a step.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Dreams do not bear fruits unless the weather conditions are favourable. Your positive mentality makes your dreams germinate; your actions make them to bear fruits. Take positive actions. Be positively minded.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Never give up.Never give up on your hopes.Never give up on your dreams.Never give up on your visions.” ― Lailah Gifty Akita"},{"quote":"“Before you accomplish your dreams physically, your inner make up, mindset, emotions and perception have fought the battle mentally and that already determined how the battle will be fought physically.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“No dream is too big to come true.You are born to manifest the glory of God on earth.” ― Lailah Gifty Akita"},{"quote":"“Know that dreaming is a waste of sleeping time and energy if you don’t wake up to achieve them.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Be positive with every idea surrounding your dreams. Think about the possibility of what you plan to do and approach it with an optimistic action. Stay positively.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Be determined.You can make it in life.You can make all your dreams come true.” ― Lailah Gifty Akita"},{"quote":"“Be conscious of the global elements in your dreams. When starting local, dream of taking it global sooner.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Break away from the box confining you. Positive dreamers do not follow the status quo. They keep raising the standard of the bar higher and higher. Raise the bar.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“All my dreams will be fulfilled at the proper time.” ― Lailah Gifty Akita"},{"quote":"“Believe in God.Believe in Jesus Christ.Believe in the Scriptures.” ― Lailah Gifty Akita"},{"quote":"“Be prepared before you set off to work on your dreams. Prior preparation is success divided by half. The more prepared you are, the easier your success. Set off.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Keep dreaming,Keep hoping,Keep lovingKeep giving,keep motivating,Keep forgiving,Keep praying,Keep tithing,Keep sharing your testimony.” ― Lailah Gifty Akita"},{"quote":"“Live your best life.Live your dreams.” ― Lailah Gifty Akita"},{"quote":"“I can see clearly my visions.” ― Lailah Gifty Akita"},{"quote":"“All dreams are possible.” ― Lailah Gifty Akita"},{"quote":"“Keep dreaming, dreams have no limit.” ― Lailah Gifty Akita"},{"quote":"“Dreams appear as seeds that when planted, must become a forest reserve.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Don’t think about those who are not doing it. Focus on your dreams, goals and actions and make sure it is done well.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“I will keep dreaming.My dreams have always come true.It is a great excitement any time a dream is fulfilled.” ― Lailah GiftyAkita"},{"quote":"“Personal branding for dream fulfillment often comes like the process of building castles. You have to be attracted to the construction work carefully, consistently and passionately over time.” ― israelmore ayivor, Shaping the dream"},{"quote":"“Never allow your dreams to die. Hold on tightly to your most cherished dreams.” ― Lailah Gifty Akita"},{"quote":"“Life is a dream” ― Lailah Gifty Akita"},{"quote":"“Never underestimate the potential of your dreams.” ― Lailah Gifty Akita"},{"quote":"“Your dreams are expression of the scriptures.” ― Lailah Gifty Akita"},{"quote":"“Your dreams are unlimited possibilities.” ― Lailah Gifty Akita"},{"quote":"“Imagine the possibilities of your dreams.” ― Lailah Gifty Akita"},{"quote":"“Keep on dreaming, you will get to your destination.” ― Lailah Gifty Akita"},{"quote":"“Take your dreams off the ground to the clouds of business where your products will contribute to make the world a better place.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Watch your dreams and watch our friends. Take time and watch your friend again with sharpened eyes. Turn on your dreams again; watch them again; then watch your friends once more and know who to keep away and who to keep nearer!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“People who are achievers were once dreamers; but not all dreamers eventually become achievers. Before a person gets to become who he/she was meant to become, he/she must be responsible and take the necessary steps expected.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Most of the dreams that have suffered to death were murdered by their own owners.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Friends who mock your dreams are not qualified to keep dusting your door step with their footprints every time.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“You can't ever get too much of Paris.” ― Vicki Lesage, Confessions of a Paris Party Girl"},{"quote":"“Whatever you dream, you can achieve it provided it is the will of God for you. Once the Lord Jehovah is in approval of it, just dream it; He placed the power in you to do it abundantly!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“People are eager to walk in other people's pair of shoes that does not fit them. The result is that, their dreams begin to imitate a \"tortoise\" walk and that I guess is already uncomfortable!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Your dreams are your solid rock; all other dreams are sinking sands! Recreate Your World and I believe you can!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Be passionate and enthusiastic about your dreams.Take a persistent action towards the fulfillment of your dreams.” ― Lailah Gifty Akita"},{"quote":"“The only limit on your dreams is your imagination.” ― Lailah Gifty Akita"},{"quote":"“Just get it right, “it is not too late to dream”. You can do it now! This very moment, I mean right now! Let’s begin!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Before a dream can mature and manifest itself as real, a lot of loaded efforts come into play! You are the pivot on which those loads must be turned!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Dreams can either die young or mature to become realities depending on how they are handled!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Discover more about yourself, dream wild dreams because what others see in you right is just a mild chapter of you; the wild chapter will unfold sooner! Dare to dream and shape the dream every day!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“To shape a dream well, understand that it is going to happen through processes in which your hands must get on board. It takes your own responsibility to get the best dream shape” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Hopelessness is advance failure in a disguised envelope. People are crippled to have bed-ridden dreams just because they don't believe they can take progressive steps with those dreams.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Choose a good attitude and that is the key to making great impacts! Never be fooled to follow the wrong direction; you dreams will be alive and grow into success!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“There is a divine grace available for you to accomplish far greater things than you could ever imagine nor dream of.” ― Lailah Gifty Akita"},{"quote":"“Your dreams today are answers to what you are to do, where you are to go and what you have to say in later days of your life.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Billions of dreams die off every year. I believe yours will not be part of that proportion if only you are ready to shape them!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“You have to accept and agree with this short notice that “having a dream is different from fulfilling a dream”. “To have a dream” is just a bargaining process; “fulfilling it” is the real purchasing hour!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“As far as it’s ideal that you get helped by people, it doesn't mean they are compelled to make your dreams come true without your efforts.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“The desired shape your dreams take is directly proportional to the practical presentation of the theoretical skills that you have learnt.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“The desired shape of your dreams is different from the supposed shape of another person’s dream. When shaping your own, you may watch the process of another person’s dreams, but keep eyes away from the destination.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Every great building once begun as a building plan. That means, sitting in that building plan on the table is a mighty structure not yet seen.It is the same with dreams.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Every great building once begun as a building plan. That means, sitting in that building plan on the table is a mighty structure not yet seen. It is the same with dreams.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Keep dreaming.If you stop dreaming, you stop living.” ― Lailah Gifty Akita"},{"quote":"“Get tuned in to the goals created from each dream and stay focused. You might miss the goals if you are not focused.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“I agree that dreaming in not a crime, so I can dream as big as I can.” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“It is a good initiative for the dreams that would change one society to be nursed in another environment, before being transplanted to strive in its original environment for the change process to begin!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“Your Heart's Desire is the Voice of God, and that Voice must be obeyed sooner or later.” ― Emmet Fox, Power Through Constructive Thinking"},{"quote":"“Don't be discouraged by people who tease you out of your dreams. What you have in your heart is bigger than what they have on their lips!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Dream big!But not so big that it becomes a mess, and you may never reach reality.” ― Hasil Paudyal"},{"quote":"“Dare to be different. Dare to accept yourself for who YOU are. Dare to live your life without limits. Dare to follow YOUR dreams. Dare to explore, experience, and make mistakes. Dare to live your life without being afraid. Live, learn, and grow. It’s your life! Make every decision that you make count for something. Always know your value as a person and don’t allow anybody to make you feel anything different. You may have to stand alone at times, but don’t be dismayed. There’s something special about you! Allow yourself to shine and dare to do the unknown.” ― Stephanie Lahart"},{"quote":"“You may be tempted to regret being born when you are made to watch the videos of just what you will go through to achieve your dreams... But you are highly likely to wish you can live and live again and again if the size of your purposeful achievements is shown to you! Live on!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“One of the critical factors that make people’s dreams become nightmares is that they don’t know there is a cost to be paid!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“This is for you, for your breath, whose absence would lessen a greater world.” ― Shaun Hick"},{"quote":"“I believe in dreams.I believe infinite possibilities for the fulfillment of my dreams.” ― Lailah GiftyAkita"},{"quote":"“It is better to risk starving to death than giving up on your dream. If you have given up on your dream, what's left?” ― Manoj Arora, From the Rat Race to Financial Freedom"},{"quote":"“Your intelligence enhances your ability to think and recollect, dream and set realistic goals. Your stamina is built on your passion for progress and willingness to excel... When you have a great stamina, you can make great impact even with a low intelligent quotient!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Take a daily action towards the achievement of your desired goals.” ― Lailah Gifty Akita"},{"quote":"“Live on no complex dreams... When the meaning of what you want to do isn't clear, it means there is absolutely no meaning! Simplicity with curiosity is the lap on which success rests!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“First learn to dream big, then the possibilities will follow by itself.” ― Yuikan Shirik"},{"quote":"“A dreamer must be discovered working or working on it or it is reduced to a wish.” ― Johnnie Dent Jr."},{"quote":"“Success is not reserved for a selected group of people who have silver spoons in their mouths. Those who have golden spoons in their hands can equally be satisfied by guiding their faiths to feed their dreams” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Your success lies behind your choices... To get there, you must choose it and drive your dreams in that chosen direction!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Create time for yourself... There are 24 hours in a day... Outline the number to spend on your dreams every day!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Your sight takes you where there is light... But your visions can take you through the dark places! Maintain your sight, but add your visions!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“I believe that if markets were hidden deep in obscured places, it would definitely be impossible for some people to get there to make transactions! If you secluded yourself out of sight, your dreams cannot go that far!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“You must always reserve a question for people who think you are proud when you talk about your dreams! The question is \"how would they get to know that you are proud if you had not talked about your dreams?\" How then should people get to know what you do if you take delight in hiding yourself?” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“The earth is a planet that contains living things; I am a planet that contains living dreams! The earth revolves around the sun; I revolve around my passion!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Don't neglect the gifts in you. Power reserved is function suspended. The day you choose to switch on your passion is the day you will see your dunamis power in you. Be inspired!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“As a child, I used to wonder why markets in my locality were all situated near the main roads. I grew up a little to get the answer; “that business minded people can meet there easily!\" Your dream must be situated where they can meet people!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“untuk mampu berbagi saya percaya,bahwa saya harus kuat!!baik kuat secara kepribadian maupun kuat secara financial.” ― Faiz Triumph"},{"quote":"“Dream has no limitations.Never give up on your dreams.Dream your dreams and ask God's help.Anything is possible.” ― Lailah GiftyAkita"},{"quote":"“Dreams has no limitations.Never give up on your dreams.Dream your dreams and ask God's help.Anything is possible.” ― Lailah Gifty Akita"},{"quote":"“To reach greater heights, we must refuse the negative opinions of people and passionately pursue your destiny.” ― Lailah Gifty Akita"},{"quote":"“There are no more ceilings over my dreams... They have no limit; they limitless! They are extra-large!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Think big.Dream great dreams.Take action to realize your dreams.” ― Lailah Gifty Akita"},{"quote":"“You are capable of fulfilling all your dreams.” ― Lailah GiftyAkita"},{"quote":"“Good intentions might sound nice, but it's positive actions that matter.” ― Tim Fargo"},{"quote":"“Never leave the egg in you not laid. Don't leave the laid eggs there not hatched. You deserve the best; you were created to use every gift in you!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Great leaders are most wanted. They are most wanted for what they do with their gifts and talents. Their dreams are so unique in such a way that their presence becomes a source of hope and courage for others to thread on along. Why won't they look for them?” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“The consequences of giving up on your dreams are bitter than the causes of your intentions to give up. Don’t give up!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“When you are happy for other people's dreams, your dreams start jumping up with joy. Elizabeth was happy with Mary and her dream baby was jumping in her womb crazily for joy!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“The deeper your thoughts, the clearer your dreams. The clearer your dreams, the higher you fly. Decide to fly!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“You don't need to sit on a throne before you have the chance to dream; you don't have to feel fat meat in-between your molars to become a strategic dreamer. You can be a dreamer once you can think; dreams are germinate from imaginations; and survive through actions! Indecision weakens dreams; inaction kills them!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Let your vision be ahead of your sight! Dream beyond what you see and never let your environment determine the size of what you see in your convictions. If possible, dream about what does not exist and the good news is that “it is possible”; so go and do it now!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“The most secretive news that can make you to shake hands with great people is humility. Pride on the other way is a dream killer.” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Whatever dream God gave to you is for the comfort of those God keeps around you!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Not every dream grows on every land, so you got to watch out! “Sugar cane” dreams should find the environment where there is flooding of great ideas from great people. It will die off if it is planted at the place where the drought of discouragement is a well cherished culture!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“One major factor that will prevent your dreams from becoming nightmares is learning to vacate your spectators’ seat and then taking steps towards the players' bench! You've got to play to win!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Once you truly understand that it is okay to lose or fail, you are free, you have nothing to fear, and only then, can nothing in this world hold you back.” ― Yahya Mohamed"},{"quote":"“In one opinion, the house in which you stay, the church you attend and the town in which you reside may not determine the size of your dreams, but they can influence the rate of maturity of what you have planted.” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Stop blaming people for not making you to achieve your dreams. The question is \"are they the people having those dreams?” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“As far as it’s ideal that you get helped by people, it doesn't mean they are compelled to make your dreams come true without your own efforts.” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“For that thought to be strong, however, it must be free of doubt, for doubt weakens the will, weakens the response of the universe, and slows the manifestation of desire.” ― Stephen Richards, How to Get Everything You Can Imagine: Volume 1: How Mind Power Works"},{"quote":"“Hi Lady, Hi Woman.., all that Naomi had, all that Mary had, all that Esther had, all that Elizabeth had, YOU ALSO HAVE... Go, make your dreams come true!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Decision is the wing that makes dreams to go and grow and flow and fly. No decision, no fulfilled destiny!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Life is choice. You can choose to be who you dream to be or not to be. It all lies in the choice you make every day!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“The most thought to keep in mind is that \"players\" gain money at the end of each game while \"spectators\" lose it for a ticket in order to see the gainful players display their skills. Don't you want to keep watching your dreams or you want to get on the run with them?” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Never keep staring at the dreams you have on the paper... Don't just live like a spectator. You have the power, you have the mine, you have the skills, you can dribble your obstacles to get your goals moving to the other” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“For the sake of your dreams, don't create negative brands for yourself, else you scare away opportunities that are meant to be your turning point!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“You may cry out tears for misplacing your money, but you got to cry out blood if you have misplaced your dreams. Sadly, you may not even know the great deal of influence you loss when you misplace your dreams, so how will you cry for such a loss?” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Now-people” are winners; they say “now” and they do it now! That’s the spirit we need, my friends. If you have the goals and the environment is clear enough, go ahead and do it now!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“I agree and admit that thinking and planning are free. Nobody charges you for thinking and you pay no one to make plans. It's your decision!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“You are the steer of your God given dreams. By the authority from the Holy Spirit of God, you will able to bend a curve where the road has a bend; you will be able to reverse your movement when the need be.” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Great achievers are willing to die as hatrick dream scorers rather than to live as disappointed spectators! They keep the running to make it happen!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“There are no such words like \"over-dreaming\" or dreaming without \"biometric verification\". You can dream over and over again! You don't need a certificate to dream big!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Be humble and set the balls of your dreams rolling till God himself decides what next! As for \"pride\", allow it to go as a lone ranger!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Don’t say you don’t have enough time or enough money to change the world. You have exactly the same number of hours per day that were given to Helen Keller, Gandhi, Michelangelo, Mother Teresa, Leonardo da Vinci and Jesus Christ.” ― Shannon L. Alder"},{"quote":"“If you don't build your dream, someone else will hire you to help them build theirs.” ― Dhirubhai Ambani, Against All Odds: A Story of Courage, Perseverance and Hope [Paperback] [Jan 01, 2008] Dhirubhai Ambani"},{"quote":"“Don't settle for anything less. Rise up and optimize your talents through strategic thinking and big dream. Your God should be your guide in all things.” ― Israelmore Ayivor, Michelangelo | Beethoven | Shakespeare: 15 Things Common to Great Achievers"},{"quote":"“Most castles in the air are never built. But Walt Disney's was.” ― Eve Zibart, The Unofficial Disney Companion"},{"quote":"“To dream\" means to focus and zoom the photos of destiny called visions for clearer view, manipulation and exploitation.” ― Israelmore Ayivor"},{"quote":"“Many people who became successful were once first time global failures. But because they didn't give up on their dreams, failure could not sink them. They triumphed at last!” ― Israelmore Ayivor"},{"quote":"“You can't be creative without criticism. If your life is without critics then maybe you are painting your life's masterpiece with only a broken brown crayon.” ― Shannon L. Alder"},{"quote":"“Passionate people are always ready to stand for their dreams even if no one stand with them. They vote and vote alone for their dreams but never loss their nomination for excellent leadership!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“The fittest person survives! The fighting man succeeds! He who Fights to Fit, will Survive to Succeed!” ― Israelmore Ayivor"},{"quote":"“You were not created to come to this earth and say \"me too I came to live some\". You were create to make a difference!” ― Israelmore Ayivor"},{"quote":"“The kind of soil in your area determines the type of crop you will plant to harvest; The kind of potentials in you will decide the type of success you will celebrate.” ― Israelmore Ayivor"},{"quote":"“Big dreams are marathons. Passionate actions are marathons of marathons! Waiters don't deserve it; Quitters don't get it!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Your potentials are called POTENTIALS because they are POTENT. Don't make them IMPOTENT by being IMPATIENT. Make an IMPACT\".” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“The mass of your visions depends on the size of your dreams and distance they can cover within a given period of your life.” ― Israelmore Ayivor"},{"quote":"“A dream is the frame or portrait or a construction or focus of one's vision by means of perception, based on what he or she knows and settles within via strategic thinking.” ― Israelmore Ayivor, Michelangelo | Beethoven | Shakespeare: 15 Things Common to Great Achievers"},{"quote":"“The density of your destiny is the product of the mass of your visions and the volume your impacts occupy!” ― Israelmore Ayivor"},{"quote":"“Your dreams are like the cement. If you water it with actions, it becomes a hard concrete mass. But if you leave it exposed and unwatered, the air will easily blow it away!” ― Israelmore Ayivor"},{"quote":"“Accomplish your tasks by one step at each time. Don't cut your coat according to your elder brother's size. Dream big, but start small; do what you can do at a time.” ― Israelmore Ayivor"},{"quote":"“You may have the greatest vision, plans or goals as you may term it. You can call it Vison 2020, Vision 2045 or whatever. But remember, not work is done unless a distance is covered!” ― Israelmore Ayivor"},{"quote":"“If you truly want to pursue and achieve the success you were created for, you must recognize the role of vision, the significance of dreams and the power of actions without which you are just making a living.” ― Israelmore Ayivor, Michelangelo | Beethoven | Shakespeare: 15 Things Common to Great Achievers"},{"quote":"“When all your efforts are channeled through a common canal for progress, no condition can alter a single sentence of your success story! Dream it; Drive it; Be in focus!” ― Israelmore Ayivor"},{"quote":"“We live for our unfulfilled dreams when we are alive. Our fulfilled dreams live for us when we are gone!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“If you want your dreams to work out for you, you must work with them. Pay the price and have the package of your accomplishments in full versions.” ― Israelmore Ayivor"},{"quote":"“Never abbreviate your dreams. Only short-hand people always do that. Their punishment is that they can't stretch far, further and forward into the future. Dream only big dreams!” ― Israelmore Ayivor"},{"quote":"“Do not let fear keep you on the sidelines. Your number has been called, get in the game! It is your time to shine.” ― E'yen A. Gardner"},{"quote":"“You have been complaining so long about your labour pains. It's time to show us your baby! What at all have you been dreaming about that long? Let's see it and give it a name!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“There are no big men and big women. There are small people with big dreams and extra larger passion!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“A man of vision cannot question his potentials. He does not doubt his capabilities. He keeps going because he had seen himself gone already in his visions.” ― Israelmore Ayivor"},{"quote":"“By perceiving the end of those illusive ideas and statuses as real, see yourself as though you have already accomplished what you have had a revelation to do. Then go, make it happen.” ― Israelmore Ayivor, Michelangelo | Beethoven | Shakespeare: 15 Things Common to Great Achievers"},{"quote":"“If you have a plan and you don't even SHOW IT, you are just like someone born to be great and don't even KNOW IT.” ― Israelmore Ayivor"},{"quote":"“True leaders are willing to die for their dreams. They don't oppress with ignorance; they impress with visions\". They live like Martin Luther King Jr, Nelson Mandela...” ― Israelmore Ayivor"},{"quote":"“What others see in you now is just a MILD chapter of you; the WILD version of your brand is yet to be visible. Just dare and will show up!” ― Israelmore Ayivor"},{"quote":"“Multiply your potentials with your plans and it will be equal to your purpose of existence. Your potentials are your seeds of greatness.” ― Israelmore Ayivor"},{"quote":"“The best way to easily identify a counterfeit currency is to have a full exposure to the original currency. If you don't know your true vision, any satanic vision can cross your way and you might not know it.” ― Israelmore Ayivor"},{"quote":"“Let your dreams be as litmitless as the circumference of the entire universe. The police service does not prosecute people who over-dream. Never nail yourself to the narrow cross. Dream big!” ― Israelmore Ayivor"},{"quote":"“In your daily life, let your destined visions be farther than your gifted sight and your ultimate joy be vibrant than your demeaning worries. Think big, dream big.” ― Israelmore Ayivor"},{"quote":"“Me: I am very busy now. Can you please excuse me for few minutes?She: Oh ok. But why are you sweating all over your body?Me: I am very busy, that is why. I am dreaming extra-large dreams.” ― Israelmore Ayivor"},{"quote":"“As long as the constitution of my country is not amended to cut down the sizes of the dreams of its citizens, I have the freedom to dream extra largest dreams. I am even dreaming over-size dreams now.” ― Israelmore Ayivor"}]
