[{"quote":"“At one point, approximately halfway through her remarks, Merkel stated in German something about ‘being able to greet the president of the United States of America, Barack Obama,’ and an overly ambitious Obama, who perhaps thought that was his cue, headed toward the podium. Perhaps catching the president’s movement out of the corner of her eye, Merkel thought quickly, and without even looking up from her notes, she told the excited American president, in English, ‘Not yet, dear Mr. President, dear Barack Obama.’ Obama sheepishly returned to his seat to allow the chancellor to finish her speech.” ― Claudia Clark, Dear Barack: The Extraordinary Partnership of Barack Obama and Angela Merkel"},{"quote":"“In her usual manner, Merkel spoke in German. It is worth pointing out, however, that before the translator had an opportunity to convert her statements to English, Obama gave the chancellor and the press a big smile, saying, ‘I think what she said was good. I’m teasing.’ The laughter in the room drowned out the sounds of the cameras clicking and flashing, with Merkel’s giggle and smile among the loudest.” ― Claudia Clark, Dear Barack: The Extraordinary Partnership of Barack Obama and Angela Merkel"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“To those peoples in the huts and villages of half the globe struggling to break the bonds of mass misery, we pledge our best efforts to help them help themselves, for whatever period is required - not because the Communists may be doing it, not because we seek their votes, but because it is right. If a free society cannot help the many who are poor, it cannot save the few who are rich.” ― John F. Kennedy"},{"quote":"“This could be my Everest, man—no, no, even better. Hacking a military AI? Wow, man, that’s like, that’s like going to Mars, dude, yeah, like Mars!” ― Guy Morris, Swarm"},{"quote":"“Few remembered the stories of the days before the end of the Second Age. Those days when all the lands had been under the control of the Council of Five were now wrapped in legends and seemed like fantasy.” ― Robert Reid, White Light Red Fire"},{"quote":"“War is not just the shower of bullets and bombs from both sides, it is also the shower of blood and bones on both sides.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Each man calls barbarism whatever is not his own practice.” ― Montaigne"},{"quote":"“Even the brightest human minds require a mentor to guide them. The assumption that an AI can teach itself by simply absorbing random information is ludicrous. If we want a computer to think like a human, we should train them as one.” ― Guy Morris, Swarm"},{"quote":"“First, she had been unconsciously absorbing this virginity rulewithout ever questioning it. Second . . . it struck her that virginity was a male fetish wrapped tightly around another male fetish called “purity.” Emma was certain that whoever originated the concept of virginity was a man.” ― Kwei Quartey, Last Seen in Lapaz"},{"quote":"“Capitalism and communism were two sides of the same coin of control. Control the capital and you control the economy. Control the economy and you can control the people.” ― Guy Morris, Swarm"},{"quote":"“A prison cell of silver and silk is still a prison, isolating and solitary.” ― Guy Morris, Swarm"},{"quote":"“I would say that introverts make some of the best international philosophers. The less common attribute of the introverted lifestyle - a close societal connection, as such a connection disappears or changes in relevance as the currents of the winds change - leaves too much room for one's own cultural bias. Instead, introverts tend to turn inward, the laboratory of being and all its forms. This is the most accurate study of the individual human being, which is in turn, rather than those affected by cultural limitations, the most universal reflection of human understanding and human behavior.” ― Criss Jami, Killosophy"},{"quote":"“So then, a test for singularity would be the point at which an AI can create another viable and conscious AI. Singularity must include not only intelligence, but also self-awareness, self-determination, and self-conception.” ― Guy Morris, Swarm"},{"quote":"“That's the positive aspect of trade I suppose. The world gets stirred up together. That's about as much as I have to say for it.” ― Isabel Hoving, The Dream Merchant"},{"quote":"“Never do anything local or insignificant” ― Sunday Adelaja"},{"quote":"“Fun trip, good company!” ― Steven Magee"},{"quote":"“The Ukraine war is great for the profits of international weapons suppliers.” ― Steven Magee"},{"quote":"“Balance life's stressors with life's pleasures.” ― Norene Moskalski, Nocturne, Opus 1: Sea Foam"},{"quote":"“The USA reminds me of the school bully. Their school is the international community.” ― Steven Magee"},{"quote":"“Wären die Hitze und die architektonischen Entgleisungen Antoni Gaudís nicht gewesen, die daran erinnerten, dass man sich tatsächlich in Barcelona befand, man hätte meinen können, wir wären gar nicht verreist. Die Trams waren von derselben schnittigen Bauart wie zu Hause, in den Cafés saßen Freelancer mit ihren dickrandingen Brillen an Notebooks und Lesegeräten, die sich so geheimnisvoll und so magisch mit dem Zeigefinger auf dem Display bedienen lassen. Im Taxi vom Flughafen erspähten wir auf der Autobahn ein Schild eines Möbelgeschäfts, das uns sehr vertraut war. Die kleinen weißen Plastikkarten, die die Schlüssel in Hotel abgelöst haben, glichen vollkommen denjenigen in Wuppertal oder Frankfurt, selbst die Toilettenschlüssel und Armaturenbretter im Badezimmer waren vom selben Fabrikat wie in meiner Wohnung. Das womöglich allerletzte Disinktionsmerkmal des Südens gegenüber dem Norden, schien es mir, war die deutlich höhere Verbreitung des Bidets.” ― Adam Soboczynski, Das Buch der Laster"},{"quote":"“The Ukraine war is surprising. Russians killing past Russians in Ukraine. It just seems so bizarre! It is basically a territorial civil war that has been turned into an international proxy war.” ― Steven Magee"},{"quote":"“International responses to refugee crises cannot get by on being well-intentioned: they need to be smart, too.” ― Alexander Betts, Refuge: Transforming a Broken Refugee System"},{"quote":"“It seems international USA war bases just cause unrest in the world.” ― Steven Magee"},{"quote":"“Borders are imaginary, but people are different. As nations are separated by invisible lines, humanity is united by diversity.” ― Dr. Lucas D. Shallua"},{"quote":"“The fusion of politics, business, and entertainment may create headlines, but a sustainable solution to international disputes requires a deeper understanding of the underlying issues.” ― Dipti Dhakul, Quote: +/-"},{"quote":"“It feels like going home, same as always, and opening the door to find all these people there: someone who feels like an old friend even though we’ve never met, someone who means the world to me but I can never see again, somebody crying, somebody laughing, people from far away—and I’m there, too. We don’t talk about anything special, but we’re all there, just sharing time.” ― Mieko Kawakami"},{"quote":"“Mental illness is an international crisis!” ― Steven Magee"},{"quote":"“It angered her all her life that immigrant food always had to be cheap. Tacos, papusas, dumplings, pho, gyros, kimchi, pad thai... she could keep going. These were all foods worthy of double digits. Of dignity.” ― Carolyn Huynh, The Family Recipe"},{"quote":"“Malaysia Student Visa Application: Step-by-Step Guide for International StudentsFor thousands of international students, Malaysia has become one of Asia’s most attractive higher education destinations. Known for its globally ranked universities, affordable tuition fees, and multicultural environment, it offers an enriching academic experience. But before you begin your journey, the most important step is completing your Malaysia student visa application.If you are preparing to study in Malaysia, this Malaysia student visa guide will help you understand the application process, requirements, and timelines — ensuring a smooth transition from admission to arrival.Why a Student Visa is ImportantThe student visa, officially known as the Student Pass, is issued by the Malaysian Immigration Department through the Education Malaysia Global Services (EMGS). It allows you to reside in Malaysia legally while pursuing your studies. Without it, you won’t be able to register with your university or begin classes.That’s why submitting a Malaysia student visa application correctly and on time is critical.Step-by-Step Malaysia Student Visa Application ProcessHere’s how the process typically works:University Admission – Apply and secure an offer letter from a recognized Malaysian university or college.Document Preparation – Gather all necessary documents, such as academic transcripts, passport copy, and financial proof.Submission via EMGS – Your institution submits the student visa application on your behalf through EMGS.Visa Approval Letter (VAL) – Once approved, you’ll receive your VAL from Malaysian authorities.Single-Entry Visa (SEV) – Collect this from the Malaysian Embassy in your home country before departure.Arrival in Malaysia – Complete the medical screening and get your Student Pass endorsed on your passport.Essential Documents for the ApplicationTo avoid delays, ensure your file is complete before submission. Common documents include:Valid passport with at least 12 months’ validityUniversity admission/offer letterAcademic transcripts and certificatesPassport-sized photos (as per format)Medical screening reportProof of sufficient financial supportHow Long Does It Take?The processing time for a Malaysia student visa application generally ranges between 4 to 8 weeks, depending on the completeness of documents and approval speed at EMGS. Students are encouraged to apply at least 2–3 months before the semester begins to avoid last-minute issues.Costs InvolvedVisa fees vary depending on your nationality, institution, and course duration. While the application itself involves EMGS processing fees, additional costs may include:Visa Approval Letter chargesHealth insuranceMedical examination feesUnderstanding these costs early will help you budget effectively for both tuition and living expenses.Checking Your Application StatusStudents can monitor their student visa application status online through EMGS or university portals. Regularly checking updates ensures you can act quickly if additional documents are requested.For detailed insights on monitoring and managing your visa journey, you can refer to this complete student visa guide.Final ThoughtsApplying for a Malaysia student visa might feel overwhelming, but with the right preparation and timely submission, the process is manageable. By following the step-by-step process, submitting accurate documents, and staying updated on your application status, you can secure approval without unnecessary delays.Your student visa is more than just a travel document — it’s your official gateway to a rewarding educational experience in Malaysia. From vibrant city life to globally respected degrees, Malaysia offers everything you need to shape your future.” ― dev panchal"},{"quote":"“We went on a Senate kiss-ass tour, but apparently, I have a genetic inability to pucker.” ― Guy Morris, Swarm"},{"quote":"“The desire Kayode thought he had conqueredthrough prayer had in fact gone nowhere. It had only hidden in the shadows.” ― Kwei Quartey, Last Seen in Lapaz"},{"quote":"“Why are people so evil to each other? We need to spread good in the world, not evil.” ― Kwei Quartey, Last Seen in Lapaz"},{"quote":"“I am black, I am white, and I am every color in-between.” ― Steven Magee"},{"quote":"“The building looked even more spectacular to Ngozi than it had in Femi’s phone pic. A pale cream rather than true white, it was two stories high with cappuccino trim and dark, reflecting windows. A central balcony overlooked the driveway.“Wow,” Ngozi murmured. “The White House.” ― Kwei Quartey, Last Seen in Lapaz"},{"quote":"“50 years of the Space Race has coincided with the rise of Autism.” ― Steven Magee"},{"quote":"“Is COVID-19 your final destination?” ― Steven Magee"},{"quote":"“Hello a year in Space, hello cognitive decline.” ― Steven Magee"},{"quote":"“Regarding the Thirty Meter Telescope (TMT) atop Mauna Kea, I am interested to know how much the international astronomy community has spent on advertising the biologically toxic project to the masses and how much has been spent on researching High Altitude Observatory Diseases (HAOD)?” ― Steven Magee"},{"quote":"“The global refugee crisis is indeed global. It isn’t a question of whether we should respond here (in the West) or there (at the crises’ points of origin), nor if we should address immediate needs or root causes. We can and must do all of the above.” ― Stephan Bauman, Seeking Refuge: On the Shores of the Global Refugees Crisis"},{"quote":"“I am an international kind of guy.” ― Steven Magee"},{"quote":"“One provision of the contract was that teachers could be fired 'with or without cause' for any reason, at any time, by either Glendale or IRI.” ― Alyssa Hadley Dunn, Teachers Without Borders?: The Hidden Consequences of International Teachers in U.S. Schools"},{"quote":"“There are foreigners in every nation, this is the beauty of internation community.” ― Lailah Gifty Akita"},{"quote":"“In every country, there exist international community.” ― Lailah Gifty Akita"},{"quote":"“Wird die Übertragung als allgegenwärtiges Phänomen jeglicher Beziehungen und Interaktionen betrachtet, so findet sie sowohl zwischen zwei Personen als auch Personen-gruppen oder Nationen statt. Die unbewussten Anteile der Beteiligten bilden einen weiteren Raum, in welchem sie in Kontakt treten.” ― Sarina Samaya, Radikal verbunden: Über traumatisierende Herrschaft und den spirituellen Aktivismus als Brücke zwischen sozio-politischem Aufdecken und mitfühlender Bezogenheit"},{"quote":"“Terrorprism is just multi faceted terrorism on multiple fronts.” ― Anthony T. Hincks"},{"quote":"“We deliver peace of Mind, Over a decades of Experience, Reef movers in dubai with almost 12 years of expertise in providing Relocation, Shifting & Removal services across dubai, sharjah, UAE or International, we at Reef Moving Company can guarantee you a safe, smooth and stress-free moving experience.” ― Reef Movers"},{"quote":"“As a researcher, I am curious to know the rates of masturbation aboard the International Space Station (ISS).” ― Steven Magee"},{"quote":"“Tyranny, like liberty, has no country; neither do exploiters nor workers” ― Luisa Capetillo"},{"quote":"“It is possible for USA citizens to apply for the eVisa and stay in India for 180 days with the travel document's multiple entries. Citizens of the United States can visit India on an Indian e-visa for recreation, business, and tourism purposes.” ― visacent"},{"quote":"“The next time I pass through the high altitude Denver International Airport in Colorado, I will be wearing a recording body camera for my own personal protection! The staff there are bizarre!!!” ― Steven Magee"},{"quote":"“Researching the effects of high altitudes on police officers was not on my radar until I had a negative experience with them at the high altitude Denver International Airport.” ― Steven Magee"},{"quote":"“I have survived the high altitude ‘Denver International Airport Police’ experience!” ― Steven Magee"},{"quote":"“The techniques I developed to control potentially dangerous encounters with police officers and how to deescalate the situation by calling 911 were put to the test in the high altitude Denver International Airport in 2022. I was successful in controlling the situation and I walked away without being touched or charged by the three police officers involved. I filed a complaint regarding the unfortunate encounter afterwards to protect future airport travelers there.” ― Steven Magee"},{"quote":"“Working and socializing with international people was prevalent in professional astronomy.” ― Steven Magee, Toxic Altitude"},{"quote":"“As an artist, I will rise up and make change”“It is unacceptable that women still don’t have rights; it’s unacceptable that the poor stay poor. Now is the time for art, for change, for beauty, and for human rights; I won’t take no for an answer.” ― Catherine Filloux"},{"quote":"“I thought I was going to be assaulted by the police in Denver International Airport (DIA) because of the disgusting way they were treating me!” ― Steven Magee"},{"quote":"“I study high altitude effects on humans. Denver International Airport (DIA) is at high altitude and I have personally witnessed behavioral problems in their staff.” ― Steven Magee"},{"quote":"“I avoid traveling through Denver International Airport (DIA) due to its high altitude.” ― Steven Magee"},{"quote":"“An International Private University Made In Collegiate Research, University of Dr.PSJKumar” ― P.S. Jagadeesh Kumar"},{"quote":"“A fish only discovers its need forwater when it is no longer in it.Our own culture is likewater to a fish.It sustains us.” ― Fons Trompenaars"},{"quote":"“I regard President Trump as an international terrorist.” ― Steven Magee"},{"quote":"“[MP3 ZIP] Telecharger L'algerino international Album GratuitLien de telechargement -->> bit . ly /lalgernointernationalLien de telechargement -->> bit . ly /lalgernointernationalTracklist: de internationalInternationalVa BeneHola ft BoefBambinaLes 4 Fantastiques ft Soprano, Naps et AlonzoTape dans le milleAdios ft SoolkingAndaleLes menottesFefe en double filY a des mots qu'on peut pas se direL'haciendaLa tete dans les etoiles^L'algerino international (Complet) (Album) (Telecharger) (ZIP & Torrent) HQ (MIXTAPE) FuiteSHARE^L'algerino international (Complet) (Album) (Telecharger) (ZIP & Torrent) HQ (MIXTAPE) LISTENL'algerino. -. international. [Fuite ALBUM][Telecharger][TELECHARGER L'algerino international] L'algerino international Complet Album Telecharger MP3 (ZIP & Torrent)L'algerino Thank {FILE}{MP3 ZIP}[Complet ALBUM][Telecharger] {SONG} 2018[{NEW ZIP MP3}] L'algerino international Complet Album Telecharger[`/Updated`] L'algerino international Album Telecharger @FuiteEarly..[GET] L'algerino- international + Free Telecharger Complet AlbumL'algerino - international ::Complet [[Album]] 'Telecharger'{L'algerino} - & *international* ..Complet Album 'Telecharger'{L'algerino} - [international] (Complet ALBUM) (((27.05.2018))) ((Fuite Torrent)){27.05.2018} L'algerino - international Complet ALBUM Fuite Telecharger[Complet^L'algerino] L'algerino - international Complet Album Telecharger” ― l'Algerino international"},{"quote":"“People deserve to know about that. They need to understand, not so that they can pity the region, but simply because it helps to explain so much of the way Kurdistan has tried to improve itself afterwards. They need to understand to stop it from ever happening again. They need to understand, because it is unacceptable that a genocide that was essentially ignored by many countries around the world at the time should be continued to be ignored by history” ― Davan Yahya Khalil, Kurdistan: Genocide and Rebirth"},{"quote":"“Chef Kishen dazzled the table. I, on the other hand, transport people to dazzling places. But I have never been able to cook like him. His touch was precise. As if music. He appraised fruits, vegetables, meats, with astonishment, and grasped them with humility, with reverence, very carefully as if they were the most fragile objects in the world. Before cooking he would ask: Fish, what would you like to become? Basil, where did you lose your heart? Lemon: It is not who you touch, but how you touch. Learn from big elaichi. There, there. Karayla, meri jaan, why are you so prudish? ... Cinnamon was 'hot', cumin 'cold', nutmeg caused good erections. Exactly: 32 kinds of tarkas. 'Garlic is a woman, Kip. Avocado, a man. Coconut, a hijra... Chilies are South American. Coffee, Arabian. \"Curry powder\" is a British invention. There is no such thing as Indian food, Kip. But there are Indian methods (Punjabi-Kashmiri-Tamil-Goan-Bengali-Hyderabadi). Allow a dialogue between our methods and the ingredients from the rest of the world. Japan, Italy, Afghanistan. Make something new. Channa goes well with artichokes. Rajmah with brie and parsley. Don't get stuck inside nationalities.” ― Jaspreet Singh, Chef"},{"quote":"“Hello International Space Station, goodbye civilization.” ― Steven Magee"},{"quote":"“The most dangerous thing to the USA population is not North Korea, it is the USA government.” ― Steven Magee"},{"quote":"“Her heart nearly stopped when a hand slid over her mouth and another disarmed her. “I’m Commander Rodgers from the USS Washington, and you’re coming with me now,” an American growled in her ear. From the girth pressing against her back, he was solid—but Olivia could take him.Grinding her teeth, she threw an elbow to his sternum. He blocked—so like a hotshot. Few people were fast enough to react to one of her strikes. But she’d nail him with her second try. Whipping around, she aimed a kick at his groin, but he blocked that, too. At least six-two and faster than an asp, Rodgers stopped her next kick by catching her ankle and giving it a twist—a warning.“Enough. Come.” Jesus Christ, his eyes were the color of a teal lagoon and they drilled into her like daggers.She shook her head. God, she wasn’t about to go anywhere with dagger-eyes. Not without a fight.Suited up in scuba gear, his facemask cocked atop his head, the man had to be daft. “What the fuck, Aquaman?” she whisper-shouted. “If anyone sees you, we’ll both be shot before the first question’s asked.”His eyebrows slanted downward over those damned eyes. “Yeah?” he whisper-shouted back. “Everyone on this boat will be dead in fifteen. If you want to live, you’ll do as I say.”Olivia’s mouth went dry. She blinked, shaking her head. He had to be mistaken. One more day and al-Umari’s ass would be hers. “Are you off your trolley? I’ve put too much into this project to have it blown to smithereens. Call off your dogs before you cock-up the entire op. Now.”“No can do,” he said like her hard-earned cover wasn’t about to become the greatest wipeout in MI6 history. “Sorry to ruin your party, but there’s a bomb attached to the hull. Can’t be killed, can’t be dislodged, and if you stand here arguing with me for one more second, you’ll explode into so many pieces, you won’t make a meal for a goddamned minnow.”Those are my choices?“Christ!” She jammed her finger under his nose. “When this is over, your ass is mine.” ― Amy Jarecki, Hunt for Evil"},{"quote":"“Japanese students come from an advanced, sophisticated society, have a unique cultural identity and require a range of products and services to meet their education needs.” ― Peter Hanami, Buyer Behaviour of Japanese Students in Australia"},{"quote":"“Japanese students judge a school by its appearance, what it looks like inside and out. They want up to date computers that can read, write and accept Japanese characters. They want the same level of technology they use and have in Japan.” ― Peter Hanami, Buyer Behaviour of Japanese Students in Australia"},{"quote":"“Japanese students when compared to other countries students clearly stand out as highly desirable long-term students. Their high level of literacy, visa access, motivation to study, scholastic ability, and value as alumni make them a sort after student market in Asia” ― Peter Hanami, Buyer Behaviour of Japanese Students in Australia"},{"quote":"“Yuriko a Japanese student who left Japan in search of a dream, new skills, improved English and a new qualification to start a new career. The documentary was recorded over four years in Australia and Japan, it provides a holistic cultural profile of the journey of a Japanese international student” ― Peter Hanami, Gaman A Japanese Students Four Year Study Journey Australia"},{"quote":"“The study looks at the Japanese student market and aims to better understand it by concentrating on age and gender insights of the market to ascertain trends, awareness and key features that will allow marketers to appreciate and reach out to these customers” ― Peter Hanami, Age and Gender Analysis of Japanese Students Australia"},{"quote":"“Nevertheless, there is a queer quality in that time [The Medieval Age]; which, while it was international was also internal and intimate. War, in the wide modern sense, is possible, not because more men disagree, but because more men agree.” ― G.K. Chesterton."},{"quote":"“A lot of countries surrounding Italy aren't so bad. That's because the Roman Empire conquered and raped their women. So there is a little bit of Italian in everybody! This is good news, as all Italians bear this in mind when dealing with our neighbors and other foreign-fucked, heavily raped countries, and it gives us the resolve and compassion to deal with their bullshit.” ― H.C. Blackburne, Observations"},{"quote":"“If you are going to have an adventure around the world, it really helps if you can get it by working for international employers.” ― Steven Magee"},{"quote":"“This was a third and somewhat surreal life-changing moment in which I was struck by the fact that, even in such a remote and unique area of the world, LIS issues such as encouraging engagement during story time, crowd control, and developing confidence while reading aloud are common concerns.” ― Cate Carlyle, Your Passport to International Librarianship"},{"quote":"“The Thirty Meter Telescope (TMT) atop Mauna Kea is turning into a fascinating study on how international government corruption willfully damages the health of unsuspecting workers.” ― Steven Magee"},{"quote":"“Few people in the USA seem to realize that President Trumps ‘Made In America’ through international tariffs is likely to make almost everything more expensive and it will hit the poor, sick and elderly the hardest.” ― Steven Magee"},{"quote":"“If you want to know what willful international incompetence looks like, you need look no further than the toxic Mauna Kea Observatories (MKO) atop Mauna Kea in Hawaii.” ― Steven Magee"},{"quote":"“The international astronomy community are making it clear that they intend to keep on inducing High Altitude Observatory Disease (HAOD) into their very high altitude workers.” ― Steven Magee"},{"quote":"“The world is watching the international astronomy community build a known biologically toxic telescope atop a sacred Hawaiian mountain.” ― Steven Magee"},{"quote":"“It is interesting that the international astronomy community are trying to develop the Mauna Kea Observatories (MKO) at the same time as the biological science clearly states that it needs to be demolished on the grounds of worker health and safety.” ― Steven Magee"},{"quote":"“President Trump is taxing the USA masses with import tariffs.” ― Steven Magee"},{"quote":"“In the coming decades, smart people will realize that international travel will end and they will settle onto continents that they are comfortable with being stranded on.” ― Steven Magee"},{"quote":"“In 2001, the internet and email was facilitating my international job search that ultimately landed me in Hawaii, managing the world’s largest telescopes atop Mauna Kea.” ― Steven Magee"},{"quote":"“In 1998, I was using the new Linux operating system on my personal computer with a dial up modem that gave me internet and email, facilitating my search for international jobs.” ― Steven Magee"},{"quote":"“One of the things that I share with President Trump is my like of the Russian people.” ― Steven Magee"},{"quote":"“It will be interesting to see how Steven Magee versus the international astronomical community works out.” ― Steven Magee"},{"quote":"“I regard SpaceX as a domestic and international terrorist organization.” ― Steven Magee"},{"quote":"“WONDERLANDIt is a person's unquenchable thirst for wonderThat sets them on their initial quest for truth.The more doors you open, the smaller you become.The more places you see and the more people you meet,The greater your curiosity grows.The greater your curiosity, the more you will wander.The more you wander, the greater the wonder.The more you quench your thirst for wonder,The more you drink from the cup of life.The more you see and experience, the closer to truth you become.The more languages you learn, the more truths you can unravel.And the more countries you travel, the greater your understanding.And the greater your understanding, the less you see differences.And the more knowledge you gain, the wider your perspective,And the wider your perspective, the lesser your ignorance.Hence, the more wisdom you gain, the smaller you feel.And the smaller you feel, the greater you become.The more you see, the more you love --The more you love, the less walls you see.The more doors you are willing to open,The less close-minded you will be.The more open-minded you are,The more open your heart.And the more open your heart,The more you will be able to Send and receive --Truth and TRUEUnconditionalLOVE.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“There is a music of the universes in every heart.” ― Amit Ray, Enlightenment Step by Step"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“The toll from the two attacks: twenty-one pro-American leaders and their employees dead, twenty-six taken prisoner, and a few who could not be accounted for. Not one member of the Taliban or al-Qaeda was among the victims. Instead, in a single thirty-minute stretch the United States had managed to eradicate both of Khas Uruzgan’s potential governments, the core of any future anti-Taliban leadership—stalwarts who had outlasted the Russian invasion, the civil war, and the Taliban years but would not survive their own allies. People in Khas Uruzgan felt what Americans might if, in a single night, masked gunmen had wiped out the entire city council, mayor’s office, and police department of a small suburban town: shock, grief, and rage.” ― Anand Gopal, No Good Men Among the Living: America, the Taliban, and the War through Afghan Eyes"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“Our effectiveness depends on our capacity to be audacious and astute, clear and appealing. I would hope that we can create a language more fearless and beautiful than that used by conformist writers to greet the twilight.” ― Eduardo Galeano"},{"quote":"“كلما ضاقت دائرة أهتمامات الناس في مجتمع ما جاءت صحفهم ملونة بلون إقليمي محلي أنها نشرات أما إذا إتسع الأفق و إرتفعت الثقافة نشرت الصحب بالتالي شِباكها حول العالم وأهملت الصغائر من أخبار الأفراد” ― زكي نجيب محمود, أيام في أمريكا"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“The global population of Earth are involved in the following corporate government experiments: The long term effects of - 1. Nuclear bomb fallout radiation. 2. Man-made wireless radio frequency (RF) radiation. 3. Exposure to man-made electricity. 4. Eclipsing of the Sun by the International Space Station (ISS), satellites, airplanes and jet aircraft contrails (chemtrails). 5. Eating food forced grown using a variety of toxic industrial chemicals. 6. Adding massive amounts of pollution to the atmosphere and water bodies. 7. Living in metal structures. 8. Exposure to abnormally high solar radiation levels. 9. Relocating to areas that the human has no genetic adaptation to. 10. An indoor lifestyle.” ― Steven Magee"},{"quote":"“NASA astronauts have only managed to live continuously on the International Space Station (ISS) for a year and Biosphere 2 on Earth failed at two years of uninterrupted human habitation. Both cases required extracting the sickened people from the toxic environments. At this point it is ludicrous to talk about a permanent manned base on Mars.” ― Steven Magee"},{"quote":"“Let someone else be the most powerful country, make ours the most peaceful country.” ― Amit Kalantri, Wealth of Words"},{"quote":"“A country that publicly threatens to completely destroy another nation should not be surprised when a preemptive surprise attack occurs from that nation and their allies.” ― Steven Magee"},{"quote":"“Dead. Supposedly Suicide. That's how they'll kill Michael too. Make it look like a suicide or an accident of some sort.” ― H.C. Deboard, The Great Wall of Silence: The Silent Political Takeover of the United States"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"},{"quote":"“Very few USA citizens realize that the USA corporate military is regarded by many to be both a domestic and international terrorist organization.” ― Steven Magee, Health Forensics"},{"quote":"“Primo, si deve ricordare che il vostro sogno può essere realizzato con o senza che qualcuno di aiuto.Secondo, il miglior aiuto proviene dal vostro cuore e dalla vostra mente.(First, you must remember that your dreams can be realized with or without others' help.Second, the best help comes from your heart and mind.)” ― Imania Margria"},{"quote":"“The TV screen switched back to a picture of the crime scene, just in time to capture footage of my bod being police escorted out of the building, my shirt unbuttoned sufficiently for the entire State of Israel to know that I wear pick lace, push-up bras.” ― Kate McVaugh, Jaz, Tall Men, & Mayhem"},{"quote":"“The world is moving at a slow pace. Each day I get up and I feel the world must have moved ahead far but, unfortunately, it remains at the same point each day.” ― Swaraj Priyadarshi"},{"quote":"“You don’t need to be an executive owner of a multi-billion international company to show that you are a leader; you need “a discovered self” to optimize and become a leader.” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“Go on vacation. You're turning into an itchB!” ― Demi's BFF-- Vicky"},{"quote":"“I never violate my oaths or my codes... Only international laws.” ― Sherrilyn Kenyon, Born of Fury"},{"quote":"“I am far more fearful of the USA government than I am of North Korea.” ― Steven Magee"},{"quote":"“I am far more fearful of the police than I am of North Korea.” ― Steven Magee"},{"quote":"“Many signs point to the fact that the youth of the Third World will no longer tolerate living in circumstances that give them no hope for the future. From the young boys I met in the demobilization camps in Sierra Leone to the suicide bombers of Palestine and Chechnya, to the young terrorists who fly planes into the World Trade Center and the Pentagon, we can no longer afford to ignore them. We have to take concrete steps to remove the causes of their rage, or we have to be prepared to suffer the consequences.” ― Roméo Dallaire, Shake Hands with the Devil: The Failure of Humanity in Rwanda"},{"quote":"“Past is past... no it's not! People are always fond of saying that, but what's past is never past; not entirely.” ― Anne Tyler, Breathing Lessons"},{"quote":"“When the ancient Romans would conquer a new place or a new people, they would leave the language and the customs in tact – they would even let the conquered people rule themselves in most cases, appointing a governor to maintain a foothold in the region.” Wilson leaned against the whiteboard as he spoke, his posture relaxed, his hands clasped loosely.“This was part of what made Rome so successful. They didn't try to make everyone Romans in the process of conquering them. When I went to Africa with the Peace Corp, a woman who worked with the Corp said something to me that I have often thought about since. She told me 'Africa is not going to adapt to you. You are going to have to adapt to Africa.' That is true of wherever you go, whether it's school or whether it's in the broader world.” ― Amy Harmon, A Different Blue"},{"quote":"“No one 'just adopts'.” ― Jody Cantrell Dyer, The Eye of Adoption: The True Story of My Turbulent Wait for a Baby"},{"quote":"“Science is a field which grows continuously with ever expanding frontiers. Further, it is truly international in scope. Any particular advance has been preceded by the contributions of those from many lands who have set firm foundations for further developments. The Nobel awards should be regarded as giving recognition to this general scientific progress as well as to the individuals involved.Further, science is a collaborative effort. The combined results of several people working together is often much more effective than could be that of an individual scientist working alone.” ― John Bardeen"},{"quote":"“Life - with or without softener- is hard” ― Kate Papas, Married or merry?"},{"quote":"“After four or five months of reading Hemingway, I decided to write a story. I had in the past written stories for English classes. These had all been about white people, because white people’s stories seemed to matter more. Also, I hadn’t known how to write about Indians. How would I translate the various family relations, the difference between an uncle who is a father’s brother and an uncle who is a mother’s brother? Having read Hemingway, I knew that I should just push all the exotic things to the side as if they didn’t matter, that this was how one used exoticism—by not bothering to explain.The first story I wrote was about my brother coughing. I woke one night to the sound of Birju coughing downstairs and then could not go back to sleep. To be woken this way and not be able to return to sleep struck me as sad enough to merit a reader’s attention. Also, Hemingway had written a story about a man being woken because somebody is dying nearby, and the man is forced to witness the death.I got up from my bed and turned on the light. I then returned to bed with a spiral-bound notebook and placed it against my knees. I began my story in the middle of the action the way Hemingway did. I wrote:The coughing wakes me. My wife coughs and coughs, and then when her throat is clear, she moans. The nurse’s aide moves back and forth downstairs. The hospital bed jingles.I wrote that it was a spouse coughing because that seemed something a reader could identify with, while a brother would be too specific to me.I lie here, listening to my wife cough, and it is hard to believe that she is dying.It was strange to write something down and for that thing to come into existence. The fact that the sentence existed made Birju’s coughing somehow less awful.As I sat on my bed, I thought about how I could end my story. I held my pencil above the sheet of paper. According to the essays I had read on Hemingway, all I needed to do was attach something to the end of the story that was both unexpected and natural.I imagined Birju dying; this had to be what would eventually happen. As soon as I imagined this, I did not want him gone. I felt a surge of love for Birju. Even though he was sick and swollen, I did not want him gone. I wrote:I lie in my bed and listen to her cough and am glad she is coughing because this means she is alive. Soon she will die, and I will no longer be among the lucky people whose wives are sick. Fortunate are the men whose wives cough. Fortunate are the men who cannot sleep through the night because their wives’ coughing wakes them.” ― Akhil Sharma, Family Life"},{"quote":"“As the author of Lost Wife, Saw Barracuda - True Stories from a Sharm el Sheikh Scuba Diving Instructor, I know a thing or two about guide books but I have never quite seen anything like the Buns Guide before. There is certainly nothing arse-about-face with this book and indeed you have to admire the author's cheek, although thankfully he didn't include a photo of it here!What shines through in this quality-produced book is \"Stryke\" Clayton's intelligence, wit and ability to get away with a subject normally found in magazines and websites of questionable pedigree. The result is a hilarious and surprisingly tasteful book written by someone who would probably feel at home in the cast of Monty Python's Flying Circus.The Buns Guide is a great poke in the ribs at those nature guide books and the plastic animal or fish identity picture cards they sell in national parks around the world. With so many parts to the female anatomy I'm sure the author may well be considering a sequel or two?A great read, very funny and a well-produced book. Full marks here!” ― John Kean"},{"quote":"“In the era of globalization, everything is interconnected. A problem in one part of the world will definitely impact on other parts of the globe. Such phenomenon is also valid for defense and security context. A conflict in a state will bring implications in its neighboring countries or other countries extended in the same region. Therefore, collaborative efforts in tackling common defense and security problems are essentially required.” ― Agus Harimurti Yudhoyono"},{"quote":"“Kuandika hadithi ni kitu kimoja. Kuweka kanuni za fasihi katika hadithi ni kitu kingine.” ― Enock Maregesi"},{"quote":"“Kanuni za fasihi ndiyo msingi wa maandiko yote ya kitaalamu hapa ulimwenguni. Watu hawana budi kuzifuata kanuni hizo kama wanataka kutumia vipaji vyao katika ngazi ya kimataifa.” ― Enock Maregesi"},{"quote":"“We do not have to dig deep into history to understand the reality. The examples of Saddam Hussain, who was executed after a sham trial and the case of Muammar Gaddafi, who killed after surrendering in broad daylight, have given enough factual reality to understand the painful truth.” ― Nilantha Ilangamuwa"},{"quote":"“It is a tragedy, at rate at which EBOLA VIRUS is spreading in West Africa. It is a fatal disease in the history of the world. Intensive education (formal and informal approaches) of the citizens of African can help prevent the spread. International cooperation is urgently needed to combat the EBOLA virus.” ― Lailah Gifty Akita"},{"quote":"“I had been nervous about not doing well in college. During my first class, I looked at the notes the boy next to me was taking. His supply and demand curves seemed more neatly drawn than mine. Nearly everyone appeared to have gone to preparatory schools and already knew such odd things as the fact that there was no inflation during the Middle Ages. Very few, however, were willing to work the way I did.When I would come out of Firestone Library at two in the morning, walk past the strange statues scattered around campus, and then sit at my desk in my room till the trees in the yard appeared out of the darkness, I felt that I was achieving something, that every hour I worked was generating almost physical value, as if I could touch the knowledge I was gaining through my work. One weekend, I came home to my parents and worked all Saturday night. In the morning, my mother saw me at my desk and brought me a glass of milk. Later, in Birju’s room, she said to him, “Your brother can eat pain. He can sit all day at his desk and eat pain.” ― Akhil Sharma, Family Life"},{"quote":"“Everything did change, faster than his fingers could type. What he had been too cautious to hope for was pulled from his dreams and made real on the television screen. At that momentous hour on December 26, 1991, as he watched the red flag of the Union of Soviet Socialist Republics—the empire “empire extending eleven times zones, from the Sea of Japan to the Baltic coast, encompassing more than a hundred ethnicities and two hundred languages; the collective whose security demanded the sacrifice of millions, whose Slavic stupidity had demanded the deportation of Khassan’s entire homeland; that utopian mirage cooked up by cruel young men who gave their mustaches more care than their morality; that whole horrid system that told him what he could be and do and think and say and believe and love and desire and hate, the system captained by Lenin and Zinoviev and Stalin and Malenkov and Beria and Molotov and Khrushchev and Kosygin and Mikoyan and Podgorny and Brezhnev and Andropov and Chernenko and Gorbachev, all of whom but Gorbachev he hated with a scorn no author should have for his subject, a scorn genetically encoded in his blood, inherited from his ancestors with their black hair and dark skin—as he watched that flag slink down the Kremlin flagpole for the final time, left limp by the windless sky, as if even the weather wanted to impart on communism this final disgrace, he looped his arms around his wife and son and he held them as the state that had denied him his life quietly died.” ― Anthony Marra, A Constellation of Vital Phenomena"},{"quote":"“Kur es galu galā biju iekļuvis? Es jutos kā mājās, kā savējo vidū. Te jau viss norisinājās uz mata tāpat kā pie mums, latviešiem! Ķildas, izstāšanās, izslēgšanas, sūdzības, draudi… Raug, ne jau mēs, latvieši, vien esam tie ķildīgie un kašķīgie! Visas pasaules tautas šinī ziņā bija vienādas!… Vienīgā starpība bija tā, ka šeit, saskaitušies, ļaudis viens otru nesaukāja par komūnistiem. Bet rietumnieki jau komūnismu un komūnistus nepazina tik labi kā mēs.” ― Anšlavs Eglītis"},{"quote":"“The United States, with the greatest ability and the weakest desire to finance a welfare state, winds up in the middle of the pack in terms of the absolute value of the resources devoted to it. By 2003...America's per capita Public Expenditures were greater than those in Japan, Spain, Australia, Canada, and the United Kingdom, while lower than those in Italy, the Netherlands, Germany, Belgium, France, Denmark and Sweden.” ― William Voegeli, Never Enough: America's Limitless Welfare State"},{"quote":"“The rate spread of EBOLA VIRUS in West Africa, is big tragedy. It is a fatal disease in the history of the world. Intensive education (formal and informal approaches) of the citizens of African can help prevent the spread. International cooperation is urgently needed to combat the EBOLA virus.” ― Lailah Gifty Akita"},{"quote":"“During the coming days, the wealth of America kept astonishing me. The television had programming from morning till night. I had never been in an elevator before and when I pressed a button in the elevator and the elevator “started moving, I felt powerful that it had to obey me. In our shiny brass mailbox in the lobby, we received ads on colored paper. In India colored paper could be sold to the recycler for more money than newsprint. The sliding glass doors of our apartment building would open when we approached. Each time this happened, I felt that we had been mistaken for somebody important.” ― Akhil Sharma, Family Life"},{"quote":"“1. Stop blaming China We taught them how to do what they are doing2. Take responsibility – purchase consciously, purchase less, don’t go for lowest possible price3. Follow good business ethics, it’s a two way street4. Create global partnerships in a global village, create a true Win-Win situation with your supplier, consider the supplier a partner (what a concept!)5. End the Price Pressure: Boycott Walmart & Club-buying stores, not China. Stop buying what you don’t need!” ― Tom Galey"},{"quote":"“So he was handsome. That fact did nothing to soften her feelings toward the walking interference she studied across the room.” ― Eliza Lloyd, Best Served Cold"},{"quote":"“He reasoned, even as a young man, that traditions may linger as he walked though the oracles of time. In later years he thought his mind may one day blur, should he survive to an old age, but as he spread ink on paper, transmitted and shared with those who came after him his experiences, his own grHe reasoned, even as a young man, that traditions may linger as he walked though the oracles of time. In later years he thought his mind may one day blur, should he survive to an old age, but as he spread ink on paper, transmitted and shared with those who came after him his experiences, his own great adventures, he believed perhaps they, like he, would give way to pause to reflect on how...hard it always was to open his eyes to begin a new day. eat adventures, he believed perhaps they, like he, would give way to pause to reflect on how goddamned hard it always was to open his eyes to begin a new day.” ― Andrew Coster, TRUE DAWN FALSE DAWN: GLOBAL COLLAPSE OF THE DO-RE-MI"},{"quote":"“Even before the first Soviet tanks crossed into Afghanistan in 1979, a movement of Islamists had sprung up nationwide in opposition to the Communist state. They were, at first, city-bound intellectuals, university students and professors with limited countryside appeal. But under unrelenting Soviet brutality they began to forge alliances with rural tribal leaders and clerics. The resulting Islamist insurgents—the mujahedeen—became proxies in a Cold War battle, with the Soviet Union on one side and the United States, Pakistan, and Saudi Arabia on the other. As the Soviets propped up the Afghan government, the CIA and other intelligence agencies funneled millions of dollars in aid to the mujahedeen, along with crate after crate of weaponry. In the process, traditional hierarchies came radically undone. When the Communists killed hundreds of tribal leaders and landlords, young men of more humble backgrounds used CIA money and arms to form a new warrior elite in their place. In the West, we would call such men “warlords.” In Afghanistan they are usually labeled “commanders.” Whatever the term, they represented a phenomenon previously unknown in Afghan history. Now, each valley and district had its own mujahedeen commanders, all fighting to free the country from Soviet rule but ultimately subservient to the CIA’s guns and money.The war revolutionized the very core of rural culture. With Afghan schools destroyed, millions of boys were instead educated across the border in Pakistani madrassas, or religious seminaries, where they were fed an extreme, violence-laden version of Islam. Looking to keep the war fueled, Washington—where the prevailing ethos was to bleed the Russians until the last Afghan—financed textbooks for schoolchildren in refugee camps festooned with illustrations of Kalashnikovs, swords, and overturned tanks. One edition declared: Jihad is a kind of war that Muslims fight in the name of God to free Muslims.… If infidels invade, jihad is the obligation of every Muslim.An American text designed to teach children Farsi:Tey [is for] Tofang (rifle); Javed obtains rifles for the mujahedeenJeem [is for] Jihad; Jihad is an obligation. My mom went to the jihad.The cult of martyrdom, the veneration of jihad, the casting of music and cinema as sinful—once heard only from the pulpits of a few zealots—now became the common vocabulary of resistance nationwide. The US-backed mujahedeen branded those supporting the Communist government, or even simply refusing to pick sides, as “infidels,” and justified the killing of civilians by labeling them apostates. They waged assassination campaigns against professors and civil servants, bombed movie theaters, and kidnapped humanitarian workers. They sabotaged basic infrastructure and even razed schools and clinics. With foreign backing, the Afghan resistance eventually proved too much for the Russians. The last Soviet troops withdrew in 1989, leaving a battered nation, a tottering government that was Communist in name only, and a countryside in the sway of the commanders. For three long years following the withdrawal, the CIA kept the weapons and money flowing to the mujahedeen, while working to block any peace deal between them and the Soviet-funded government. The CIA and Pakistan’s spy agency pushed the rebels to shell Afghan cities still under government control, including a major assault on the eastern city of Jalalabad that flattened whole neighborhoods. As long as Soviet patronage continued though, the government withstood the onslaught.With the collapse of the Soviet Union in late 1991, however, Moscow and Washington agreed to cease all aid to their respective proxies. Within months, the Afghan government crumbled. The question of who would fill the vacuum, who would build a new state, has not been fully resolved to this day.” ― Anand Gopal"},{"quote":"“The West responded to the civil war by simply ignoring it, and after the 2001 invasion the years from 1992 to 1996 were all but stricken from the standard narrative. It was dangerous history, the truths buried within it too uncomfortable and “messy. If the mujahedeen had been no better than the Taliban or al-Qaeda, any attempt to bring the principal actors of that period to account could only lead to the highest echelons of Hamid Karzai’s government, and, by extension, to American policy over the previous thirty years.” ― Anand Gopal, No Good Men Among the Living: America, the Taliban, and the War through Afghan Eyes"},{"quote":"“Following the Soviet invasion, the Communists, to their credit, passed decrees making girls’ education compulsory and abolishing certain oppressive tribal customs—such as the bride-price, a payment to the bride’s family in return for her hand in marriage. However, by massacring thousands of tribal elders, they paved the way for the “commanders” to step in as the new elite. Aided by American and Saudi patronage, extremism flourished. What had once been a social practice confined to areas deep in the hinterlands now became a political practice, which, according to ideologues, applied to the entire country. The modest gains of urban women were erased.“The first time a woman enters her husband’s house,\" Heela “told me about life in the countryside, “she wears white”—her wedding dress—“and the first time she leaves, she wears white”—the color of the Muslim funeral shroud. The rules of this arrangement were intricate and precise, and, it seemed to Heela, unchanged from time immemorial. In Uruzgan, a woman did not step outside her compound. In an emergency, she required the company of a male blood relative to leave, and then only with her father’s or husband’s permission. Even the sound of her voice carried a hint of subversion, so she was kept out of hearing range of unrelated males. When the man of the house was not present, boys were dispatched to greet visitors. Unrelated males also did not inquire directly about a female member of the house. Asking “How is your wife?” qualified as somewhere between uncomfortably impolite and downright boorish. The markers of a woman’s life—births, anniversaries, funerals, prayers, feasts—existed entirely within the four walls of her home. Gossip, hopscotching from living room to living room, was carried by husbands or sons.” ― Anand Gopal, No Good Men Among the Living: America, the Taliban, and the War through Afghan Eyes"},{"quote":"“In times of strife, taliban have usually mobilized in defense of tradition. British documents from as early as 1901 decry taliban opposition to colonialism in present-day Pakistan. However, as with so much else, it was the Soviet invasion and the US response that sent the transformative shock. In the 1980s, as guns and money coursed through the ranks of the Kandahar mujahedeen, squabbling over resources grew so frequent that many increasingly turned to religious law to settle their disputes. Small, informal bands of taliban, who were also battling against the Russians, established religious courts that heard cases from feuding fighters from across the south. Seemingly impervious to the lure of foreign riches, the taliban courts were in many eyes the last refuge of tradition in a world in upheaval....Thousands of talibs rallied to the cause, and an informal, centuries-old phenomenon of the Pashtun countryside morphed into a formal political and military movement, the Taliban. As a group of judges and legal-minded students, the Taliban applied themselves to the problem of anarchy with an unforgiving platform of law and order. The mujahedeen had lost their way, abandoned their religious principles, and dragged society into a lawless pit. So unlike most revolutionary movements, Islamic or otherwise, the Taliban did not seek to overthrow an existing state and substitute it with one to their liking. Rather, they sought to build a new state where none existed. This called for “eliminating the arbitrary rule of the gun and replacing it with the rule of law—and for countryside judges who had arisen as an alternative to a broken tribal system, this could only mean religious law.Jurisprudence is thus part of the Taliban’s DNA, but its single-minded pursuit was carried out to the exclusion of all other aspects of basic governance. It was an approach that flirted dangerously with the wrong kind of innovation: in the countryside, the choice was traditionally yours whether to seek justice in religious or in tribal courts, yet now the Taliban mandated religious law as the compulsory law of the land. It is true that, given the nature of the civil war, any law was better than none at all—but as soon as things settled down, fresh problems arose. The Taliban’s jurisprudence was syncretic, mixing elements from disparate schools of Islam along with heavy doses of traditional countryside Pashtun practice that had little to do with religion. As a result, once the Taliban marched beyond the rural Pashtun belt and into cities like Kabul or the ethnic minority regions of northern Afghanistan, they encountered a resentment that rapidly bred opposition.” ― Anand Gopal, No Good Men Among the Living: America, the Taliban, and the War through Afghan Eyes"}]
