[{"quote":"“The job is what you do when you are told what to do. The job is showing up at the factory, following instructions, meeting spec, and being managed.Someone can always do your job a little better or faster or cheaper than you can.The job might be difficult, it might require skill, but it's a job.Your art is what you do when no one can tell you exactly how to do it. Your art is the act of taking personal responsibility, challenging the status quo, and changing people.I call the process of doing your art 'the work.' It's possible to have a job and do the work, too. In fact, that's how you become a linchpin.The job is not the work.” ― Seth Godin, Linchpin: Are You Indispensable?"},{"quote":"“The difference between ordinary and extraordinary is that little extra.” ― Jimmy Johnson"},{"quote":"“The strength of the team is each individual member. The strength of each member is the team.” ― Phil Jackson"},{"quote":"“Even though your time on the job is temporary, if you do a good enough job, your work there will last forever.” ― Idowu Koyenikan, Wealth for All: Living a Life of Success at the Edge of Your Ability"},{"quote":"“Apparently I lack some particular perversion which today's employer is seeking. ” ― John Kennedy Toole, A Confederacy of Dunces"},{"quote":"“I think that my job is to observe people and the world, and not to judge them. I always hope to position myself away from so-called conclusions. I would like to leave everything wide open to all the possibilities in the world.” ― Haruki Murakami"},{"quote":"“If money’s the god people worship, I’d rather go worship the devil instead.” ― Jess C Scott, Rockstar"},{"quote":"“If you hire people just because they can do a job, they’ll work for your money. But if you hire people who believe what you believe, they’ll work for you with blood and sweat and tears.” ― Simon Sinek"},{"quote":"“That’s when I first learned that it wasn’t enough to just do your job, you had to have an interest in it, even a passion for it.” ― Charles Bukowski"},{"quote":"“I like to reinvent myself — it’s part of my job.” ― Karl Lagerfeld"},{"quote":"“Everybody has something, that one thing they must do to feel happy. I think this is yours, and I want you to be happy. You don’t have to do it, but it’s here if you choose to come back to it.” ― Ilona Andrews, Magic Bleeds"},{"quote":"“Find a job you enjoy doing, and you will never have to work a day in your life.” ― Mark Twain"},{"quote":"“God whispered, \"You endured a lot. For that I am truly sorry, but grateful. I needed you to struggle to help so many. Through that process you would grow into who you have now become. Didn't you know that I gave all my struggles to my favorite children? One only needs to look at the struggles given to your older brother Jesus to know how important you have been to me.” ― Shannon L. Alder"},{"quote":"“The crowning fortune of a man is to be born to some pursuit which finds him employment and happiness, whether it be to make baskets, or broadswords, or canals, or statues, or songs.” ― Ralph Waldo Emerson"},{"quote":"“Every day is important for us because it is a day ordained by God. If we are bored with life there is something wrong with our concept of God and His involvement in our daily lives. Even the most dull and tedious days of our lives are ordained by God and ought to be used by us to glorify Him.” ― Jerry Bridges, Trusting God: Even When Life Hurts"},{"quote":"“Most people think, when they're young, that they're going to the top of their chosen world, and that the climb up is only a formality. Without that faith, I suppose, they might never start. Somewhere on the way they lift their eyes to the summit and know they aren't going to reach it; and happiness then is looking down and enjoying the view they've got, not envying the one they haven't.” ― Dick Francis, Reflex"},{"quote":"“[T]he useful idiots, the leftists who are idealistically believing in the beauty of the Soviet socialist or Communist or whatever system, when they get disillusioned, they become the worst enemies. That’s why my KGB instructors specifically made the point: never bother with leftists. Forget about these political prostitutes. Aim higher. [...] They serve a purpose only at the stage of destabilization of a nation. For example, your leftists in the United States: all these professors and all these beautiful civil rights defenders. They are instrumental in the process of the subversion only to destabilize a nation. When their job is completed, they are not needed any more. They know too much. Some of them, when they get disillusioned, when they see that Marxist-Leninists come to power—obviously they get offended—they think that they will come to power. That will never happen, of course. They will be lined up against the wall and shot.” ― Yuri Bezmenov"},{"quote":"“A man is worked upon by what he works on. He may carve out his circumstances, but his circumstances will carve him out as well.” ― Frederick Douglass, The Portable Frederick Douglass"},{"quote":"“Cat doesn’t have to work. She’s a woman of independent means. I settled enough money on her to allow her the freedom to do anything she wished. She went to boarding school for four years, and stayed to teach for another two. Eventually she came to me and said she’d accepted a position as a governess for the Hathaway family. I believe you were in France with Win at the time. Cat went for the interview, Cam and Amelia liked her, Beatrix and Poppy clearly needed her, and no one seemed inclined to question her lack of experience.”“Of course not,” Leo said acidly. “My family would never bother with something so insignificant as job experience. I’m sure they started the interview by asking what her favorite color was.” ― Lisa Kleypas, Married by Morning"},{"quote":"“This is my child, he said. I wash a dead man's brains out of his hair. That is my job.” ― Cormac McCarthy, The Road"},{"quote":"“Pick a leader who will keep jobs in your country by offering companies incentives to hire only within their borders, not one who allows corporations to outsource jobs for cheaper labor when there is a national employment crisis. Choose a leader who will invest in building bridges, not walls. Books, not weapons. Morality, not corruption. Intellectualism and wisdom, not ignorance. Stability, not fear and terror. Peace, not chaos. Love, not hate. Convergence, not segregation. Tolerance, not discrimination. Fairness, not hypocrisy. Substance, not superficiality. Character, not immaturity. Transparency, not secrecy. Justice, not lawlessness. Environmental improvement and preservation, not destruction. Truth, not lies.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“Cat, I'll let you in on a little secret. We don't all love our jobs every day. And doing something you have passion for doesn't make the work part of it any easier...It just makes you less likely to quit.” ― Kate Jacobs, The Friday Night Knitting Club"},{"quote":"“Resources are hired to give results, not reasons.” ― Amit Kalantri, Wealth of Words"},{"quote":"“If heaven really exists: then heaven is the job, hell is unemployment, while life is merely an interview.” ― Mokokoma Mokhonoana"},{"quote":"“Pick a leader who will not only bail out banks and airlines, but also families from losing their homes -- or jobs due to their companies moving to other countries. Pick a leader who will fund schools, not limit spending on education and allow libraries to close. Pick a leader who chooses diplomacy over war. An honest broker in foreign relations. A leader with integrity, one who says what they mean, keeps their word and does not lie to their people. Pick a leader who is strong and confident, yet humble. Intelligent, but not sly. A leader who encourages diversity, not racism. One who understands the needs of the farmer, the teacher, the doctor, and the environmentalist -- not only the banker, the oil tycoon, the weapons developer, or the insurance and pharmaceutical lobbyist.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“Every job will demand some sacrifice. The key is to avoid unnecessary sacrifice.” ― Sheryl Sandberg, Lean In: Women, Work, and the Will to Lead"},{"quote":"“by and large,mothers and house wives are the only workers who do not have regular time off.They are the great vacationless class” ― Anne Morrow Lindbergh"},{"quote":"“Sometimes God will place a wall on your path to force you to go in another direction.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“An educated woman is seen as a human being with a vagina. An uneducated woman is seen as a vagina with a human being.” ― Mokokoma Mokhonoana"},{"quote":"“Ninety percent of the people are not happy with their jobs. The remaining ten percent don’t deserve their jobs in the first place.” ― Abhaidev, That Thing About You"},{"quote":"“You must love your work, and not be always looking over the edge of it, wanting your play to begin. And the other is, you must not be ashamed of your work, and think it would be more honorable to you to be doing something else. You must have a pride in your own work and in learning to do it well, and not be always saying, There’s this and there’s that—if I had this or that to do, I might make something of it. No matter what a man is—I wouldn’t give twopence for him’— here Caleb’s mouth looked bitter, and he snapped his fingers— ‘whether he was the prime minister or the rick-thatcher, if he didn’t do well what he undertook to do.” ― George Eliot, Middlemarch"},{"quote":"“I will always choose a lazy person to do a difficult job because he will find an easy way to do it.” ― Ziad K. Abdelnour, Economic Warfare: Secrets of Wealth Creation in the Age of Welfare Politics"},{"quote":"“I worked out what would make me happy, and I worked out what I wanted to do, and I trained myself to do the job that would make those two things happen' 'You make it sound so simple.''It is simple,' he said. 'The thing is, it's also a lot of hard work. And people don't want to put in a lot of work.” ― Jojo Moyes, Me Before You"},{"quote":"“If to love each other is the job, then the happy life is the salary.” ― Toba Beta, My Ancestor Was an Ancient Astronaut"},{"quote":"“Every beginner possesses a great potential to be an expert in his or her chosen field.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Happiness does not come from a job. It comes from knowing what you truly value, and behaving in a way that’s consistent with those beliefs.” ― Mike Rowe"},{"quote":"“[Poem: Slates of Grey]Sullen faces like slates of grey—What I’d seen on a walk today.Bodies rushing bodies boltingTime for life a disregarding.Money to make and to grow oldWhat about the hands to hold?Deadlines, projects, people to meetWhat about our own two feet.Sullen faces like slates of grey...What I’d see most anyday.” ― Jess C Scott, Trouble"},{"quote":"“I don’t think I’ve ever referred to any girl I dated as my girlfriend. I think that would freak me out. Even the girl that I dated for two years in college I don’t think I ever referred to her as my girlfriend.”“How would you introduce her?” I asked.“I’m just going to say her name,” he said.” ― Daniel Amory, Minor Snobs"},{"quote":"“Growing up, I always had a soldier mentality. As a kid I wanted to be a soldier, a fighter pilot, a covert agent, professions that require a great deal of bravery and risk and putting oneself in grave danger in order to complete the mission. Even though I did not become all those things, and unless my predisposition, in its youngest years, already had me leaning towards them, the interest that was there still shaped my philosophies. To this day I honor risk and sacrifice for the good of others - my views on life and love are heavily influenced by this.” ― Criss Jami, Healology"},{"quote":"“Dalam sebuah skenario infiltrasi ide jangan pernah peduli dengan latar belakang lawan biacara kalian. Konsep egaliter menemukan tempat sebenar-benarnya. Bahkan termasuk ketika kalian wawancara pekerjaan misalnya. Sekali kalian merasa sebagai \"orang yang mencari pekerjaan\" sementara mereka yang menyeleksi adalah \"orang yang memegang leher masa depan kalian,\" tidak akan pernah ada dialog yang sejajar, pantas, dan mengesankan.” ― Tere Liye, Negeri Para Bedebah"},{"quote":"“People who end up with the good jobs are the proactive ones who are solutions to problems, not problems themselves, who seize the initiative to do whatever is necessary, consistent with correct principles, to get the job done.” ― Stephen R. Covey, The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change"},{"quote":"“Look, girls know when they’re cute,” he said. “You don’t have to tell them. All they need to do is look in the mirror. I have one friend out in New York, an attorney. She moved out there after the school year to take the bar. She doesn’t have a job. I was like, ‘How are you going to get a job there in this market?’ And she’s like, ‘I’ll wink and I’ll smile.’ She’s a pretty girl. Whether that works despite her poor grades is yet to be seen.” ― Daniel Amory, Minor Snobs"},{"quote":"“الوظيفة في تاريخ مصر مؤسسة مقدسة كالمعبد، والموظف المصري أقدم موظف في تاريخ الحضارة. إن يكن المثل الأعلى في البلدان الأخرى محارباً أو سياسياً أو تاجراً أو رجل صناعة أو بحاراً فهو في مصر الموظف. وإن أول تعاليم أخلاقية حفظها التاريخ كانت وصايا من أب موظف متقاعد إلى ابن موظف ناشئ. وفرعون نفسه لم يكن إلا موظفاً معيناً من قبل الآلهة في السماء ليحكم الوادي من خلال طقوس دينية وتعاليم إدارية ومالية وتنظيمية. ووادينا وادي فلاحين طيبين يحنون الهامات نحو أرض طيبة ولكن رؤوسهم ترتفع لدى انتظامهم في سلك الوظائف، حينذاك يتطلعون إلى فوق، إلى سلم الدرجات المتصاعد حتى أعتاب الآلهة في السماء. الوظيفة خدمة للناس وحق للكفاءة وواجب للضمير الحي وكبرياء للذات البشرية وعبادة الله خالق الكفاءة والضمير والكبرياء.” ― Naguib Mahfouz, حضرة المحترم"},{"quote":"“I now have anti-bodies to assholes after working for so many.” ― Crystal Woods, Write like no one is reading"},{"quote":"“The land of easy mathematics where he who works adds up and he who retires subtracts.” ― Núria Añó"},{"quote":"“My job is to scream cockle-doodle-doo. Don't blame me if the sun doesn't rise.” ― Janet Skeslien Charles, Moonlight in Odessa"},{"quote":"“You attract poverty when you lack value for time” ― Sunday Adelaja"},{"quote":"“A professional is a man who can do his job when he doesn't feel like it; an amateur is one who can't when he does feel like it. ” ― James Agate"},{"quote":"“Eric understands that the world is rarely the way it is supposed to be. And he knows that, given the chance, we don't have to wait for someone to make messes of our lives. We do a good enough job, ourselves.” ― Jodi Picoult, Vanishing Acts"},{"quote":"“The employed are punished by having to do what they do not love. The self-employed are punished by the opposite.” ― Mokokoma Mokhonoana"},{"quote":"“If we were not impressed by job titles, suits, and jargon, we would demand that financial advisors show us their personal bank statements before they tell us what we could or should do with our own money.” ― Mokokoma Mokhonoana"},{"quote":"“You can be your own boss” ― Sunday Adelaja"},{"quote":"“Life becomes a dilemma when you are living a purposeless and goalless life” ― Sunday Adelaja"},{"quote":"“You are not wrong for loving what you do,\" he says. \"You are lucky. Life doesn't hand everyone a passion in their profession. You and I won that round.\" \"It doesn't feel like winning,\" I say. \"No,\" Aldridge says. \"It often doesn't.” ― Rebecca Serle, In Five Years"},{"quote":"“You need to assess yourself on a yearly basis and see how far you have gone and what you still need to work on” ― Sunday Adelaja"},{"quote":"“You must always overcome your comfort zone” ― Sunday Adelaja"},{"quote":"“Don’t be too comfortable with employment; discover yourself and see what you can achieve for yourself” ― Sunday Adelaja"},{"quote":"“Some animals would be offended if they were treated like some people.” ― Mokokoma Mokhonoana"},{"quote":"“He was willing to pay her to hang around his house and paint Piper's fingernails? It sounded as easy as Britney Spears.” ― Erin McCarthy, Heiress for Hire"},{"quote":"“Big jobs usually go to the men who prove their ability to outgrow small ones.” ― Ralph Waldo Emerson"},{"quote":"“I determine to render more and better service, each day, than I am being paid to render. Those that reach the top are the ones who are not content with doing only what is required of them.” ― Og Mandino, The Greatest Salesman in the World"},{"quote":"“We cannot consent to be judged by someone who has suffered less than ourselves. And since each of us regards himself as an unrecognized Job...” ― Emil Cioran"},{"quote":"“Getting a job scared her but she was determined not to shy away from risk. That’s what life’s all about. Climbing out onto the airplane wing and jumping off.” ― Wally Lamb, She’s Come Undone"},{"quote":"“The most classic horror tale of this latter type is the Old Testament story of Job, who becomes human Astro-Turf in a kind of spiritual Superbowl between God and Satan.” ― Stephen King, Danse Macabre"},{"quote":"“No man likes to acknowledge that he has made a mistake in the choice of his profession, and every man, worthy of the name, will row long against wind and tide before he allows himself to cry out, 'I am baffled!' and submits to be floated passively back to land.” ― Charlotte Brontë, The Professor"},{"quote":"“his face, though lined, bore few traces of anxiety. But, perhaps the confidential bachelor clerks in Tellson's Bank were principally occupied with the cares of other people; and perhaps second-hand cares, like second-hand clothes, come easily off and on.” ― Charles Dickens, A Tale of Two Cities"},{"quote":"“Os livros são escritos devido a anos virados do avesso por ideias que não nos libertam até serem escritas e, até mesmo então, a escrita é o último recurso, um resgate desesperado que pagamos para que a vida nos seja devolvida.” ― Richard Bach, Running from Safety: An Adventure of the Spirit"},{"quote":"“My pet-sitting day ends around sunset, and it's very satisfying to know that I've made several living beings happy that day. That I left their food bowls sparkling clean and fresh water in their water bowls. That I brushed them so their coats shined, and played with them until all our hearts were beating faster. That I kissed them goodbye and left them with their tails wagging or flipping or at least raised in a happy kind of way. That's a heck of a lot more than any president, pope, prime minister, or potentate can say, and I wouldn't switch places with any of them.” ― Blaize Clement, Cat Sitter on a Hot Tin Roof"},{"quote":"“You must always be proactive” ― Sunday Adelaja"},{"quote":"“You must add value to yourself to be relevant” ― Sunday Adelaja"},{"quote":"“Your daily product determines your value” ― Sunday Adelaja"},{"quote":"“You can never know who you really are or what you can do until you discover yourself” ― Sunday Adelaja"},{"quote":"“A job shouldn’t be a mean of existence but rather, a means of sustenance” ― Sunday Adelaja"},{"quote":"“You must be able to communicate properly with the people you want to minister to” ― Sunday Adelaja"},{"quote":"“The idea is to change the nature and value system of the nation as whole” ― Sunday Adelaja"},{"quote":"“Don’t limit yourself, discover new areas of expertise” ― Sunday Adelaja"},{"quote":"“You have to be competitive to be relevant” ― Sunday Adelaja"},{"quote":"“Your calling is you unique area of expertise” ― Sunday Adelaja"},{"quote":"“So throw off all desires, remove all the dust from your eyes, be at ease within, not longing for something, not even for God. Every longing is the same, whether for a big car, or God, or a big house, makes no difference. Longing is the same. Don’t long – just be. Don’t even look – just be! Don’t think! Let this moment be there, and you in it, and suddenly you have everything – because life is there. Suddenly everything starts showering on you, and then this moment becomes eternal and then there is no time. It is always the now. It never ends, never begins. But then you are in it, not an outsider. You have entered the whole, you have recognized who you are.” ― Osho"},{"quote":"“Sarek frowned. \"Insubordination?\"\"Eccentricity,\" Spock replied. \"Captain Kirk allows a great deal of leeway as long as his crewmembers do their jobs well. Mr. Chevron simply takes advantage of it.\"\"That good at his job, is he?\" asked Sarek.\"Indeed. Extremely good.” ― Jean Lorrah, The IDIC Epidemic"},{"quote":"“What job do you want to do?And I see them all hanging up before me, like clothes on a rack, all the jobs, tinker, tailor, soldier, and you have to pick one and then you have to pretend for the rest of your life that that's what you are. So they aint no different really from accidents of birth. I didn't know that phrase then but I learnt it later. It's a good phrase...” ― Graham Swift, Last Orders"},{"quote":"“You can only be fulfilled and accomplished in life when you effectively maximize yourself” ― Sunday Adelaja"},{"quote":"“Use time to create the nature of God in yourself” ― Sunday Adelaja"},{"quote":"“Joblessness is a time for reflection” ― Sunday Adelaja"},{"quote":"“Maximize the time you have through hard work, concentration and research” ― Sunday Adelaja"},{"quote":"“Demonstrate love to the people first, and then teach them to observe biblical principles” ― Sunday Adelaja"},{"quote":"“I earned a mater's degree in journalism and took the first job offered, as a sports writer. Instead of chasing my own fame, I wrote about famous athletes chasing theirs.” ― Mitch Albom, Tuesdays with Morrie: An Old Man, a Young Man, and Life's Greatest Lesson"},{"quote":"“You can always get another job, but you can’t get another life.” ― Richie Norton"},{"quote":"“Knowing what to do with time is the key to being productive” ― Sunday Adelaja"},{"quote":"“There's plenty of challenging, gratifying, interesting, productive workaround for people to do, and there are plenty of people who want to do it―they simply aren't being allowed that opportunity under the current economic system.” ― Noam Chomsky, Understanding Power: The Indispensable Chomsky"},{"quote":"“Until you take time to discover yourself, you never know what you can achieve or how far you can go” ― Sunday Adelaja"},{"quote":"“Leaders are not born, but made as a result of hard work” ― Sunday Adelaja"},{"quote":"“Understanding the value of time is understanding the true essence of life” ― Sunday Adelaja"},{"quote":"“Show the youth the consequences of their actions and why they should choose wisely” ― Sunday Adelaja"},{"quote":"“To bring relevance to people, you have to be able to speak their language effectively” ― Sunday Adelaja"},{"quote":"“Locate the problems in people’s lives with the intention of finding a solution” ― Sunday Adelaja"},{"quote":"“A purposeless and goalless life is meaningless” ― Sunday Adelaja"},{"quote":"“To be fruitful and productive is to invest in time” ― Sunday Adelaja"},{"quote":"“Opportunities in life are meant to be utilized and invested in” ― Sunday Adelaja"},{"quote":"“We were built differently. Locate your own uniqueness” ― Sunday Adelaja"},{"quote":"“Success is determined by how best you can utilize your time” ― Sunday Adelaja"},{"quote":"“Never give up just because you failed initially” ― Sunday Adelaja"},{"quote":"“Time utilization and effectiveness is a major marker for success” ― Sunday Adelaja"},{"quote":"“Don’t procrastinate, start building yourself now!” ― Sunday Adelaja"},{"quote":"“Don’t be too scared to calculate risks” ― Sunday Adelaja"},{"quote":"“Our goal as believers is to teach people to observe the principles of God” ― Sunday Adelaja"},{"quote":"“Do not wait for the government to provide solutions to the people when you can be their answer” ― Sunday Adelaja"},{"quote":"“The main purpose of a church is to bring relevance to people and make sure everyone discovers their calling” ― Sunday Adelaja"},{"quote":"“Dedicate your life to delivering people and teaching them the ways of Christ” ― Sunday Adelaja"},{"quote":"“Take principles, not just religion, to people” ― Sunday Adelaja"},{"quote":"“Adapt yourself to the needs of the people” ― Sunday Adelaja"},{"quote":"“Find the interest of people and help them achieve their calling” ― Sunday Adelaja"},{"quote":"“When you provide things for free to meet their needs and help them discover their skills, they automatically become your family” ― Sunday Adelaja"},{"quote":"“Employment will fail you someday” ― Sunday Adelaja"},{"quote":"“Time is a running factor; once it goes, it cannot be reclaimed” ― Sunday Adelaja"},{"quote":"“You have to discover how best you can manage your time to carry out your work effectively” ― Sunday Adelaja"},{"quote":"“Your daily product determines how far you go” ― Sunday Adelaja"},{"quote":"“The way we assess time as humans determines what we become” ― Sunday Adelaja"},{"quote":"“Your daily product determines your output” ― Sunday Adelaja"},{"quote":"“Your daily actions should be productive” ― Sunday Adelaja"},{"quote":"“To fully communicate with people, you need to find tactics that would interest them” ― Sunday Adelaja"},{"quote":"“You get diminishing returns when you are restricted to your comfort zone” ― Sunday Adelaja"},{"quote":"“No one was created in vain” ― Sunday Adelaja"},{"quote":"“Don’t just be a deliverer of yourself, but a deliverer of your whole nation” ― Sunday Adelaja"},{"quote":"“Don’t be too stereotyped, be ready to explore new opportunities” ― Sunday Adelaja"},{"quote":"“There is a huge difference between living a Christian life and living a religious life” ― Sunday Adelaja"},{"quote":"“A selfish life isn’t God’s purpose for you” ― Sunday Adelaja"},{"quote":"“Develop solutions using biblical principles to help solve the problems of the people” ― Sunday Adelaja"},{"quote":"“To fully carry out your purpose as believers, you have to discover where the people you want to minister to are” ― Sunday Adelaja"},{"quote":"“A mapping of discovery should be carried out” ― Sunday Adelaja"},{"quote":"“Teach the people the Word before converting and baptizing them” ― Sunday Adelaja"},{"quote":"“Reveal to the people and make them experience God first before you make them church members” ― Sunday Adelaja"},{"quote":"“Always be the light. Do not wait for others to take responsibility” ― Sunday Adelaja"},{"quote":"“A purposeless life is a meaningless life” ― Sunday Adelaja"},{"quote":"“Once you are saved, you have to locate your own territory” ― Sunday Adelaja"},{"quote":"“The essence of life is fulfillment” ― Sunday Adelaja"},{"quote":"“Don’t just make use of a gift, look inside you and maximize others” ― Sunday Adelaja"},{"quote":"“You must be able to bring relevance to people” ― Sunday Adelaja"},{"quote":"“To work for God effectively, you have to expand and stretch yourself” ― Sunday Adelaja"},{"quote":"“You have to bring relevance to people before teaching them the ways of Christ” ― Sunday Adelaja"},{"quote":"“Locate the needs of the people and find out how best you can help them before bringing them to Christ” ― Sunday Adelaja"},{"quote":"“We were all created differently, each with his/her calling and purpose” ― Sunday Adelaja"},{"quote":"“Your life would never have a meaning if you don’t have a goal or purpose” ― Sunday Adelaja"},{"quote":"“A life without concrete product is a meaningless one” ― Sunday Adelaja"},{"quote":"“The purpose of the church is to reveal to the people who God is” ― Sunday Adelaja"},{"quote":"“The goal is not to be delivered of your problem only but to be an instrument of God” ― Sunday Adelaja"},{"quote":"“You shouldn’t live for yourself alone but you must also learn to live the Christian life” ― Sunday Adelaja"},{"quote":"“Your life as a Christian must be that which glorifies God” ― Sunday Adelaja"},{"quote":"“The purpose of the church is outreach” ― Sunday Adelaja"},{"quote":"“Never do anything local or insignificant” ― Sunday Adelaja"},{"quote":"“Measure your life by the product and value you produce daily” ― Sunday Adelaja"},{"quote":"“Evaluate and assess your life on a daily” ― Sunday Adelaja"},{"quote":"“Your destiny lies in your hands and can be molded with each passing day by the choices you make” ― Sunday Adelaja"},{"quote":"“After you discover your purpose, you have to build a platform for your calling” ― Sunday Adelaja"},{"quote":"“Always evaluate and determine the product of your life” ― Sunday Adelaja"},{"quote":"“Always ask yourself what you have achieved within a given time and the product of your life” ― Sunday Adelaja"},{"quote":"“Don’t act based on religion; always have a purpose and focus” ― Sunday Adelaja"},{"quote":"“Life is a race against time” ― Sunday Adelaja"},{"quote":"“Your race is your diminishing life” ― Sunday Adelaja"},{"quote":"“Don’t allow your life disappear into an abstract mirage” ― Sunday Adelaja"},{"quote":"“Your race against life must yield effort for you to be productive” ― Sunday Adelaja"},{"quote":"“Always be intentional and purposeful in life” ― Sunday Adelaja"},{"quote":"“Losing your job gives you the ability to decide what product each unit of your passing life should produce” ― Sunday Adelaja"},{"quote":"“Joblessness gives you control over the product of your life” ― Sunday Adelaja"},{"quote":"“The only way to live a life without regret is to make sure each unit of time that passes is being converted into product” ― Sunday Adelaja"},{"quote":"“Be conscious about life and time in order to maximize your time effectively” ― Sunday Adelaja"},{"quote":"“Always account for each unit of passing time” ― Sunday Adelaja"},{"quote":"“You’ve got little time on earth, make each day count” ― Sunday Adelaja"},{"quote":"“Always make positive use of every second and minute” ― Sunday Adelaja"},{"quote":"“We were created by God to carry out and fulfill His divine purpose for our lives” ― Sunday Adelaja"},{"quote":"“We were created to purposefully live a life that glorifies God” ― Sunday Adelaja"},{"quote":"“We have to discover the essence of our creation for us to carry out our purpose as believers” ― Sunday Adelaja"},{"quote":"“No human was created without a purpose” ― Sunday Adelaja"},{"quote":"“You have to discover the needs of the people you want to minister to” ― Sunday Adelaja"},{"quote":"“You need to use the instrument that the people desire to captivate them back to things that are right” ― Sunday Adelaja"},{"quote":"“Do not do anything local as believers. Whatever you do should be magnified to be comprehensive” ― Sunday Adelaja"},{"quote":"“When you increase and multiply, you get much more influence and reach beyond your imagination” ― Sunday Adelaja"},{"quote":"“Our goal in life is to bring the Kingdom of God to people and help change their lives” ― Sunday Adelaja"},{"quote":"“Don’t just bring religion to people but also change their value system” ― Sunday Adelaja"},{"quote":"“Take love to people and teach them to abide by the principles of God” ― Sunday Adelaja"},{"quote":"“To be productive, effective and to live a life of understanding and wisdom is not to waste time” ― Sunday Adelaja"},{"quote":"“What you do with your time daily is essential for spiritual and physical growth” ― Sunday Adelaja"},{"quote":"“You must develop your skills around your calling” ― Sunday Adelaja"},{"quote":"“The best way to assess yourself is to base the assessment on the product you produce daily” ― Sunday Adelaja"},{"quote":"“Time wasted can never be compensated” ― Sunday Adelaja"},{"quote":"“Always invest your life in your calling and purpose” ― Sunday Adelaja"},{"quote":"“To waste time is to lose life” ― Sunday Adelaja"},{"quote":"“What you do with your time on a daily basis determines what values will be added to your life” ― Sunday Adelaja"},{"quote":"“You need to invest time in understanding and discovering yourself” ― Sunday Adelaja"},{"quote":"“For you to be successful in your promised land, you must study the land” ― Sunday Adelaja"},{"quote":"“Knowing what to do with time is the first step to take when you lose your job” ― Sunday Adelaja"},{"quote":"“Time must be converted into product” ― Sunday Adelaja"},{"quote":"“To know what to do with time is to convert a day” ― Sunday Adelaja"},{"quote":"“To convert a day is to produce a product” ― Sunday Adelaja"},{"quote":"“Time spent effectively can be compensated” ― Sunday Adelaja"},{"quote":"“When you invest in life, you are being fruitful and productive” ― Sunday Adelaja"},{"quote":"“Life is in time; seconds, minutes and hours” ― Sunday Adelaja"},{"quote":"“To lose time is to lose life” ― Sunday Adelaja"},{"quote":"“Time should be assessed as seconds, minutes and hours so as to be maximized effectively” ― Sunday Adelaja"},{"quote":"“To maximize time is to make sure that every second, minute and hour counts” ― Sunday Adelaja"},{"quote":"“Every minute, hour and hour that passes daily should be converted into product” ― Sunday Adelaja"},{"quote":"“Every unit of time that passes daily should be accounted for” ― Sunday Adelaja"},{"quote":"“Never let a day be your control factor” ― Sunday Adelaja"},{"quote":"“Time should be reproduced and multiplied” ― Sunday Adelaja"},{"quote":"“Always spend your time adding value to your life” ― Sunday Adelaja"},{"quote":"“Create/add value to your life on a daily basis” ― Sunday Adelaja"},{"quote":"“To build yourself is to add value to your life” ― Sunday Adelaja"},{"quote":"“A product should be made intentionally” ― Sunday Adelaja"},{"quote":"“Life should be measured with product” ― Sunday Adelaja"},{"quote":"“You need to live a productive life” ― Sunday Adelaja"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“Devereaux is going with our pitch.”“Hey, that’s just great,” I said superperkily. “Wendell’s or mine?”“Yours.”“But you want to fire me. So fire me.”“We can’t fire you. They loved you. The head guy, Leonard Daly, thought you were, I quote, ‘agreat kid, very courageous’ and a natural to do a whispering campaign. He said you hadbelievability.”“That’s too bad.”“Why? You’re not quitting!”I thought about it. “Not if you don’t want me to. Do you?”Go on, say it.298 ♥elavanilla♥“No.”“No what?”“No, we don’t want you to quit.”“Ten grand more, two assistants, and charcoal suits. Take it or leave it.”Ariella swallowed. “Okay to the money, okay to the assistants, but I can’t green-light charcoalsuits. Formula Twelve is Brazilian, we need carnival colors.”“Charcoal suits or I’m gone.”“Orange.”“Charcoal.”“Orange.”“Charcoal.”“Okay, charcoal.”It was an interesting lesson in power. The only time you truly have it is when you genuinelydon’t care whether you have it or not.“Right,” I said. “I’m giving myself the rest of the day off.” ― Marian Keyes, Anybody Out There?"},{"quote":"“I remember when I was twenty-five,” he said. “No client comes to you when you’re twenty-five. It’s like when you are looking for a doctor. You don’t want the new one that just graduated. You don’t want the very old one, the one shaking, the one twenty years past his prime. You want the seasoned one who has done it so many times he can do it in his sleep though. Same thing with attorneys.” ― Daniel Amory, Minor Snobs"},{"quote":"“Being by his faith replaced afresh in paradise and created anew, he (the believer)does not need works for his justification, but that he may not be idle, but that he may exercise his own body and preserve it. His works are to be done freely, with the sole object of pleasing God.” ― Martin Luther, On Christian Liberty"},{"quote":"“If you are working with no vision to be own your own boss, you are no different from people who are unemployed” ― Sunday Adelaja"},{"quote":"“Getting too interested in the English way of life won't help you land a permanent job.” ― Mary Ellis, A Marriage for Meghan"},{"quote":"“A month ago, Gavin had given his employer four weeks' notice. \"I'll get a job around here,\" he'd told her. \"Something low-stress, part-time, maybe. We're not paying rent, and Dad's left us plenty. You should quit, too.\" A year earlier this news would have filled her with delicious, full fat, chocolate-coated joy. But now, after a grueling routine of shitty work, shitty- weird home life in a house where the shadow of a dead boy walked more solidly than the grownups, shitty headaches, shitty worry about a husband who couldn't keep his dick out of other women, the golden offer just weirded Laine out. She didn't trust it.” ― Stephen M. Irwin, The Dead Path"},{"quote":"“Let the dogs bark, the wolves howl, the lightnings flash and the crows caw, you continue doing your job!” ― Mehmet Murat ildan"},{"quote":"“Never let employment hinder you from fulfillment” ― Sunday Adelaja"},{"quote":"“Tko npr. formulira govor o Bogu Abrahamovu, Izakovu i Jakovljevu tako da se u njemu više ne čuje Jobov uzdisaj i tužaljka 'Ta dokle još?', taj se ne bavi teologijom nego mitologijom.” ― Johann Baptist Metz, Memoria passionis: Ein provozierendes Gedächtnis in pluralistischer Gesellschaft"},{"quote":"“Getting fired from work does not make you a failure. Letting it take control of your life is what does” ― Sunday Adelaja"},{"quote":"“The most successful people in the world today are entrepreneurs” ― Sunday Adelaja"},{"quote":"“Channel your energy into your God-given purpose. Being out of a job gives you all the time you need to grow” ― Sunday Adelaja"},{"quote":"“A job should only be a stepping stone to being your own boss” ― Sunday Adelaja"},{"quote":"“I heard Silver Dollar City starts every morning by playing The National Anthem. That's almost as patriotic as them importing third-world labor so they can keep wages low and force local employees into poverty. Now THAT is American FREEDOM.” ― Jarod Kintz, Me and memes and memories"},{"quote":"“Jugar a las oficinas es fácil si sabes cómo. El trabajo es solamente un papel que hay que interpretar. He aprendido a dominarlo a la perfección: sé los chascarrillos que siempre funcionan para romper el hielo. Sé lo que tengo que preguntar para parecer atenta e interesada. Y sé lo que tengo que decir para que el tiempo fluya más rápido sin hacer realmente nada hasta las seis de la tarde.[...]Lo cierto es que no sé hacer nada en particular y no sé cómo he llegado aquí. Intuyo que perfeccionando el juego de las oficinas hasta que los demás se han ido creyendo que soy una gran profesional.[...]El juego de las oficinitas consiste en saber expresarse cuando toca. En decir «preparar un Excel» o «hacer una presentación» como si estuvieras hablando de una operación a corazón abierto o en alargar excesivamente una explicación, llena de detalles aburridos, para que la gente pierda el hilo de lo que estás contando y no te pregunte nada al terminar.” ― Beatriz Serrano, El descontento"},{"quote":"“A Psychiatrist who isn't a Therapist simultaneously, is worthless (in his Job).” ― Sino Melo"},{"quote":"“Now, my new goal is to earn enough to bring us from lower middle class to the middle class. That is enough for me for this lifetime.” ― Srivani Bairi, Freshly Laidoff"},{"quote":"“God is blameless and perfect, loving the blameless and perfect and seeking to draw them to himself. His presence is a hurricane of glory. God is a fierce storm, and when he draws near, mountains quake, the earth cracks, seas rage, and men tremble and fear. The storm of God's presence creates, judges, separates, and re-creates. The wind of God divides and tears apart before reuniting and healing. The very good God loves to take good men, break them apart, and turn them into very good men. The perfect and glorious God loves to take perfect men, break them apart, and turn them into greater glory and greater perfection.” ― Toby Sumpter"},{"quote":"“When God loves his sons, he sends them into battle. If God did not spare his own Son in his love, how much more so will he love all of his beloved sons? His love is not aimless; it is not sadistic. His love rejoices in the glory that comes after the battle, the glory of victory, and preeminently the glory of communion with him.” ― Toby Sumpter"},{"quote":"“A job pays you. A career grows you. A calling outlives you.” ― Farshad Asl"},{"quote":"“They may see your job title, but heaven sees your assignment. You’re not just clocking hours—you’re shifting atmospheres, breaking cycles, and carrying light where darkness hoped to hide.” ― Dr. Angela L. Hood"},{"quote":"“Isolation is the enemy of the unemployed.” ― Ken Sher, What’s TRUST Got to Do with It: Transforming Leadership, Culture, and the Job Search"},{"quote":"“Stop stressing — the same God who parted the sea can handle your schedule.” ― Dr. Angela L. Hood"},{"quote":"“Your journey may look messy now, but even a masterpiece starts with splattered paint.” ― Dr. Angela L. Hood"},{"quote":"“Whatever you are good at, if you can scale up that thing, you will be successful and authentic.If not, you will have to keep learning something new and help others scale up.” ― Mahendar Singh Jakhar"},{"quote":"“You don’t get paid to go to work; you get paid to get the job done.” ― Frank Sonnenberg, Values to Live By: Know What Matters Most and Let It Be Your Guide"},{"quote":"“Playboy Job Vacancy in Delhi 9711259153” ― Job, Alice in the Country of Clover: The Lizard Aide"},{"quote":"“It is impossible to pinpoint just how much stress comes to bear on detectives involved in an investigation of the scope of the missing girls' cases, but anyone who is close to homicide detectives sees the tension, the incredible pressure brought on by their responsibilities. If a corporation president carries the responsibility of bringing in or losing profits, homicide detectives - particularly in cases like the \"Ted\" disappearances - are truly dealing with life and death, working against time and almost impossible odds. It is a profession that brings with it the occupational hazards of ulcers, hypertension, coronary disease, and, on occasion, alcoholism. The public, the victims' families, the press, superiors - all demand immediate action.” ― Ann Rule, The Stranger Beside Me: Ted Bundy: The Shocking Inside Story"},{"quote":"“Are we suckers for wanting to do a job that's likely not going to make us rich?” ― Mica De Leon, Love on the Second Read"},{"quote":"“That's how his grandfather always talked about work - you didn't just work so many hours or days. You worked a job to done. All the way to done. No matter how long it took.” ― Gary Paulsen, Tracker"},{"quote":"“This had occurred due to these latter two persons deciding to marry one another and leave the profession. I have always found such liaisons a serious threat to the order in a house. Since that time, I have lost a numerous more employees in such circumstances.” ― Kazuo Ishiguro, The Remains of the Day"},{"quote":"“In other words, a playful mindset into adulthood protects our bodies and minds in a myriad of ways and gives us more positive outlook regarding our lives.” ― Gad Saad, The Saad Truth about Happiness: 8 Secrets for Leading the Good Life"},{"quote":"“Wouldn’t it be nice to have a job like that where you didn’t have to worry about being productive?” ― Cal Newport, Slow Productivity: The Lost Art of Accomplishment Without Burnout"},{"quote":"“Shut up. Now, ordinarily the reason I make you run up those stairs is I don't like you and I want you to die. But today, as it happens, I've a job for you.” ― Mick Herron, Standing by the Wall"},{"quote":"“Most employees are like interchangeable machine parts. When they show up to work, there is no trace of the person they replaced, and then they leave, they make no lasting impression and it's as if they were never there.” ― Jarod Kintz, A Memoir of Memories and Memes"},{"quote":"“No matter how long I've been at my job, or how experienced I am, I tell customers I'm new. People are much more patient when I tell them I just started.” ― Jarod Kintz, A Memoir of Memories and Memes"},{"quote":"“Having a job is tricky. You don't want to be so productive that you make your coworkers appear like slackers, and you don't want to do so little that your coworkers have to make up for your lack of effort.” ― Jarod Kintz, A Memoir of Memories and Memes"},{"quote":"“Choosing a job that is in demand but is a bad fit makes it much more likely that you will experience an existential midlife crisis.” ― Gad Saad, The Saad Truth about Happiness: 8 Secrets for Leading the Good Life"},{"quote":"“To be a maximally happy human is to immerse oneself in perpetual play across countless life domains. Life is too serious not to play.” ― Gad Saad, The Saad Truth about Happiness: 8 Secrets for Leading the Good Life"},{"quote":"“My ability to be playful serves as a pressure relief valve from the otherwise unbearable, ugly realities that I deal with on a daily basis. It is part of the homeostatic mechanism for retaining my sanity.” ― Gad Saad, The Saad Truth about Happiness: 8 Secrets for Leading the Good Life"},{"quote":"“Studies show definite negative health consequences to those who hold jobs that offer them low intellectual discretion (a measure of how repetitive a job is) and little freedom of schedule (such as the ability to take a break at one’s discretion). Those holding such jobs are at significantly higher risk for coronary heart disease. A more recent meta-analysis revealed that the risks go beyond coronary heart disease to include significantly higher rates of all-cause morality for workers with low job control. Lack of occupational freedom kills!” ― Gad Saad, The Saad Truth about Happiness: 8 Secrets for Leading the Good Life"},{"quote":"“Play is such a fundamental feature of the human spirit that it is used as a tool in psychotherapy, an are that typically involves an exploration of the roots of mental suffering. Hence, even in the darkest of circumstances, the desire to play manifests itself.” ― Gad Saad, The Saad Truth about Happiness: 8 Secrets for Leading the Good Life"},{"quote":"“Don't just do anything; focus on the meaningful. Work is supposed to have meaning, not oblivion of meaning.#dothemeaningfulWhat is truly meaningful for Africans? If not collective freedom, then what?” ― Seun Ayilara"},{"quote":"“You should keep your expectations in line with reality. If you view the military as a job, you will be miserable. It's not a job, it's a lot more than that. As long as you wear that uniform, it is your entire existence. The demands of this 'job' will look large in just about every decision you make in what you think of as your 'personal life.' If you view the military as a club, you're also going to have a hard time. It's not some special affiliation you get to brag about—that mind-set will hold you back. And if you're easily offended, you're going to be miserable, too. You need a thick skin. But if you see the military as a system to obtain as much experience, training, and knowledge as possible in order to advance in your life, then you'll be fine. Understand that the air force is going to ask a lot from you. Just remember that you can get a lot in return from it as well.” ― Rob Henderson, Troubled: A Memoir of Foster Care, Family, and Social Class"},{"quote":"“A police officer is a job where you are dressed in riot gear and sent into areas where dangerous projectiles may be thrown at you!” ― Steven Magee"},{"quote":"“Und eins sollte keine und keiner von denen, die immer wieder predigen, Prostitution sei „Sexarbeit“ und ein Beruf wie jeder andere, eine ganz normale Dienstleistung, je vergessen: Wenn wir uns als Gesellschaft dafür entscheiden, dass Sex Arbeit ist, müsste man Prostitution auch dir auf dem Arbeitsamt als Jobangebot unterbreiten dürfen, und außerdem wird jeder Typ, der dir nachts auf der Straße hinterherpfeift und ruft: „Ey, Süße, willste ficken?“, keine sexuelle Belästigung begangen, sondern dir einfach nur ein Jobangebot gemacht haben.” ― Huschke Mau, Entmenschlicht - Warum wir Prostitution abschaffen müssen"},{"quote":"“My job used to feel like chasing the moon, and now it just felt like planning out how to give it to other people.” ― Ashley Poston, The Seven Year Slip"},{"quote":"“I feel my job is to tell them once it may be toxic and to shut up. It is their choice about what to do with the information from that point.” ― Steven Magee"},{"quote":"“Some may loathe you for being too focused on your dreams. Do not let that get to you. Your job is to pursue those dreams until people look up to you. They may not understand your vision now, but they will eventually recognize your breakthrough.” ― Gift Gugu Mona, Exploring the Explosive Power of Big Dreams"},{"quote":"“AI Cannot take our jobs”many people say,“It is not smart enoughto do our jobs” they insist.Thus they talk’cause they still don’t knowhow dumb will betheir future jobs.” ― Herold Vesperi, The Age of the Button Pushers"},{"quote":"“A well-crafted cover letter is a powerful tool that can set you apart from other job applicants. It serves as a personalized introduction, showcasing your qualifications and enthusiasm for the role. CV Owl understands the importance of an impactful cover letter and provides expertly designed samples to help job seekers secure their dream roles.” ― CV Owl"},{"quote":"“Du bist ein Künstler. Und Künstler in normalen Jobs sind wie Tiere in Käfigen – klar, sie können überleben, aber sie werden nie wirklich aufblühen.” ― Daniel Ruczko, Scherben einer zerbrochenen Seele"},{"quote":"“Creating an impressive cover letter is easy with CV Owl's free samples. Start by exploring a variety of industry-specific templates to find one that suits your target role. Customize the content by adding your experiences and aligning it with the job description. Use CV Owl’s tools to refine and proofread for a polished finish. Once complete, submit your cover letter with confidence, knowing it highlights your skills and enthusiasm effectively.” ― CV Owl"},{"quote":"“CV Owl’s resume samples are crafted with industry-specific insights and optimized to highlight your strengths. These templates are designed to be concise, error-free, and impactful, increasing your chances of impressing hiring managers. With expert tips and guidance, you can ensure that your resume is both attractive and tailored to the job you’re applying for.” ― CV Owl"},{"quote":"“From childhood, they taught us to chase goals at any cost but never to savour the beauty of the journey. In doing so, they've transformed us into success machines, devoid of emotion.” ― Bhuwan Thapaliya, Our Nepal, Our Pride"},{"quote":"“Begin by understanding the job requirements, choose a relevant sample, personalize it with your specific achievements, ensure it includes core sections like a professional summary, work experience, education, and skills, keep it concise (ideally within two pages), and thoroughly proofread to eliminate errors.” ― CV Owl"},{"quote":"“CV Owl provides expert guidance along with its resume samples, helping applicants perfect their resumes. The tips and best practices provided ensure each resume effectively conveys the candidate's value. From selecting the right sample to editing it for clarity and professionalism, these resources give applicants the confidence they need to submit a polished, tailored resume.” ― CV Owl"},{"quote":"“Your cover letter should emphasize the skills most pertinent to the job you're applying for. Provide concrete examples of how you've applied these skills in past roles to achieve success. This targeted approach demonstrates your suitability for the position and can set you apart from other candidates.” ― CV Owl"},{"quote":"“Until my 24th Birthday, I have only worked one single Day in an official Job and I am proud of that – because everyone 'must' do it, but I lived Life without working — happily.” ― Sino Melo"},{"quote":"“I used to work at a pizza place. Instead of giving me a raise, my boss threw me a pizza party. He made me make all the food.” ― Jarod Kintz, Powdered Saxophone Music"},{"quote":"“I don’t know. I don’t suppose you’re supposed to like your job. If you did, then it wouldn’t be a job.” “Jack likes his job.” “Then it’s not a job.” ― John Updike, Rabit, Run"},{"quote":"“I would have liked to ask people: 'Are you in love?' or 'What are you reading?' but I never wondered what their job was, although to them it was often of prime importance.” ― Françoise Sagan, Bonjour Tristesse / A Certain Smile"},{"quote":"“... contemporary studies show that the worst stress-related health typically occurs in middle management, with its killer combo of high work demands but little autonomy -responsibility without control.” ― Robert M. Sapolsky, Behave: The Biology of Humans at Our Best and Worst"},{"quote":"“Sometimes you have to place your pride and fear to the side, and courageously ask for an opportunity. But make sure you’re 100% prepared if they say ‘yes’.” ― Robin S. Baker"},{"quote":"“I just stuffed my briefcase full of necessary items, and now I'm off to work. It's heavy to carry because it contains 333 dank memes and one baloney sandwich.” ― Jarod Kintz, Powdered Saxophone Music"},{"quote":"“Don't miss work and never be late. Your boss will appreciate it, and he will reward you by shaking your hand in gratitude after he lays you off.” ― Jarod Kintz, Powdered Saxophone Music"},{"quote":"“Pizza as a reward at work, gotta love it. Personally, I'd rather have that than a raise. Give me a pizza, boss, and let me know you truly value the work I do.” ― Jarod Kintz, Powdered Saxophone Music"},{"quote":"“Who put hard work on the shelf next to jobs? That’s what ruined this country.” ― Jarod Kintz, Powdered Saxophone Music"},{"quote":"“חָ֑סֶד וְיִרְאַ֖ת שַׁדַּ֣י יַעֲזֽוֹב” ― Anonymous"},{"quote":"“Autumn, though, I've seen her finish a novel, pause staring off into space for a minute like she's receiving instructions, and then open another book. it's as if her job is to read and she's behind on her quota” ― Laura Nowlin, If Only I Had Told Her"},{"quote":"“When I worked in professional high and very high altitude astronomy, I was completely clueless to what the long term biological hazards of the job were!” ― Steven Magee"},{"quote":"“I always cringe when I take a salaried job in the USA and find there is an expectation for me to work really long unpaid hours.” ― Steven Magee"},{"quote":"“Having a good job is important. But being honest, living peacefully, and having a path to follow is more important.” ― Thich Nhat Hanh, Answers from the Heart Publisher: Parallax Press"},{"quote":"“He raised a finger and then continued typing for another thirty seconds or so. Just long enough to show Maggie that his time was more valuable than hers—though she knew his salary, and it most definitely was not.” ― Cliff Jones Jr., Dreck"},{"quote":"“The Buddha left his family for his Enlightenment. And I left my family for my Job.” ― Avijeet Das"},{"quote":"“The more you put into it, the more you get out of it, and the more entrenched you become.” ― Wyatt B. Pringle, Jr."},{"quote":"“A real man is not the who’s always seating.” ― Jordan Hoechlin"},{"quote":"“…my Cirri is a good cat,\" the cook was saying sharply, \"and I won't hear a word otherwise, do you hear? Complaining about him doing his job too well, that's what you're doing, if you ask me.\"\"I have had complaints,\" Master Fitch managed to get in. \"Complaints, mistress. Half the guests-\"\"I won't hear of it. I just won't hear of it. If they want to complain about my cat, let them do the cooking.My poor old cat, who's just doing his job, and me, we'll go somewhere where we're appreciated, see if we don't.\" She untied her apron and started to lift it over her head.\"No!\" Master Fitch yelped, and leaped to stop her. They danced in a circle with the cook trying to take her apron off and the innkeeper trying to put it back on her. \"No, Sara,\" he panted. \"There's no need for this. No need, I say! What would I do without you? Cirri's a fine cat. An excellent cat. He's the best cat in Baerlon. If anyone else complains, I'll tell them to be thankful the cat is doing his job. Yes, thankful. You mustn't go. Sara? Sara!\"The cook stopped their circling and managed to snatch her apron free of him. \"All right, then. All right.” ― Robert Jordan, The Eye of the World"},{"quote":"“You don't build a business. You build people, and people build the business.” ― Zig Ziglar"},{"quote":"“A boss has the title, a leader has the people.” ― Simon Sinek"},{"quote":"“Support units are the spine of the war effort. Because we do a job that is invisible and does not take place on the battlefield does not mean what we do isn't difficult or dangerous.” ― Joshunda Sanders, Women of the Post"},{"quote":"“If prosperity is regarded as the reward of virtue it will be regarded as the symptom of virtue. Men will leave off the heavy task of making good men successful. They will adopt the easier task of making our successful men good.” ― G.K. Chesterton, Selected Essays"},{"quote":"“Tolstoy’s accounts of Borodino and Austerlitz show us what real war is like: no one knows what the orders are or who is winning. No one has any idea what to do. Soldiers are permitted to kill each other and are maddened, sooner or later, by the realization that someone else, somewhere relatively comfortable, thinks this is the right thing for them to do. And we are not so far from that kind of chaos in everyday life, really. I walk down the street towards the Infirmary, every Wednesday, and I go in and wait and sit down and everyone is quite polite, and I am played with by the law and turned into a sexless person. The most extraordinary thing is done behind a nice white screen. And the nurse who injects me does it with a good will, because she has been told that it is her job. She doubtless thinks of herself as a freely choosing agent. She likes to think she does her job well, but at the same time she is just doing her job. (One hears this a lot.) That means she does not take ultimate responsibility for her actions, because those kinds of decisions are taken, or absorbed, by more powerful persons, like Tolstoy’s generals, who know what they are doing. She sees no contradiction between this and her own intuitive sense of agency.” ― Will Eaves, Murmur"},{"quote":"“I started asking myself 'What am I doing?' a few years ago when I was about 43 years old. It felt like some sort of midlife crisis at first. My wife and I had moved to another country five years before, and I wasn't quite happy with my life there. It never felt like 'home', I never belonged there. Objectively speaking, my career was going well and I was making good money. But I didn't care about the job I had, I was going through the motions. It felt off, and it was making me feel anxious about the future. I lost my mom to cancer when she was 47 years old. In my mind, that could be my fate too. What if I only had four more years? Am I wasting the time I have left?” ― Daniel Voigt Godoy, You're Not Your Job: Going Above and Beyond for Yourself"},{"quote":"“Stop talking bout your dreams, wake up and work on it.” ― Jordan Hoechlin"},{"quote":"“Your work is your reflection. It speaks for you when you are not in the room.” ― Bald Solomon, Path Reborn: Starting a New Job"},{"quote":"“If everything we see in the world has a function — a purpose and job to fulfill — it only stands to reason that we do as well. Humans have a purpose in the world, but more specifically, YOU have a purpose in the world.” ― Aaron Basko"},{"quote":"“A brand is a promise that you make to an audience. A personal brand is the promise you make to potential employers — what will you deliver if you are hired?” ― Aaron Basko"},{"quote":"“A dream job is when you're paid for doing what you love.” ― Rodrigue Rizk"},{"quote":"“I drive by a business that has a permanent sign that says, \"Always hiring.\" Why in the world would they advertise the fact that they have continual turnover? They might as well say, \"You'll hate working here.” ― Jarod Kintz, I design saxophone music in blocks, like Stonehenge"},{"quote":"“It fucking matters. What I do, our kind, signal technicians—it descends straight from you guys.”“Our kind?” She tried to say it without sharing the classified parts. “The kind with blasted headphones and little cold rooms?”“Yeah, them. You. Want to know the first thing I did, coming to England? I went to Bletchley Park. Because it’s Mecca to people like us. BP and all the outstations like the one you’re at. The Greatest Generation, all these girls like you sitting in little cold rooms with your headphones on. I saw that display, the Bakelite headphones and wireless receivers and what you managed to do with them, and I felt like I was in goddamn church.” ― Kate Quinn, Signal Moon"},{"quote":"“He'd been apprenticed to a joiner before the war, but that felt like decades ago: all he was good at now was killing people, which was discouraged.” ― K.J. Charles, Slippery Creatures"},{"quote":"“Women always ask me what I do for a living. The answer should be obvious: As little as possible.” ― Jarod Kintz, I design saxophone music in blocks, like Stonehenge"},{"quote":"“You have been appointed to steward all of it-these precious children under your care and this art burning a hole in your heart. There is no one better suited for this job, for this holy work, for this calling, than you.” ― Ashlee Gadd, Create Anyway: The Joy of Pursuing Creativity in the Margins of Motherhood"},{"quote":"“If you call yourself an entrepreneur but you haven’t created a stable job for yourself in the context of your business - you’re not an entrepreneur, you’re an unemployed person with sporadic sources of income.” ― Hendrith Vanlon Smith Jr"},{"quote":"“First the AI came for the lawyers’ jobs, and I did nothing, because it was funny. Then the AI came for the journalists’ jobs, and I again was passive, because it was hilarious. Finally, the AI came for Human Resources’ jobs, and I actually did something—I laughed heartily.” ― Jarod Kintz, Eggs, they’re not just for breakfast"},{"quote":"“Before accepting a new job, you need to know if you'll like it or not. That's easy to do. Just simply search for memes that skewer that occupation.” ― Jarod Kintz, Eggs, they’re not just for breakfast"},{"quote":"“Is your job title your identity? When you introduce yourself, do you also include what you do for a living? If so, you may be meeting people who want to know what you do, because they want to know what you can do for them.” ― Jarod Kintz, Eggs, they’re not just for breakfast"},{"quote":"“We’re all busy, all the time.' He’s raising his voice. 'People think it’s all [A.I.'d] now and I sit in my workspace all day reading books and jerking off but it all just makes more work. Everything that was meant to lighten the load makes more work, it just makes more shit for you to deal with.” ― Eddie Robson, Drunk on All Your Strange New Words"},{"quote":"“Time your time judicially..It's like giving a part of your life.Weave it around The people you love, The things you love to do, and the 'You'..!” ― Mahendar Singh Jakhar"},{"quote":"“There are a lot of mental health issues in law enforcement because it is a high stress job.” ― Steven Magee"},{"quote":"“The more skill you show, the more work you will get, not the salary.” ― Tarun Pal"},{"quote":"“…the joy you can find in being underpaid and overworked to save even the smallest part of the world” ― Joan Garry, Joan Garrys Guide to Nonprofit Leadership: 2nd Edition"},{"quote":"“To my way of thinking, any American who gets up and goes to work every day is essential, whether your job is caring for the sick, driving a delivery truck, stocking a shelf, or milking a herd of cows. You matter. And your job matters because it matters to you.” ― Kristi Noem, Not My First Rodeo: Lessons from the Heartland"},{"quote":"“I am thinking of becoming a cop because no matter how abusive you are, it seems to be a job for life!” ― Steven Magee"},{"quote":"“Work occupies much of our time. Doing work we hate assaults our self-esteem and self-confidence. Yet most workers cannot do the work they love. But we can all enhance our capacity to live purposely by learning how to experience satisfaction in whatever work we do. We find that satisfaction by giving any job total commitment. When I had a teaching job I hated (the kind of job where you long to be sick so you have an excuse for not going to work), the only way I could ease the severity of my pain was to give my absolute best. This strategy enabled me to live purposely. Doing a job well, even if we do not enjoy what we are doing, means that we leave it with a feeling of well-being, or with self-esteem intact. That self-esteem aids us when we go in search of a job that can be more fulfilling.” ― bell hooks, All About Love: New Visions"},{"quote":"“Without good health, there is no working.” ― Lailah Gifty Akita"},{"quote":"“Do your work well, that is all there is.” ― Lailah Gifty Akita"},{"quote":"“New start. New rules.” ― Steven Magee"},{"quote":"“A machine can be built to do any accurately described job better than any man. The superiority of a man is that he can do an unexpected, undescribed, and emergency job ... provided he hasn't been especially trained to be a machine.” ― MURRAY F. YACO, Unspecialist"},{"quote":"“Unable to glimpse the divine truth in the destinies of mankind, of people in general, and tormented by my own dark ignorance, I was like a small, utterly helpless child. Feeling that there was something that I had to understand, I writhed impatiently and looked to God for help. And the Lord took pity on my ignorance and was not angry at my temerity but like a mother had compassion on me and was quick to respond. And this not once but over and over again. In like manner He had handled Job who suffered so much and protested so stormily.” ― Sophrony Sakharov, On Prayer"},{"quote":"“When you discover your job is dangerous, you do not report it to the company or OSHA. You leave at the earliest opportunity.” ― Steven Magee"},{"quote":"“A hospital job is a lemon job.” ― Steven Magee"},{"quote":"“Not working is the easiest job.” ― Tamerlan Kuzgov"},{"quote":"“Nobody suspected that the World War just ending would prove to be merely the first one. Had not President Wilson proclaimed it the war to end all wars—if we jumped in and did the dirty job?” ― Buster Keaton, My Wonderful World of Slapstick"},{"quote":"“Work should be about finding the daily lesson in one's self as well as providing one's daily bread.” ― Larry a Lee, The Federal Plantation: A Tale of Subjugation and Injustice"},{"quote":"“The FBI is a black box, you file a report to them and you never hear back. You hope that they do a reasonable job on investigating your report.” ― Steven Magee"},{"quote":"“You should not make people feel like you are doing them a favor when you are doing your job.” ― De philosopher DJ Kyos"},{"quote":"“If you truly want job security, don’t count on others, count on yourself.” ― Frank Sonnenberg, Leadership by Example: Be a role model who inspires greatness in others"},{"quote":"“People would look at teachers differently if they had to wear the uniform for their second job when on the clock” ― stained hanes, 94,000 Wasps in a Trench Coat"},{"quote":"“Naturally, it is too good to be true. Diamond's idea of helping you with your job is to lecture you on the obsolete and retrograde nature of salaried employment. He goes on at length, in his constricted nasal manner, about how, in our social history, jobs are an aberration, a flash in the pan. Human beings have been on earth for a million years, he claims (you think he's mistaken about that), but have only had jobs for the past five hundred years (that doesn't sound right, either), an inconsequential period, relatively speaking. People have always worked, he explains, but they have only held jobs with wages and employers and vacations and pink slips--for a very short time.” ― Tom Robbins, Half Asleep in Frog Pajamas"},{"quote":"“To this day God is the name by which I designate all things which cross my willful path violently and recklessly, all things which upset my subjective views, plans and intentions and change the course of my life for better or worse.” ― Carl Jung"},{"quote":"“Most lawyers are in the job for the money.” ― Steven Magee"},{"quote":"“It is the peoples job to regulate the President.” ― Steven Magee"},{"quote":"“A résumé is like a ticket to the job journey; without it, you are not in.” ― Roopesh Tiwari, WHAT WON’T GET YOU YOUR DREAM JOB : STORY OF A JOB HUNT"},{"quote":"“People are interested in other people. But your unconscious is not. Or only as they might directly affect you. It's been hired to do a very specific job. It never sleeps. It's more faithful than God.” ― Cormac McCarthy, Stella Maris"},{"quote":"“I'd commit war crimes for horchata, you don't wanna know what I'd do to never return to the office.” ― stained hanes, 94,000 Wasps in a Trench Coat"},{"quote":"“Hector looked unconvinced. “Does your job make you rich?”“Nah, but it does make me happy, and I think that’s more important.” ― Freya Sampson, The Lost Ticket"},{"quote":"“Knot the tie and go to work. Unknot the tie and go to sleep.” ― Richard Siken, Crush"},{"quote":"“I once worked in a glass shop. We manufactured ceilings to keep women out of upper management.” ― Jarod Kintz, 94,000 Wasps in a Trench Coat"},{"quote":"“High altitude professional astronomy is a hypoxic job.” ― Steven Magee"},{"quote":"“I took a wonderful job in Florida that turned into a nightmare in just two months!” ― Steven Magee"},{"quote":"“It was a really bad mistake to take a job in Florida.” ― Steven Magee"},{"quote":"“When your company requires you to dress up in fireproof clothing to do your job, it is time to switch careers!” ― Steven Magee"},{"quote":"“After leaving the dangerous Desoto Solar Farm, I noticed I was having memory problems that were not present before I took the job.” ― Steven Magee"},{"quote":"“As a USA historian, it is my job to ensure the USA historical record is accurate in the areas I am knowledgeable in.” ― Steven Magee"},{"quote":"“A person is hired either to perform a job in a company or to make the job of his or her boss easier” ― Roopesh Tiwari, WHAT WON’T GET YOU YOUR DREAM JOB : STORY OF A JOB HUNT"},{"quote":"“A good résumé is very dynamic and changes with every company. It is like an advertisement of a solution to the problem faced by the company. As problems can vary from company to company, so should the résumé” ― Roopesh Tiwari, WHAT WON’T GET YOU YOUR DREAM JOB : STORY OF A JOB HUNT"},{"quote":"“Wherever you are, work.” ― Lailah Gifty Akita"},{"quote":"“If you like a job, even if you are tired, you would still be happy! [Chen Shi]” ― Xin Bai, Headless Female Corpse"},{"quote":"“Work is the only thing useful to occupy thy time wisely.” ― Lailah Gifty Akita"},{"quote":"“If you wish to be paid, you must be willing to work.” ― Lailah Gifty Akita"},{"quote":"“Your life undeniably revolves around the way you are paid. Believe it or not, the key to reinventing yourself is reinventing how you get paid.” ― Richie Norton, Anti-Time Management: Reclaim Your Time and Revolutionize Your Results with the Power of Time Tipping"},{"quote":"“You don't fail in life because you don't have a good job,because you don't have the car or house of your dreams,because you can't buy that outfit, that shoeor for not doing that aesthetic procedure.You fail in life only if you considerthat not to achieve these things is to fail in life.” ― Augusto Branco"},{"quote":"“It wasn't cheating if it was a job. It wasn't cheating if it was only for money. If that was all it was, taking my clothes off pushed that line, but it was not crossing it.” ― Valentine Glass, The Temptation of Eden"},{"quote":"“The USA is a workaholics culture, as life essentials depend on having a job like health care, dental care and the pension plan.” ― Steven Magee"},{"quote":"“The police have the perfect job for abducting people!” ― Steven Magee"},{"quote":"“The best job to lose your brain is where you don't use your brain.” ― Tamerlan Kuzgov"},{"quote":"“When you go to a job interview, nobody is really interested in your background, but on what you can actually do and how committed you are in applying disciple and self-control to learn, improve your results, and improve the relationships and communication inside the company where you work. Therefore, having a PhD but no capacity to empathize or work on new methodologies means nothing, which is why so many people with PhDs work as supermarket cashiers and bartenders, or can't even find a job. Prepare your Curriculum in such a way that anyone can see in the front page all the things you have done and studied on your own, and add to the information the topics you actually studied and can apply. Your employer doesn't care if you went to university for it or learned from a laptop while in pajamas during a Sunday morning. He cares about what you can do to improve his results. If he raises your salary after you make him rich, great, and if not, you can use that opportunity as leverage to a better opportunity with a much higher salary. But always remember that, as an employee, your purpose is not to get a salary but to make your boss rich. The salary is a bonus you get from that intention. If you want to become rich yourself, you have to start your own company and work as many hours as your boss did and employ people who aren't willing to make you rich because they only care about their own salary, people who in many cases have diplomas but can't do anything useful. You will be surprised with how many useless people there are in the world, which is why interviews can last weeks and months before someone is selected for a position.” ― Dan Desmarques"},{"quote":"“But was that freedom worth it? Are we really supposed to be free? Why do people who are all entangled so happy? Why do people constantly crib about their jobs, yet sleep peacefully in the night? Is it exhaustion that they seek? As it prevents them from thinking nonsense? Why do we all want to fasten ourselves to something? Why these entrapments don’t feel suffocating?” ― Abhaidev, The World's Most Frustrated Man"},{"quote":"“One of the greatest joys of leading a business is providing jobs to other people.” ― Hendrith Vanlon Smith Jr, CEO of Mayflower-Plymouth"},{"quote":"“Your career is not your epitaph.” ― Sean Norris, Heaven and Hurricanes"},{"quote":"“Never underestimate the power of simply asking for an opportunity. A lot of times, that lack of directness, is what's standing between you and your ultimate success. Doing this with politeness, confidence, and optimism will put you through doors that were once closed. Believe in yourself and go for exactly what you want. This is taking charge of your life!” ― Robin S. Baker"},{"quote":"“I just got a job helping a one-armed typist do capital letters. It's shift work.” ― Santosh Kalwar, Gags and Extracts"},{"quote":"“When people ask what I do for a living, I tell them I'm an elevator-button salesman. Then I ask them if they've ever seen those domed buttons that light up yellow. When they vaguely nod yes, I say, \"Yeah, I don't sell that particular model.\" I fib about my occupation because if I tell them the truth, that I'm a duck farmer, they simply wouldn't believe me.” ― Jarod Kintz, Music is fluid, and my saxophone overflows when my ducks slosh in the sounds I make in elevators."},{"quote":"“Every employee should feel like their job is important and that their presence in the company is valued.” ― Hendrith Vanlon Smith Jr, CEO of Mayflower-Plymouth"},{"quote":"“There’s always a better life for everyone.” ― Jordan Hoechlin"},{"quote":"“If stress can't give us anything, then why give stress our attention?” ― Sukant Ratnakar, Quantraz"},{"quote":"“When you value yourself enough to reject a bad situation, you are being powerful, and that power will motivate you to find a better job.” ― Suze Orman, Women & Money: Owning the Power to Control Your Destiny"},{"quote":"“Treat the job as an apprenticeship” ― Tariq Nasheed, Foundational Black American Race Baiter: My Journey Into Understanding Systematic Racism"},{"quote":"“Dostoyevsky developed the theory that the worst torture one could possibly devise would be to force someone to endlessly perform an obviously pointless task.” ― David Graeber, Bullshit Jobs: A Theory"},{"quote":"“Your job should be able to accommodate your personal opinion not own it.” ― Seun Ayilara"},{"quote":"“job (noun): the work that we do to secure the means of survival and – in some cases – a spring of satisfaction and delight; more often, a useful tool that we have in our possession in order to distract ourselves from potential alarming thoughts and to release us from the boredom of inactivity. Furthermore, a source that finances our leisure time so that this can effectively continue the important task of distraction.” ― Giannis Delimitsos"},{"quote":"“Work is the act of making yourself useful by creating value for a specific group of people. In exchange for our work, we each get paid money which allows us to purchase the work of other people. Work creates a virtuous cycle of value creation, value consumption and value growth. Therefore, work is economically greater than charity. Because whereas charity is economically one sided, work has a multiplicative value effect. In a sense, the greatest form of charity is the creation of employment for others.” ― Hendrith Vanlon Smith Jr, CEO of Mayflower-Plymouth"},{"quote":"“It is not the career we need to conquer but our own reasons for living into it.” ― Julieanne O'Connor"},{"quote":"“Without wellness how can you work to even earn a wage?” ― Lailah Gifty Akita"},{"quote":"“Mary had done her best work in her first five years in the job. Those early cases were the ones she could recall, where she'd made the time and had an impact. She should have been forced to resign at the five-year mark. Every worker should.” ― Helen Fitzgerald, Worst Case Scenario"},{"quote":"“My gig is the care and feeding of engineers, and their productivity is my productivity. If they all leave, I have exactly no job. Part of your credibility as a leader is your public and repeated declaration that it’s your job to help your team succeed.” ― Michael Lopp, Managing Humans: Biting and Humorous Tales of a Software Engineering Manager"},{"quote":"“Book publishing is a passion that one hopes eventually becomes a good paying job.” ― Steven Magee"},{"quote":"“A police officer is an undesirable job during a time of unprecedented mental illness in a gun toting population.” ― Steven Magee"},{"quote":"“Fall in love with what you do, only can you do your best.” ― Lailah Gifty Akita"},{"quote":"“I was diagnosed with a range of sleep disorders after leaving my extreme night shift job.” ― Steven Magee, Night Shift Recovery"},{"quote":"“It was with the benefit of hindsight I realized I had been hired into a known biologically toxic job.” ― Steven Magee, Night Shift Recovery"},{"quote":"“It may not be your job, but it’s a job worth doing.” ― Frank Sonnenberg, The Path to a Meaningful Life"},{"quote":"“Workers deserves fair wages.” ― Lailah Gifty Akita"},{"quote":"“सुना जाता है कि पहले ज़मानों में नौजवान मुल्क जीतने, लम्बी और कठिन यात्राएँ करने, खा़नदान का नाम ऊँचा करने के ख़्वाब देखा करते थे। अब वे केवल नौकरी का ख़्वाब देखते हैं। नौकरी ही हमारे युग का सबसे बड़ा ऐडवेंचर है ! आज के फ़ाहियान और इब्ने बतूता, वासकोडिगामा और स्काट, नौकरी की खोज में लगे रहते हैं। आज के ईसा, मोहम्मद और राम की मंजिल नौकरी है।” ― Rahi Masoom Raza, Topi Shukla"},{"quote":"“Any job that is informing you that you will develop ‘Summit Brain’ is a job you should leave at the earliest opportunity.” ― Steven Magee, Summit Brain"},{"quote":"“A comfortable job is the biggest impediment to Financial Freedom” ― Manoj Arora, From the Rat Race to Financial Freedom"},{"quote":"“The Unparalleled RoadmapHandbook to get your dream job by Uday SonthaliaUsed by numerous people across India, this resource guide will act as a partner in your journey to get a top paying job and grow in it.” ― Uday Sonthalia"},{"quote":"“You know, having a child changes everything. The father starts loving the soul-sucking job he so detested. The mother begins to find the daily mundane tasks she is assigned as pleasurable. Parents realize that they are accountable to their kid. They, therefore, do things out of responsibility and not out of one’s liking for it.” ― Abhaidev, The Influencer: Speed Must Have a Limit"},{"quote":"“He who feeds himself without injury to other people fares well” ― Brothers Grimm"},{"quote":"“Your energy is your greatest currency.” ― Jordan Hoechlin"},{"quote":"“If you do anything with mediocrity, you will do everything with mediocrity.” ― Amit Kalantri, Wealth of Words"},{"quote":"“In a professional world, you gotta be meticulous about your behaviour. Because once your friendly behaviour interpret as flirty behaviour, nothing you do afterwards could change that image.” ― Sarvesh Jain"},{"quote":"“She didn't have what one would call a \"profession,\" but I didn't know why she particularly wanted one; it seemed like she'd been infected by a very American idea of identity, to think that who you were mostly consisted of what you did to get paid—that seemed silly to me.” ― Rivka Galchen, Atmospheric Disturbances"},{"quote":"“1. Let go of toxic people in your life2. Let go of regretting past mistakes3. Let go of the need to be right4. Let go of feeling sorry for yourself5. Let go of the need to impress others6. Let go of loyalty to those who don’t deserve it7. Let go of holding yourself back8. Let go of the need to please everyone9. Let go of the need to control others10. Let go of a job you hate” ― Richie Norton"},{"quote":"“How in the hell could a man enjoy being awakened at 6:30 a.m. by an alarm clock, leap out of bed, dress, force-feed, shit, piss, brush teeth and hair, and fight traffic to get to a place where essentially you made lots of money for somebody else and were asked to be grateful for the opportunity to do so?” ― Charles Bukowski, Factotum"},{"quote":"“Losing your job is bad, but losing your hope is worse.” ― Sarvesh Jain"},{"quote":"“It’s not offensive if honest people look down to people who lie. Lying gets your job done and life is tough for people who don’t lie.” ― Sarvesh Jain"},{"quote":"“Don’t apologise for scolding your employees when they’re wrong, if you’re a boss then act like one.” ― Sarvesh Jain"},{"quote":"“AI/ML - Training Instructional Designer Job - Annotation Team” ― jobsmarvel"},{"quote":"“Some people are lucky to do what they love for a living, but are unlucky not to be allowed to do it how they want to do it.” ― Mokokoma Mokhonoana"},{"quote":"“An attractive job title is often used as makeup or consolation for an unattractive salary.” ― Mokokoma Mokhonoana"},{"quote":"“When I woke up, I understood why my boss hadn't seemed very happy when I asked for two days off: today is Saturday. I had more or less forgotten that, but realized it when I got up. My boss, quite naturally, must have thought that would mean I'd have four days off, including Sunday, which he probably wouldn't have liked. But then again, it's not my fault that Mama's funeral was yesterday instead of today, and I still would have had Saturday and Sunday off in any case. Of course, that doesn't mean I can't understand why my boss wasn't happy.” ― Albert Camus, The Stranger"},{"quote":"“When you find your passion, you find your joy, and when you share your passion, you find your purpose.” ― Ken Steven, Dream Job Discovery – How to Find a Job That Fuels Your Passion and Inspires Your Purpose"},{"quote":"“If you want lasting happiness in your life, the single most important thing is to find a job you love to do.” ― Ken Steven, Dream Job Discovery – How to Find a Job That Fuels Your Passion and Inspires Your Purpose"},{"quote":"“But not all jobs go smoothly, even if you know what you're doing. All you can say is you try and cope, whatever happens. Shit always happens.Especially when you're just starting out.” ― Kit Wharton, Emergency Admissions"},{"quote":"“It's nice having a job where people are pleased to see you.” ― Kit Wharton, Emergency Admissions"},{"quote":"“I envision a world where everyone eagerly embraces their work, feeling passionate and purpose-driven by what they do.” ― Ken Steven, Dream Job Discovery – How to Find a Job That Fuels Your Passion and Inspires Your Purpose"},{"quote":"“it doesnt matter what you, only mates what they think you've done” ― Jordan Hoechlin"},{"quote":"“Passed NCLEX without studying” ― allexamscertificates.com"},{"quote":"“NCLEX exam without going to nursing school” ― allexamscertificates.com"},{"quote":"“Buy valid and genuine NCLEX-RN and NCLEX-PN certificate license without taking the text” ― allexamscertificates.com"},{"quote":"“Turn your work day into a holiday.It's a win win situation for an otherwise mundane job.” ― Anthony T. Hincks"},{"quote":"“Time keeps us awake while dreaming.” ― Laura Chouette, Profound Reverie"},{"quote":"“Erratic work makes us feel unstable, both emotionally and financially. We thrive when we know what is expected of us, when we know which goal post we're trying to hit. Chasing work or sorting out just what it is we are supposed to be doing in a role demands our energy in a way that is frenetic and often seems unsafe, both of which are a recipe for fatigue and burnout.” ― Lauren McGoodwin, Power Moves: How Women Can Pivot, Reboot, and Build a Career of Purpose"},{"quote":"“Do your work well.” ― Lailah Gifty Akita"},{"quote":"“Stress is a toxic residual of white-collar jobs that accumulate in the body in many invisible forms.” ― Sukant Ratnakar, Quantraz"},{"quote":"“Without the worker, the work will not be done.” ― Lailah Gifty Akita"},{"quote":"“Does anyone actually love their job?”“You’re too young to be that cynical.” He chuckles. “Did you at least like the people you worked with?”“Not really,” I admit. To be honest, I can’t remember the last time I didn’t have to drag myself out of bed, or didn’t watch the hours pass. I loved the feeling that came as I switched off my computer and grabbed my coat each night.“Maybe being forced out is a good thing, then.” He grins at me.“Yeah. Maybe.” ― K.A. Tucker, The Simple Wild"},{"quote":"“The necessity of finding a sphere of usefulness, an appropriate job, ourselves is the hardest discipline that a free society imposes on us. It is, however, inseparable from freedom, since nobody can assure each man that his gifts will be properly used unless he has the power to coerce others to use them. Only by depriving somebody else of the choice as to who should serve him whose capacities or which products he is to use, could we guarantee to any man that his gifts will be used in the manner he feels he deserves.” ― Friedrich A. Hayek, The Constitution of Liberty"},{"quote":"“There was no sadness or nostalgia, only disgust that I’d wasted so much time on unnecessary labor when I could have been sleeping and feeling nothing.” ― Ottessa Moshfegh"},{"quote":"“I’d never been the most responsible employee. It was the hard thing about having two jobs: you had to disappoint them at different times and sometimes you lost track of who you’d fucked over worse.” ― Kevin Wilson, Nothing to See Here"},{"quote":"“You have youth, confidence and a job. You have everything.” ― Ernest Hemingway, A Clean Well-Lighted Place"},{"quote":"“-the bank recently introduced a new system that automated many tasks in my role as a risk analyst and therefore my position has been eliminated; I’m an exemplary employee and this is in no way a reflection of my performance; the company will provide me with ample support during the “transition.”I might be the only person in the history of mankind to eat an entire banana while losing her job.The “transition” would begin immediately. As in, I wasn’t allowed to go back to my desk, to collect my things, or to say goodbye to my coworkers. I was to be walked down to the security desk like a criminal and handed my belongings in a box, then shown the curb.” ― K.A. Tucker, The Simple Wild"},{"quote":"“Four years of fussing over spreadsheets until my eyes hurt and kissing egotistical traders’ asses in hopes that I could count on a good word come promotion time, staying late to cover for other risk analysts, planning team-building activities that didn’t involve used bowling shoes and all-you-can-eat MSG-laden buffets, and just like that, none of it matters. With one impromptu fifteen-minute meeting, I’m officially unemployed.” ― K.A. Tucker, The Simple Wild"},{"quote":"“In conversation with some coworkers today, one of them said that homeless people should have to work for their meals just like the rest of us. I said, \"Okay, I know a man who is homeless. He'd be happy to work. He's got a business degree. He would be happy to come clean your house, do your yard work, or help you with your filing, walk your dogs, babysit your kids, or just about any office job. What time tomorrow should he come see you?\"They all just looked at me.I said, \"Mind you, he's homeless, so he hasn't showered in a while and the only clothes he has are the ones on his back because he lost all his stuff last week when he got picked up for vagrancy and they wouldn't let him go back for his bag. It would be a few weeks before what you are paying him is enough to get shelter and such.\"And still they stared at me.I finished, \"See? It isn't that easy. He can't get a job because he 's homeless with no access to hot water or clean clothes. He can't get access to shelter, hot water or clean clothes without a job. You want him to work for his meals? Give him a hand out of the vicious circle. Stop pretending that all he has to do is get a job.” ― Natalie J Case"},{"quote":"“That's my job in life - giving people chances.” ― Albert Camus, The plague: original translation"},{"quote":"“It's already a good thing to have done a job you did enjoy at one point. That's pretty rare.” ― Manu Larcenet, Ordinary Victories"},{"quote":"“At first, everyone said that tomorrow will be better than yesterday. So we all live in faith for a better tomorrow.” ― Jordan Hoechlin"},{"quote":"“Here is the chief error that causes almost all the other errors by children of God concerning their calling. To be engaged in a business merely to obtain necessities of life for ourselves and family is not scriptural. We should work because it is the Lord's will concerning us. \"Let him labor, working with his hands the thing which is good, that he may have to give to him that needs\" (Ephesians 4:28). The Lord generally meets our needs through our jobs. But that is not the reason why we should work. If providing the necessities of life depended on our ability to work we could never have freedom from anxiety. We would always have to say to ourselves, What will I do when I am old to work, or if I am sick? But if we are engaged in our earthly calling because it is the will of the Lord for us, He is sure to provide for us because we labor in obedience to Him.” ― George Muller"},{"quote":"“The pleasure children get from playing is way more intense, and lasts way longer, than the one adults get from being paid.” ― Mokokoma Mokhonoana"},{"quote":"“Equipped your self with employable skills.” ― Lailah Gifty Akita"},{"quote":"“I am yet to hear someone claim that a salary is nothing but a number.” ― Mokokoma Mokhonoana, F for Philosopher: A Collection of Funny Yet Profound Aphorisms"},{"quote":"“It was a full-time job that paid like a part-time job.” ― Shea Serrano, A Wedding Thing"},{"quote":"“He was a man just doing his job.” ― Lailah Gifty Akita"},{"quote":"“People ask me, “What about Job?” My response is, “What about Jesus?” Job provides the question. Jesus gives the answer. The story of Job is about holding to our faith in the midst of trials and seeing God restore everything brilliantly. But the story of Jesus is the only one I follow.” ― Bill Johnson, God is Good: He's Better Than You Think"},{"quote":"“Prior to your interview, select the proper suit and the nicest shoes and come armed with information about the company too. Just like in a marriage, you don’t want to sign on the dotted line until you find out you’re compatible. Remember, in so many ways, careering is just like life.” ― Tamara S Raymond, Careering: The Pocket Guide to Exploring Your Future Career"},{"quote":"“Uphold your well-being as a great wealth, for without wellness, how can you work to earn money?” ― Lailah Gifty Akita"},{"quote":"“The best proof that you are in love with your job is that you still continue doing your job with great enthusiasm even when you feel very exhausted!” ― Mehmet Murat ildan"},{"quote":"“100 people have tried to do my job . . . and . . . all 100 people have failed . . . tell me why you think you can do my job again ?” ― Kevin Kolenda"},{"quote":"“A job cannot work without you, a business can work without you.!” ― Akhilesh Bhagwat"},{"quote":"“Don’t worry to do dirty jobs. Dirt your body. Don’t dirt your soul.” ― Sijin Bt"},{"quote":"“That morning, for all I sat behind the stinking coffin of a murdered man, I found myself lulled along by the monks' beautiful, polyphonic chant. The psalms, and the Latin reading from Job, struck a chord.'And thou sayest, how doth God know? Can he judge through the dark cloud? Thick clouds are a covering to him, that he seest not; and he walketh in the circuit of heaven.'Thick clouds indeed, I thought. I am still in a fog here.” ― C.J. Sansom, Dissolution"},{"quote":"“A lot of people are able to turn their grief into something positive. Maybe you’re destined for some kind of job in law enforcement.” ― Nick Drnaso, Sabrina"},{"quote":"“You probably have noticed that I mention jobs more often. I guess that is because part of being happy and satisfied in your life is to have a job that you like/love to do and provides you and your family with most of your needs in addition to some of your wants. Whether you have a college degree or higher or you do not have any at all, you are at a certain point in life need to have a job.” ― Isaac Nash, The Herok"},{"quote":"“The difference between fishing and hunting is that when you fish, most of the times you do not know what exactly you are expecting simply because a beginner fisherman does not see below the water (available jobs) but aims for the best; while in hunting you most of the times can see your prey (target career) and try your best to catch it or gain it.” ― Isaac Nash, The Herok"},{"quote":"“Leadership is also quite different from just doing your job well.” ― Eric Martin"},{"quote":"“My friend remarked, \"When my alarm went off this morning, I found myself saying - Do I really need my job?\"It was not all that long ago, I had a similar thought. Then I made a decision - I will love my job until I can exchange it for my passion. Today, I am living my passion and I don't need my job.All rights reserved sirpeterjamesdotcom©2020-01-20” ― Sir Peter James Dotcome, Eerie Stillnes and Other Short Stories"},{"quote":"“Do you know that some people hate you because somebody lied to them about you.” ― Jordan Hoechlin"},{"quote":"“This attitude of judging each other by our “jobs” is to ignore and deny who we really are.” ― David Icke, I am me I am free: The Robots' Guide to Freedom"},{"quote":"“success isn't supposed to feel comfortable” ― Jordan Hoechlin"},{"quote":"“He is a policeman. It is his job to bully people.” ― M. R. C. Kasasian"},{"quote":"“Quand on ne travaillera plus les lendemains des jours de repos, la fatigue sera vaincue.” ― Alphonse Allais"},{"quote":"“I am responsible for finding fulfillment in my job, for being happy with what I do, for knowing my value regardless of my title, the company I work for, the salary I make, or the way anyone looks at all of it.” ― Dave Hollis, Get Out of Your Own Way: A Skeptic's Guide to Growth and Fulfillment"},{"quote":"“It is the pattern of events presented in the book of Job. Job is guiltless. he finds his misfortune unjustifiable and so is dissatisfied. This means that there is unresolved antithesis within him, the consciousness of the justice or righteousness that is absolute and of the incongruity between his fate and this right. He is dissatisfied or unhappy precisely because he does not regard necessity as blind fate; it is known to be God's purpose to bring about good things for those who are good. The critical point, then occurs when this dissatisfaction and sorrow, unhappiness, has to submit to the absolute spirit of God, with pure confidence or faith. This submission or faith is the end point. One the one side there stands the requirement that the righteous should prosper, and on the other hand is a submission of faith. This faith is a renunciation, an acknowledgement of God's power; upon submission to that power there follows the restoration of good fortune by God, precisely because of this acknowledgement of God's power in Job's own renunciation and humbling. This trust in God, this unity and consciousness of this harmony of the power of God with the truth, and the righteousness of God, the consciousness that God is inwardly characterized as purpose and that God has purpose, is the first moment, and the blessedness of knowing God as well as blessedness in external matters are what follows. That trust in God is none other than the consciousness of this harmony between power and wisdom.” ― hegel"},{"quote":"“Worthwhile work is done well.” ― Lailah Gifty Akita"},{"quote":"“Any economy in which the most common tasks are the shuffling of paper, the punching of buttons, and the running of mouths isn’t an order into which we should be pushing kids as if such jobs there were the avenue to a good life.” ― John Taylor Gatto, The Underground History of American Education: An Intimate Investigation Into the Prison of Modern Schooling"},{"quote":"“We want to avoid competition; and yet its the competition that protects us in various forms.” ― Milton Friedman"},{"quote":"“A religious person without a job is dead. (Ìgbàgbọ́ ti ko níí ìṣe, òkú ní. - Yorùbá proverb)” ― Olawale Daniel"},{"quote":"“Wenn man für das bezahlt wird, was man mit Begeisterung tut, dann ist der Gehaltscheck nur ein Bonus.” ― Oprah Winfrey, Was ich vom Leben gelernt habe"},{"quote":"“sometimes you change things, but that doesn't mean you don't have a plan” ― Jordan Hoechlin"},{"quote":"“Love what you do. Do what you love.” ― Lailah Gifty Akita"},{"quote":"“Time keeps me workin cause I never wanna be left behind.” ― Jordan Hoechlin"},{"quote":"“If you don't want to marry a partner while on a relaxing vacation, you shouldn't be with them. On the other hand, romantic gestures are fine, but one does have to return home to a sink of dirty dishes and day jobs to keep the lights on. One shouldn't base too much on a beach making one tingly.” ― Thomm Quackenbush, Holidays with Bigfoot"},{"quote":"“People can’t get a job without experience, and people can’t get experience without a job.” ― Sayam Asjad"},{"quote":"“The ease with which he'd walked out of his job carried the security of youth. The conviction that anything can be dropped today safe in the belief that something else can be picked up tomorrow. Does that fade with age as we looked to the horizon and see time running out?” ― Raynor Winn, The Salt Path"},{"quote":"“Work well.” ― Lailah Gifty Akita"},{"quote":"“Affirm; \"It can be done\"; find a way to get it done.” ― Lailah Gifty Akita"},{"quote":"“Wherever you are, work with your wholeheart.” ― Lailah Gifty Akita"},{"quote":"“Some will do part time job; some will do their work in part time.” ― Allan Bridjith"},{"quote":"“If a works without a wage, how can he care for his well-being?” ― Lailah Gifty Akita"},{"quote":"“If a work works without a wage, how can he care for his well-being?” ― Lailah Gifty Akita"},{"quote":"“The worker deserves a wage.” ― Lailah Gifty Akita"},{"quote":"“Now, first of all, you're going to start telling yourself that you are not defined by your job. It's there to provide you with a salary, period. These people, they're just turds floating in your vicinity. I'm going to give you three weeks of sick leave, and you're going to flush the toilet.” ― Emma, The Emotional Load: And Other Invisible Stuff"},{"quote":"“Whatever job you plan to do, first make sure you'd enjoy the process.” ― Mario Maruffi"},{"quote":"“Lợi ích của việc thuê giúp việc theo giờVới hình thức thuê người giúp việc linh động, tiện ích này sẽ đem lại những lợi ích thấy rõ có thể kể đến như:Đảm bảo không gian riêng tư của gia đìnhNgười giúp việc theo giờ chỉ đến làm việc vào khung thời gian nhất định, không ăn ở tại nhà chủ vậy nên ngoài giờ làm việc của người giúp việc, bạn sẽ đảm bảo được không gian riêng tư của các thành viên trong gia đình. Thuê giúp việc theo giờ bạn cũng sẽ không còn lo lắng vấn đề ăn ở của người làm. Nếu là người không quen hoặc không thể sống với người lạ nhưng vẫn muốn những công việc trong nhà được tươm tất và đảm bảo thì dịch vụ giúp việc theo giờ sinh ra là dành cho bạn.” ― giupviechongdoan"},{"quote":"“As painful as it is, pain cannot be communicated except by approximation, which means that any description of pain requires imagination.” ― Barbara Brown Taylor, An Altar in the World: A Geography of Faith"},{"quote":"“Without work, how could wealth be generated?” ― Lailah Gifty Akita"},{"quote":"“To turn hours into minutes, turn your employment into enthusiasm.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Some people are rightly pitied by someone or people by whom they are wrongly convinced that they are envied.” ― Mokokoma Mokhonoana"},{"quote":"“Without deadlines, nothing get done.” ― Lailah Gifty Akita"},{"quote":"“If I were in an ‘Essential Job’, I would be considering resigning to protect my health from COVID-19.” ― Steven Magee"},{"quote":"“Some people are blessed with a well-paid job, but are cursed with an irresistible urge to give others the impression that they are well paid, through things such as their clothes, car, and place of residence.” ― Mokokoma Mokhonoana"},{"quote":"“Your job is just your job, You are not your job..!” ― Mahendar Singh Jakhar"},{"quote":"“A job often makes it impossible for an employee to enjoy something it makes possible for them to do or have.” ― Mokokoma Mokhonoana"},{"quote":"“Whether a male wants to be like his father can usually be used to determine whether he is over the age of sixteen.” ― Mokokoma Mokhonoana"},{"quote":"“Trumper: Definition – A person that lies under oath to keep their job.” ― Steven Magee"},{"quote":"“A worker deserves a wage.” ― Lailah Gifty Akita"},{"quote":"“The employer is ultimately interested in the growth of the business, not that of the employee.” ― Mokokoma Mokhonoana"},{"quote":"“You would have to be desperate to apply for a job in a hospital during the COVID-19 pandemic.” ― Steven Magee"},{"quote":"“Resigning your job may be a better option than developing workplace COVID-19.” ― Steven Magee"},{"quote":"“The massive deployment of wireless radiation infrastructure around universities has turned education into a known biologically hazardous job.” ― Steven Magee"},{"quote":"“The duty of doing what you love fuels a fuller sense of being.” ― Lailah Gifty Akita"},{"quote":"“If you feel that your employer is putting your health at serious risk of COVID-19 infection, you should file an OSHA complaint and consider resigning your job.” ― Steven Magee"},{"quote":"“COVID-19 is the catastrophe of unemployment.” ― Steven Magee"},{"quote":"“COVID-19 turned the USA into the ‘Gizza Job’ society.” ― Steven Magee"},{"quote":"“Hello COVID-19, hello unemployment.” ― Steven Magee"},{"quote":"“Hello COVID-19, goodbye job.” ― Steven Magee"},{"quote":"“The COVID-19 pandemic created massive unemployment.” ― Steven Magee"},{"quote":"“A dream job certainly feels a lot different when you’re paid in nothing but reality checks.” ― Daryl Banner, Bromosexual"},{"quote":"“If you keep feeding your hobby, your hobby will feed you too.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Part of human survival is developing an understanding that your job is damaging your health and changing career before permanent harm occurs.” ― Steven Magee"},{"quote":"“The job of a dream is to set you free. Don’t turn dreams into jobs.” ― Richie Norton"},{"quote":"“Do the useful duty.” ― Lailah Gifty Akita"},{"quote":"“Doing what you love will lead to a fuller sense of being.” ― Lailah Gifty Akita"},{"quote":"“A job is needed for sustenance, serving in one form or the other,And then we make that part as our life.Being successful in your profession is appreciable but at the end of the day if you miss being with your loved ones, if you miss your baby hugging you, You missed life for that day, not a part of it.Time your time judicially.” ― Mahendar Singh Jakhar"},{"quote":"“Altidiot: Definition – A sea level adapted human that works in a biologically toxic high altitude job.” ― Steven Magee"},{"quote":"“Artificial intelligence (AI) will take over every job that could be done by a robot. Making work more human.” ― Richie Norton"},{"quote":"“We lose huge portions of our lives to making a living.” ― Mokokoma Mokhonoana"},{"quote":"“I felt rising frustration and resentment. I was frustrated because I felt stuck, and I was resentful because I was stuck in an industry that was chipping away at so many things I cared about.” ― Anna Wiener, Uncanny Valley"},{"quote":"“Few are willing to put their money, or their jobs, on the line for an unconventional idea.” ― Richie Norton"},{"quote":"“Good heart leads to good work with the hands.” ― Lailah Gifty Akita"},{"quote":"“When you're on the worst kind of job, audacity's the only thing that'll get you through it: being willing to do something so stupid, there's no way anyone could see it coming.” ― Paul Krueger, Steel Crow Saga"},{"quote":"“Prostitutes hire out one tiny portion of their bodies. Employees sell countless huge portions of their lives.” ― Mokokoma Mokhonoana"},{"quote":"“So this is the trick to growing in your career: whatever you hear, read, learn from outside your industry...don’t think literally...think laterally about how you will apply it to your work. This will bend minds.” ― Richie Norton"},{"quote":"“It's better to do small job with big motivation rather than a big job with small motivation” ― Mohsen Ali"},{"quote":"“That the man is usually the one who works, or works the most hours, has deceived us into thinking that the child is naturally closer to the mother than it is to the father.” ― Mokokoma Mokhonoana"},{"quote":"“If you only show up at work to do task assigned and follow rules, I bet, you don't have a job, you've been jailed!” ― Bernard Kelvin Clive"},{"quote":"“If a company is advising workers to take drugs to perform their job, they probably should not be working there.” ― Steven Magee"},{"quote":"“Spiritual baba (guru) and Motivational speaker.A fully secure and successful business and careerIf you want to a good future for your children, don't increase them to be a Dr. engineer, Scientist or artist or so on. advice them to be spiritual baba or motivational speaker.As in the world of technology, our source of knowledge is not books and scriptures but WhatsApp facebook groups twitter and 70% garbage of internet, in the coming decades hopeless and depress nescient people will need more spiritual babas and Motivation speakers to get success in the world and afterworld.” ― Mohammed Zaki Ansari, \"Zaki's Gift Of Love\""},{"quote":"“When I took a job at the Mauna Kea Observatories (MKO), I never knew that I would end up researching its toxicity to the sea level adapted human.” ― Steven Magee"},{"quote":"“High altitude astronomy is a biologically toxic job for sea level adapted humans that has a myriad of long term health issues associated with it.” ― Steven Magee"},{"quote":"“The two major causes of depression are: a) having a job, and b) not having a job.” ― Nitya Prakash"},{"quote":"“People go to school to get jobs when they should be learning to become job creators.” ― Richie Norton"},{"quote":"“Experienced people tend to keep doing the same things they’ve always done and then defend their way if someone does the same job differently and better...instead of continuing their learning and leadership.” ― Richie Norton"},{"quote":"“Would-be entrepreneurs leave jobs to become entrepreneurs and mess it all up when they create another job for themselves.” ― Richie Norton"},{"quote":"“Dreams become nightmares when dreams become jobs.” ― Richie Norton"},{"quote":"“Find any job. Find a good leader. Do your job. Learn. If needed, get promoted. Do it as long as you learn. A) find the next leader and repeat B) based on experience, build your own companyOption A is easy. Option B is challenging but more profitable.” ― MiroBurn"},{"quote":"“If you have to take a holiday from work, it means that you have to change this job (especially if you feel a burnout). Look for a job where you go on vacation, because you can, not because you have to.” ― MiroBurn"},{"quote":"“Make money on what you love, and you will never leave the job.” ― Maciej Aniserowicz"},{"quote":"“Some would consider living in a toxic home, working a toxic job and dying from preventable disease to be a form of insanity.” ― Steven Magee"},{"quote":"“No ride. So I couldn’t go home. No plan. No boyfriend. No job.” ― Megan McCafferty, The Mall"},{"quote":"“The job of the insurance company is to deny your valid claim by any means necessary.” ― Steven Magee"},{"quote":"“There is no satisfaction like the joy of work, well done.” ― Lailah Gifty Akita"},{"quote":"“I usually only listen to talk radio in the car on the way to work, he said. The kind of job I have, he added, it helps to be angry.—Talk Radio” ― Brian Andreas, Theories of Everything"},{"quote":"“It is painful to see someone do something we do with displeasure for pleasure.” ― Mokokoma Mokhonoana"},{"quote":"“Working just for money is to some people more humiliating than being unemployed.” ― Mokokoma Mokhonoana"},{"quote":"“Give your all in every good work your hands can find, and know when to be sharp and when to be selfless as you spend your coin.” ― VKBoy"},{"quote":"“This job won't love you back, you know.” ― Jen Wang, The Prince and the Dressmaker"},{"quote":"“If you want a great job, you need something of great value to offer in return.” ― Cal Newport, So Good They Can't Ignore You: Why Skills Trump Passion in the Quest for Work You Love"},{"quote":"“I have passed through some jobs that were real lemons.” ― Steven Magee"},{"quote":"“The military is not so much a job, it is more of a pathway to serious injury and permanent disability.” ― Steven Magee"},{"quote":"“In a job interview, many candidates fake to be polite. So, the interviewers find it difficult to sort out the really polite ones!” ― Md. Ziaul Haque"},{"quote":"“The police have a tough job and they make it even tougher with the fabricated lies they engage in with the general public.” ― Steven Magee"},{"quote":"“It's not your job to live your life for what they want” ― Claire Kingsley, Whiskey Chaser"},{"quote":"“The things that make a great job great...are rare and valuable. If you want them in your working life, you need something rare and valuable to offer in return In other words, you need to be good at something before you can expect to get a good job.” ― Cal Newport, So Good They Can't Ignore You: Why Skills Trump Passion in the Quest for Work You Love"},{"quote":"“Psychology explains that thoughts arise inthe brain, and emotions from the heart.Irrespective of where they arise from,thoughts and emotions are inseparable.Ancient scriptures say that thoughts createus. So do emotions. We become what ouremotions are. Managing our emotions iscrucial to transforming our lives. - HDH Bhagavan Sri Nithyananda Paramashivam, in the book \"Living Enlightenment” ― Paramahamsa Nithyananda, Living Enlightenment"},{"quote":"“Why are we afraid ofdeath?We are afraid because instinctively we resist change and death is an abrupt changein life. - HDH Bhagawan Sri Nithyananda Paramashivoham, in the book \"Living Enlightenment\".” ― Paramahamsa Nithyananda, Living Enlightenment"},{"quote":"“Some people think very cleverly, ‘Let melive my whole life the way I want to live.In the last few moments, I will remembergod and chant His name and enter heavensomehow.’ Please be very clear, only thatwhich you thought of in your whole life,will come up when you leave the body.Don’t think that at that last moment youcan play the game! No!- HDH Bhagavan Nithyananda Paramashivoham, Living Enlightenment” ― Paramahamsa Nithyananda, Living Enlightenment"},{"quote":"“Always remember that it's a luxury to say \"I don't like my job\".” ― Nitya Prakash"},{"quote":"“This is a time when some of the smartest people in business are eschewing the regimented rubrics of a nine-to-five job, and the safety of a predictable and sequential career, in favour of more independence and self-direction.” ― Gyan Nagpal, The Future Ready Organization: How Dynamic Capability Management Is Reshaping the Modern Workplace"},{"quote":"“As men, we often identify with our career, or some thing that we DO.But what we DO is not who we ARE.” ― Josh Hatcher"},{"quote":"“WHATEVER YOU ARE, WHERE EVER YOU ARE, YOU CAN ALWAYS BE REPLACED, KEEP LEARNING AND KEEP EXPLORING YOURSELF. MAKE YOUR REPLACEMENT A TOUGH TASK AND NEW OPPORTUNITY AN EASY TASK.” ― da sachin sharma"},{"quote":"“The most dangerous job by far in the USA is an astronaut.” ― Steven Magee"},{"quote":"“The military is not so much a job, it is more of a death sentence.” ― Steven Magee"},{"quote":"“I am just a sickened person that made some really bad career choices.” ― Steven Magee"},{"quote":"“The military is not so much a job, it is more of an organ donation program.” ― Steven Magee"},{"quote":"“I take the view with all job interviews that I am practicing for my future successful job interview.” ― Steven Magee"},{"quote":"“In some areas the corporate controlled government does a good job and in others it is completely corrupt.” ― Steven Magee"},{"quote":"“The military is not so much a job, it is more of a legally assisted suicide program.” ― Steven Magee"},{"quote":"“একটি চাকরির সাক্ষাৎকারে অনেক প্রার্থীরাই বিনয়ী হবার ভান করেন। তাই, সাক্ষাৎকারগ্রহণকারীগণ প্রকৃত বিনয়ী প্রার্থী বাছাই করাটা কঠিন মনে করেন!” ― Md. Ziaul Haque"},{"quote":"“Quotes come from a wide variety of places: News, life, research, experience, visions, strange states of mind, travel, friends, observations of people, jobs, and so on.” ― Steven Magee"},{"quote":"“Had the government done its job of regulating Boeing, it is highly unlikely that the 737 Max would have been globally grounded.” ― Steven Magee"},{"quote":"“The best way to appreciate your job is to imagine yourself without one.” ― Faraaz Kazi"},{"quote":"“A man is worth more than money.” ― Lailah Gifty Akita"},{"quote":"“If you know that you are working at a facility that uses mercury and you are slowly becoming sick, then it is a good idea to leave for your next job before that strange sickness progresses.” ― Steven Magee"},{"quote":"“Your day job funds your dream job.” ― Ken Coleman"},{"quote":"“Nothing's off limits - no job, dream, or role.” ― Julia Finley Mosca, The Doctor with an Eye for Eyes: The Story of Dr. Patricia Bath"},{"quote":"“The wise rest at least as hard as they work.” ― Mokokoma Mokhonoana"},{"quote":"“Schooling doesn't assure employment but skill does.” ― Amit Kalantri, Wealth of Words"},{"quote":"“How I long for the months gone by,for the days when God watched over me,when his lamp shone on my headand by his light I walked through darkness!Oh, for the days when I was in my prime,when God’s intimate friendship blessed my house,when the Almighty was still with meand my children were around me,when my path was drenched with creamand the rock poured out for me streams of olive oil.” ― Anonymous, The Book of Job"},{"quote":"“May the day of my birth perish. May it turn to darkness. May God above not care about it. May no light shine on it. May gloom and utter darkness claim it once more. May a cloud settle over it. May blackness overwhelm it. May thick darkness seize it. May it not be included among the days of the year nor be entered in any of the months. May that night be barren. May no shout of joy be heard in it. May those who curse days curse that day. May its morning stars become dark. May it wait for daylight in vain and not see the first rays of dawn, for it did not shut the doors of the womb on me to hide trouble from my eyes.Why did I not perish at birth, and die as I came from the womb? Why were there knees to receive me and breasts that I might be nursed? For now I would be lying down in peace; I would be asleep and at rest.Why is light given to those in misery, and life to the bitter of soul,to those who long for death that does not come, who search for it more than for hidden treasure, who are filled with gladness and rejoice when they reach the grave?For sighing has become my daily food; my groans pour out like water.What I feared has come upon me; what I dreaded has happened to me.I have no peace, no quietness; I have no rest, but only turmoil.” ― Anonymous, The Book of Job"},{"quote":"“Reading back, it felt extreme and unreasonable in terms of what was expected of me, but at the time I'd just accepted it as part of the job. There were points where I wouldn't have flinched if an entry read 'swam to Iceland for antenatal clinic' or 'had to eat a helicopter today'.” ― Adam Kay, This Is Going To Hurt"},{"quote":"“A person’s selection of a vocation is a crucial step with significant ramification relating to their degree of financial success, personal happiness, and sense of contributing the best part of themselves – their unique talent – to the community.” ― Kilroy J. Oldster, Dead Toad Scrolls"},{"quote":"“We do not create happiness without integrating our passion into our work life.” ― Kilroy J. Oldster, Dead Toad Scrolls"},{"quote":"“Get Certified; a certificate easily moves you at least thousand rows ahead of other job candidates, with similar knowledge.” ― Wasay Syed"},{"quote":"“If you focus on the strength of the team, you will begin to find work as a positive challenge.” ― Salil Jha"},{"quote":"“Yet even in the best of cases, the need to be on call, to spend at least a certain amount of energy looking over one's shoulder, maintaining a false front, never looking too obviously engrossed, the inability to fully collaborate with others —all this lends itself much more to a culture of computer games, YouTube rants, memes, and Twitter controversies than to, say, the rock 'n' roll bands, drug poetry, and experimental theater created under the midcentury welfare state.” ― David Graeber, Bullshit Jobs: A Theory"},{"quote":"“There is extraordinary value in doing things for others simply because you want to, not because you expect anything in return.” ― Michelle Tillis Lederman, CSP"},{"quote":"“Steve si myslí, že většina lidí nemá to, co je potřebné, aby se stali podnikateli nebo produktovými manažery. Mluvil o tom, když se pokoušel úspěšně rozjet NeXT. \"Mnoho lidí,\" prohlásil, \"ke mně přichází a říká, 'chci se stát podnikatelem'.\" Když se jich zeptám: \"Jakou máte představu?\", odpovídají: \"Ještě žádnou nemám.\"Takovým lidem Steve doporučuje: \"Myslím, že byste si měl najít práci sběrače nádobí nebo něco podobného, než si uvědomíte, pro co jste opravdu zapálen.” ― Walter Isaacson, Steve Jobs"},{"quote":"“Thanks to everybody who does his work and job well. Doctors, Teachers, builders, chefs, parents, students, and anyone who does his best in his duties faithfully and sincerely deserve to be thanked and acknowledged. Working hard to achieve the best isn't like running away from responsibilities, so thanks to all the hard workers around the world for your patience, efforts, achievements.” ― Noora Ahmed Alsuwaidi"},{"quote":"“Man's worth is more than his wage.” ― Lailah Gifty Akita"},{"quote":"“A man's value is more than money .” ― Lailah Gifty Akita"},{"quote":"“I don’t like my job but my job likes me.” ― Alain Bremond-Torrent, running is flying intermittently"},{"quote":"“Do not expect the best and the collective results if you hire the idiot ones for any job.” ― Ehsan Sehgal"},{"quote":"“Hello!FROM THE STABLE OF DESIRE DATING ORGANIZATION, WE BRING TO YOU THE BEST SUGAR MUMMY/DADDY HOOK-UP CONNECTION IN THE WHOLE OF AFRICA.MR. AKINTOLA +2348107613765 FACEBOOK CONTACT: BAYO ERNEST AKINTOLA.THE SOCIETY DOESN'T THINK OLDER WOMEN EXIST ANYMORE, NOBODY THINKS THEY FEEL ANYTHING. THE PEOPLE AROUND OLD WOMEN NEVER REALIZE THEY ARE GOING THROUGH A TURMOIL, NOBODY CARE ABOUT THEM. SO WHAT I AM TRYING TO PORTRAY IS THAT IT'S NOT OVER UNTIL IT'S OVER.THAT AN OLD WOMAN IS STILL ALIVE IN MORE WAYS THAN ONE, THEY STILL HAVE SEXUAL URGES, PEOPLE FORGET THAT AN OLD WOMAN IS STILL HUMAN. AN OLD WOMAN ENJOYS HER SEXUAL LIFE MORE WHEN SHE NO LONGER THINKS ABOUT CHILDREN'S SCHOOL FEES, WHEN THE CHILDREN HAVE ALL GONE TO THEIR HUSBAND'S HOUSE OR IN SOME CASES THE BOYS HAVE MARRIED AND IT REMAINS ONLY THE OLD WOMAN AND HER HUSBAND. IT NEVER CROSSES OUR MIND THAT THESE OLD PARENTS CAN STILL GET ON WHENEVER THEY LIKE. DO YOU KNOW THAT WHEN AN OLD MAN REALIZE HE IS FREE FROM CHILDREN BEARING, HE BECOMES PROMISCUOUS AND THEY ARE SUSCEPTIBLE TO ALL KINDS OF DISEASES. BUT THE OLD WOMAN IS CONFINED TO A CORNER IN THE HOUSE, SO THEY PAY MORE MONEY TO WHO SO EVER IS READY TO MINGLE WITH THEM.HAVE YOU BEEN SEARCHING FOR SUGAR MUMMIES/DADDIES GAY/LESBIAN PARTNERS? SEARCH NO MORE BECAUSE ITS NOW CLOSE TO YOUR DOOR STEP IN EVERY PART OF THE FOLLOWING COUNTRIES;NIGERIAUNITED KINGDOMZIMBABWELIBYAGHANASOUTH AFRICATOGOAND MANY MORE...HERE COMES THE OPPORTUNITY FOR YOU TO MEET PEOPLE THAT MATTER'S IN YOUR SOCIETY , SO GRAB THIS OPPORTUNITY AND MEET WITH YOUR RICH AND INFLUENTIAL SUGAR MUMMY, DADDY, GAY, AND LESBIAN IN YOUR AREA TODAY AS EASY/FAST AS NEVER BEFORE.WE GIVE THE BEST BECAUSE WE ARE THE BEST AGENCY IN AND ACROSS THE GLOBE. EVERY NECESSARY CHECKUP WE NEED TO KNOW ABOUT OUR LADIES/MEN THAT WE HAVE HAS BEEN MADE, AND WE GUARANTY YOU SUCCESS AND MAXIMUM SECURITY. GRAB A SUGAR MUMMY/DADDY AND BE THE BIG BOY/GIRL YOU WANT TO BE.CORPORATE AFFAIRS COMMISSION (C.A.C) APPROVED. (RC: 127561)FOR FURTHER INFORMATION/DETAILS, KINDLY CONTACT THE P.R.O OF DESIRE DATING AGENCY (MR. BAYO AKINTOLA; +2348107613765).IF YOU WANT US TO GET IN-TOUCH WITH YOU, KINDLY PROVIDE THE INFORMATION BELOW AND TEXT IT TO MR. BAYO AKINTOLA +2348107613765,YOUR NAME...............YOUR AGE................YOUR OCCUPATION.........YOUR LOCATION...........REGARDS,MR, AKINTOLA+2348107613765” ― Desirina Boskovich, 2084"},{"quote":"“A maid’s love for her own children often forces her to pretend to love her employer’s children.” ― Mokokoma Mokhonoana"},{"quote":"“If you don't do what you love, you die slowly and sometimes even you die fast!” ― Mehmet Murat ildan"},{"quote":"“Irony is when people claim to be expert and do not possess rudimentary information about the field.” ― Shreyash Mishra"},{"quote":"“My job is simple; empower people with design and technology and lead them to be happier citizens of the world.” ― Shreyash Mishra"},{"quote":"“I was chasing a job title only to find my life had no balance.” ― Andrea Bain, Single Girl Problems: Why Being Single Isn't a Problem to Be Solved"},{"quote":"“Those who take the job seriously when their superiors don’t, will get more work to do than their peers.” ― Alan Maiccon"},{"quote":"“All suffering always has a cause. By learning the causes we can know how to end suffering. We can find peace of mind and save ourselves.” ― Osamu Tezukaezuka"},{"quote":"“When you love your job, the quality of work improves effortlessly. You don’t get tired with your work but feel recharged. Your work itself becomes a great source of joy for you.” ― Awdhesh Singh, 31 Ways to Happiness"},{"quote":"“Crafting your work beats being told what to do.” ― Richie Norton"},{"quote":"“Love is a full-time job.” ― Nitya Prakash"},{"quote":"“The most intriguing thing about choosing an important but less interesting job is that it challenges you. The duller the job, the more challenging it is since not many people are willing to take up such tasks. However, once you get into this challenging job, the same job gradually becomes very interesting and satisfying.” ― Awdhesh Singh, 31 Ways to Happiness"},{"quote":"“In any area, you can get hired for three reasons: because you know, because you can or because you dare ... I prefer to be hired by the latter, since I do not always know everything, or I can always do everything, but always I dare to experience different things, as long as I am in the area that I like.” ― Jasmina Alexander"},{"quote":"“Maybe it’s not acting for you. Maybe it’s baseball or coding or taking care of kids. But whatever path you choose, whatever career you decide to go after, the important thing is that you keep finding joy in what you’re doing, especially when the joy isn’t finding you. Treat every day like you’re starring in it. Don’t wait for permission or good reviews. If you can do that, you’ll be surprised by how far you might end up sailing.” ― Lauren Graham, In Conclusion, Don't Worry About It"},{"quote":"“What is your job?\"\"Er, well, I'm the god of music.\"\"Then that is what I shall be. A god of music.\"Meg glanced back and smirked.I tried to give Crest an encouraging smile, but I hoped he would not ask to flay me alive and consume my essence. I already had a waiting list for that.” ― Rick Riordan, The Burning Maze"},{"quote":"“In a world of true abundance you shouldn't have to work to justify your life.” ― Sam Harris"},{"quote":"“But I knew I wanted to be with him, and he wanted to be with me, too, and also knew what he wanted to do with his life. So, we compromised. He took the job in Des Moines, and it was my responsibility to get a job that would make enough money for what we needed, and that I enjoyed enough. I didn’t have to love it, but it didn’t matter whether I did, either, because I had him. I kept trying new things, too, and eventually discovered pottery. It’s fun, of course, but the most important part is that I didn’t feel like my job had to be my everything.”This is what I have to keep reminding myself. Sometimes a job can just be a job. We aren’t all going to win the rat race. “I know.” ― Christina Lauren, Roomies"},{"quote":"“If you imagine a world of real abundance. Like a world where we built the right AI that's just pulling wealth out of the atmosphere and no one really has to work anymore, because we literally have machines that can build machines that can build machines, that are all powered by sunlight, that do everything better than we can. Now why wouldn't that be some kind of utopia? Well it wouldn't be a utopia because we have these very weird emotions, or many of us do, that make it seem like it would be wrong to spread the wealth around. Most people are living as though they want to live in a world where there's a few trillionaires living in compounds ringed by razor wire, and everyone else is sort of starving to death. It's like a winner take all scenario. And so, we have to find a new ethic whereby people are no longer—their purchase on existence is no longer justified by doing profitable work that other people will pay them for. In a world of true abundance you shouldn't have to work to justify your life. You should be free to enjoy the wealth of the world. If we are going to get to that place, we have to change our ethics around that.” ― Sam Harris"},{"quote":"“I used to often say to myself, I am being paid to do something that I enjoy doing, and I would do it for free, because it just felt so good doing it.” ― Alice Barker"},{"quote":"“Along with this escalation in material expectations has come an escalation in what counts as acceptable in work and in love. our job used to be counted satisfactory if it brought home the bacon. Not so today. It must also be meaningful. There must be room to move up. It must provide for a comfortable retirement. Coworkers must be congenial and the endeavor ecologically sound.Marriage also now requires more than it used to. It's no longer just a matter of raising children. Our mate must be eternally sexy, and thin, and interesting to talk to, and good at tennis.. these inflated expectations are rooted in the expansion of choice.” ― Martin E.P. Seligman, Learned Optimism: How to Change Your Mind and Your Life"},{"quote":"“Selling your time is slightly better than selling your body.” ― Mokokoma Mokhonoana"},{"quote":"“Our jobs determine what we deem more important: a painter is likely to claim that he or she would rather be deaf than be blind, whereas a singer is likely to claim the opposite.” ― Mokokoma Mokhonoana"},{"quote":"“Life to him seemed hollow, and existence but a burden.” ― Mark Twain, The Adventures of Tom Sawyer"},{"quote":"“The people who are best at any job have their own way of doing things.” ― Miss Manners"},{"quote":"“Sometimes it is not about whether or not it is your job. Sometimes it is about whether or not it needs to be done.” ― Jeffrey G. Duarte"},{"quote":"“Never measure success by other peoples standards. \"Accomplishing YOUR OWN goals gives YOU the right to dictate YOUR own Success.” ― Marlan Rico Lee"},{"quote":"“Millions of people will each be killed by their dream car, job, or lover.” ― Mokokoma Mokhonoana"},{"quote":"“Memories are made in the creation of fictional characters.” ― Mitta Xinindlu"},{"quote":"“My Work is Not My Life, My Life is My Work” ― shashidhar sa"},{"quote":"“Mungu angekuwa anababaishwa na mwili asingeruhusu Shetani autese mwili wa Ayubu kiasi chote kile isipokuwa roho yake, wala tusingekuwa tunateseka, wala watoto wadogo wasingekuwa wanakufa, wala watu wasiokuwa na hatia wasingekuwa wanakufa vitani au katika majanga mengine yoyote yale katika dunia hii.” ― Enock Maregesi"},{"quote":"“I really want to say Happy Workers Day, but I choose not to. With this high rate of unemployment and those who are Employed being under paid, undermined , mistreated and not respected. How can then there be Happy Workers with the conditions they face at their work place.” ― De philosopher DJ Kyos"},{"quote":"“And yet despite these shifts in employment patterns, most brand-name retail, service and restaurant chains have opted to put on economic blinders, insisting that they are still offering hobby jobs for kids. Never mind that the service sector is now filled with workers who have multiple university degrees, immigrants unable to find manufacturing jobs, laid-off nurses and teachers, and downsized middle managers. Never mind, too, that the students who do work in retail and fast food — as many of them do - are facing higher tuition costs, less financial assistance from parents and government and more years in school. Never mind that the food service workforce has been steadily aging over the last decade so that more than half are now over twenty-five years old. Or that a 1997 study found that 25 percent of non-management Canadian retail workers had been with the same company for eleven years or more and that 39 percent had been there for between four and ten years. That's a lot longer than \"Chainsaw\" Al Dunlap lasted as CEO of Sunbeam Corp. But never mind all that. Everyone knows that a job in the service sector is a hobby, and retail is a place where people go for \"experience,\" not a livelihood.” ― Naomi Klein, No Logo"},{"quote":"“(...) losing one's job is much less frightening when getting it seemed an accident in the first place.” ― Naomi Klein, No Logo"},{"quote":"“The job of a dream is to set you free.” ― Richie Norton"},{"quote":"“Dream up ways to allow your freedom to not be anchored to a job.” ― Richie Norton"},{"quote":"“Only when you read the adjective \"professional\" on the wrapping of a roll of toilet paper do you understand how profound the economic crisis in the country is.” ― Luigina Sgarro"},{"quote":"“Learning from your customers is vital to your success. Even if you work in a back office or don't deal directly with the public, you are serving someone in your job. You have a boss--and the boss is really your customer, right? You have to think of the people you work for (and if you have a job, your work for someone) as customers. Doing so gives you greater buy-in to the idea that your job is part of a bigger universe--it's not just you toiling away on a computer making sure the numbers add up (or whatever it is you do). Someone, somewhere, is counting on you to hold up your end of the bargain and to do your job better, and you can learn from that person (or people).” ― Jon Taffer, Don't Bullsh*t Yourself!: Crush the Excuses That Are Holding You Back"},{"quote":"“There are quite a few people around us performing the job of being our own personal sharpeners. Never a dull moment with them.” ― Jeffrey G. Duarte"},{"quote":"“High altitude astronomy was a dream job that turned into a nightmare over the course of a decade.” ― Steven Magee"},{"quote":"“Instead of complaining about your job, Remember that feeling of joy after receiving your first paycheck, and what promises you made to yourself.Continue to reflect on that positive energy.” ― Charmaine J. Forde"},{"quote":"“With pocket money we prepare schoolchildren for the part of their lives during which some people to whom they are not related will use money to make them do, every weekday for about eight hours, things they do not really want to do.” ― Mokokoma Mokhonoana"},{"quote":"“Lilian testifies eloquently to the misery that can ensue when the only challenge you can overcome in your own work is the challenge of coming to terms with the fact that you are not, in fact, presented with any challenges; when the only way you canexercise your powers is in coming up with creative ways to cover up the fact that youcannot exercise your powers; of managing the fact that you have, completely againstyour choosing, been turned into a parasite and fraud.” ― David Graeber , Bullshit Jobs: A Theory"},{"quote":"“You're not allowed pet the animals in a butcher's job.” ― Immanuel Mohan"},{"quote":"“A simple job becomes hard when you do it half-heartedly.” ― amit kalantri, Wealth of Words"},{"quote":"“A tongue doesn't get things done.” ― Amit Kalantri, Wealth of Words"},{"quote":"“If self-employment is the opposite of employed-by-other, than a job is outsourcing your freedom (time and talent) to a boss.” ― Richie Norton"},{"quote":"“While you are running after job, somebody is creating value for himself” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“If your time is under the control of your phone, your boss, parents, family, friends or job, that is what owns your life” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“It's all about motive. Climbing up and climbing out look the same on the outside.” ― Joyce Rachelle"},{"quote":"“Each part is necessary to make a whole.” ― Lailah Gifty Akita"},{"quote":"“To do what you love first find what you love.” ― Amit Kalantri, Wealth of Words"},{"quote":"“The easiest job is wealth.” ― Julieanne O'Connor"},{"quote":"“Overwork is repulsive to human nature—not work. Overwork for supplying the few with luxury—not work for the well-being of all. Work is a physiological necessity, a necessity of spending accumulated bodily energy, a necessity which is health and life itself. If so many branches of useful work are so reluctantly done now, it is merely because they mean overwork, or they are improperly organised. But we know—old Franklin knew it—that four hours of useful work every day would be more than sufficient for supplying everybody with the comfort of a moderately well-to-do middle-class house, if we all gave ourselves to productive work, and if we did not waste our productive powers as we do waste them now.” ― Pyotr Kropotkin, Anarchism: A Collection of Revolutionary Writings"},{"quote":"“Our jobs are robbing us of the time that should be invested” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“There is a huge difference between work and job” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“I am not celebrity rich, but I have a job, therefore I can help someone else in need, really, it's not that difficult.” ― Charmaine J Forde"},{"quote":"“A job should be given to those who deserve it, not those who demand it.” ― Amit Kalantri, Wealth of Words"},{"quote":"“What counts is not what we do for living but how we do it.” ― Talidari"},{"quote":"“Kazi ya mwenzio ni ngumu.” ― Enock Maregesi"},{"quote":"“Do the job and do it well.” ― Robert Galbraith, The Silkworm"},{"quote":"“Job’s wife went with her husband from a comfortable and well-supplied lifestyle to being homeless, bankrupt, and childless. She became a caregiver, as she had been to her entire family while they were alive and for her ill husband, who according to Scripture, was in so much physical pain that he wished for death (Job 2:12-13, Job 3). Perhaps the words that his wife uttered, was merely her way of ending the pain for her husband whom she had to witness suffering day after day. It only mentions Job’s three friends that came to comfort him. Job’s wife probably did not have a support network of other women to help and assist her. If she did, while they were affluent, these fair weather friends would probably not have wanted to get involved now. The saying: ‘Sympathy says “sorry” and runs away; empathy says “I understand” and stays’, rings so true. She probably subdued her own sorrow and pain and first took care of her husband’s pain. Yet, she, together with her husband, trusted in the goodness of God. And God blessed them.” ― Paddick Van Zyl"},{"quote":"“Yeah,” Robertson nodded grimly. “It’s the whole problem, isn’t it? People just doing their jobs.” ― Krzysztof Pacyński, A perfect Patricide: Part 1"},{"quote":"“Getting job cuts you off from what you could become” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“Getting a job cuts you off because you hardly have time to invest in yourself” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“If your job does not allow you extra time to develop yourself and add value to yourself, then you are cutting yourself off from the possibilities of the future that is waiting for you” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“Getting a job takes your time instead of making you take control of your time” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“When we get a job, we mortgage for salary” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“Getting a job is not the only way to survive” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“While you are busy looking for a job, and trying to survive, someone else is multiplying his gifts and creating value in products and services” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“A job should be a temporary thing” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“A lot of people today are seeking for jobs because of the people ahead of them whom they respect and envy” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“If your job is in control of your time, it is the job that is the owner of your life” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“Don’t just set out to do a good job, set out to do such a good job than the living, the dead or the unborn” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“But I was 22 when I started this job, and you know what? Sometimes it really is okay to just have a fucking job. Not a passion, not a career, but a steadfast source of bi-weekly income deposited directly into a checking account from which food, and medicine, and apps one totally forgot about having downloaded will be paid for.” ― Samantha Irby, We Are Never Meeting in Real Life."},{"quote":"“You don’t even have to love your job; you can merely love what your job does for you - the confidence and self-fulfillment that come with doing and earning.” ― Chimamanda Ngozi Adichie, Dear Ijeawele, or A Feminist Manifesto in Fifteen Suggestions"},{"quote":"“Among other possibilities, money was invented to make it possible for a foolish man to control wise men; a weak man, strong men; a child, old men; an ignorant man, knowledgeable men; and for a dwarf to control giants.” ― Mokokoma Mokhonoana, The Use and Misuse of Children"},{"quote":"“For their never-ending endeavours to obtain or retain wealth, countries desperately need companies, because they—unlike most human beings—have the means of production, and human beings, because they—unlike all companies—have the means of reproduction.” ― Mokokoma Mokhonoana, The Use and Misuse of Children"},{"quote":"“If you can't give it all you've got, don't bother.” ― Joyce Rachelle"},{"quote":"“To truly be satisfied in life, you must invest your time into doing what you were born to do instead of wasting your time trying to impress a boss or a company doing a job that you were not born for.” ― Sunday Adelaja, How To Become Great Through Time Conversion: Are you wasting time, spending time or investing time?"},{"quote":"“Our streets are littered with university graduates holding paper certificates and looking for a way to enslave themselves again under a boss in the name of looking for a job.” ― Sunday Adelaja, How To Become Great Through Time Conversion: Are you wasting time, spending time or investing time?"},{"quote":"“The worth of your strength cannot be measured in wages.” ― Lailah Gifty Akita"},{"quote":"“I work for a human rights organization, which strikes me as, if not interesting in the day to day sense, at least an interesting thing to tell people at parties. I'm pleased to be doing something that sounds significant and adult.” ― Nell Stevens, Bleaker House: Chasing My Novel to the End of the World"},{"quote":"“Another distraction that deviates people from their God given purpose and calling is the distraction of job and formal education.” ― Sunday Adelaja, How To Become Great Through Time Conversion: Are you wasting time, spending time or investing time?"},{"quote":"“You can never grow when you don’t place value on time” ― Sunday Adelaja"},{"quote":"“Understand the concept of time and find ways to maximize it effectively” ― Sunday Adelaja"},{"quote":"“Time is the source of all things” ― Sunday Adelaja"},{"quote":"“If you have to do the work, it well.” ― Lailah Gifty Akita"},{"quote":"“Of course, while Katherine took the accolades in stride, she never took the work for granted. Not a morning dawned that she didn't wake up eager to get to the office. The passion that she had for her job was a gift, one that few people ever experienced.” ― Margot Lee Shetterly, Hidden Figures"},{"quote":"“There's no greater joy than being able to touch People's hearts.” ― Ana Claudia Antunes, A-Z of Happiness: Tips for Living and Breaking Through the Chain that Separates You from Getting That Dream Job"},{"quote":"“What I want done, ain't a job of one. I need many me.” ― Scottshak"},{"quote":"“It did occur to him that perhaps he’d gone to the wrong Academy – the guys in the Space Fleet always had more interesting stories to tell at the spaceport bars. You know, tales about the dude who got vaporized in a plasma accident in the engineering section, or the fella who got turned into a blob of weird space jelly by some alien virus – or the time someone flew a starship into an astor-field at warp four by mistake (they were still trying to find the black box on that one). The Imperial Space Fleet’s recruiting office sure didn’t go around advertising ‘Join up, see the universe, meet interesting aliens and die screaming’, but it was known there were risks involved. It was part of the job after all, and yet somehow, they still got recruits signing up in droves. Yes, indeedy – the stories were far more interesting than his – took a load of ore to Gorda, took a load of mining equipment back to Tordrazil. Took a load of Florpavian Flame-birds to a zoo on Deanna, took a load of machinery to Salus. Picked up and dropped off a few passengers on the way. Still, Florpavian Flame-birds were a risky cargo… and damned tricky to transport – which is probably the only reason he’d had any entertainment at all on the last trip.” ― Christina Engela, Black Sunrise"},{"quote":"“Don't hire anyone you wouldn't want to run into in the hallway at three in the morning.” ― Tina Fey, Bossypants"},{"quote":"“Sometimes the gap between what you are and what you want to be is a little piece of paper called your college degree. So jump.” ― Joyce Rachelle"},{"quote":"“Hi Guys , i have a job for my website ayamjuve.com , can u join with me , and get more backlink .. poker” ― ayamjuve,poker online"},{"quote":"“Formal business situations are likely to be the least revealing because these are the times when all of us are most likely to have our ‘game faces' on.” ― Abhishek Ratna, No Parking. No Halt. Success Non Stop!"},{"quote":"“There is no competition in work. Many a man wants glory but fails to work.” ― Lailah Gifty Akita"},{"quote":"“The TSA liked having fresh agents on the job. Fresh agents with a clear mind and steady hand. Time travel wasn’t for the faint of heart. The pay was good though, but as Scrooby had decided long ago, that even if he didn’t get paid for it, the thrill alone was payment enough. Then again, the TSA realized they couldn’t afford to have disgruntled employees with too much time on their hands and the power of the gods at their fingertips, so the pay was very, very good. Debriefing was routine. And how he hated routine! His supervisor was a senior agent called Guy Krummeck, a rather drab character who liked his shiny silver suits almost as much as he liked to go over every little detail at least three times. Minimum. This time everything went right, so it went quick. Twenty minutes later, tired, he clocked out and went home to his small apartment. Tomorrow, after all, was another day again.” ― Christina Engela, The Time Saving Agency"},{"quote":"“If you try to do a task at your odd hours, you will waste so much time only to find out that you did a poor job after all.” ― Sunday Adelaja, How To Become Great Through Time Conversion: Are you wasting time, spending time or investing time?"},{"quote":"“If you invest your life into yourself, you are not pouring your life out somewhere, to some job or for some salary, you are re-investing it into yourself. You are multiplying the quality of your life.” ― Sunday Adelaja, How To Become Great Through Time Conversion: Are you wasting time, spending time or investing time?"},{"quote":"“O God give me enough grace for my daily work.” ― Lailah Gifty Akita"},{"quote":"“The comeback need to always be more effective than the downfall!” ― Jonathan Anthony Burkett"},{"quote":"“It was one of those situations where you just say fuck it. Fuck the job, fuck management.” ― Robert Charles Wilson, Burning Paradise"},{"quote":"“Do all the work you can while you still have strength.” ― Lailah Gifty Akita"},{"quote":"“The amount of time spent doing something is what adds value to it” ― Sunday Adelaja"},{"quote":"“Getting fired from work is not a death sentence” ― Sunday Adelaja"},{"quote":"“Investing time in adding value to yourself is the best way to invest time” ― Sunday Adelaja"},{"quote":"“You kill the biggest possible resource when you waste time” ― Sunday Adelaja"},{"quote":"“Getting fired from work is not a tragedy” ― Sunday Adelaja"},{"quote":"“Convert everything around you into meaningful products” ― Sunday Adelaja"},{"quote":"“Never allow a minute to pass without asking yourself what you did with the time” ― Sunday Adelaja"},{"quote":"“Find solitude and discover ways to add value to yourself” ― Sunday Adelaja"},{"quote":"“Control yourself every passing second and make sure that no unit of time is being wasted” ― Sunday Adelaja"},{"quote":"“Time is a rare resource and must be invested wisely” ― Sunday Adelaja"},{"quote":"“Invest in yourself by discovering your gift” ― Sunday Adelaja"},{"quote":"“Time is taken to derive wisdom” ― Sunday Adelaja"},{"quote":"“Wisdom is the result of time well spent” ― Sunday Adelaja"},{"quote":"“You can only gain the benefit of something when you invest and spend time” ― Sunday Adelaja"},{"quote":"“Nothing exists that is more valuable than time” ― Sunday Adelaja"},{"quote":"“The time you utilize doing something determines how good the product will be” ― Sunday Adelaja"},{"quote":"“Invest your time adding value to others” ― Sunday Adelaja"},{"quote":"“Always be a blessing to others” ― Sunday Adelaja"},{"quote":"“Time produces quality product” ― Sunday Adelaja"},{"quote":"“You throw away the substance from which life is made of when you waste time” ― Sunday Adelaja"},{"quote":"“Time is the source of greatness” ― Sunday Adelaja"},{"quote":"“Invest your time in producing product or service” ― Sunday Adelaja"},{"quote":"“Put your converted time into something productive” ― Sunday Adelaja"},{"quote":"“Covert your time for discovery” ― Sunday Adelaja"},{"quote":"“Production is the greatest assessment of time well spent” ― Sunday Adelaja"},{"quote":"“Convert your knowledge into product” ― Sunday Adelaja"},{"quote":"“Get your idea into image and find ways to convert it into tangible product” ― Sunday Adelaja"},{"quote":"“Wisdom is the ability to see the invisible” ― Sunday Adelaja"},{"quote":"“Use time to be a seeker of the Kingdom” ― Sunday Adelaja"},{"quote":"“Time can be used to convert anything” ― Sunday Adelaja"},{"quote":"“Time is the resource that gives birth to other things” ― Sunday Adelaja"},{"quote":"“Joblessness gives you access to a vast number of resources” ― Sunday Adelaja"},{"quote":"“Money should not be taken above time” ― Sunday Adelaja"},{"quote":"“Money is a product of time” ― Sunday Adelaja"},{"quote":"“Money is what you get in exchange with time invested” ― Sunday Adelaja"},{"quote":"“Money is created from time” ― Sunday Adelaja"},{"quote":"“Money is a compensation for time spent” ― Sunday Adelaja"},{"quote":"“Everything is derived from time” ― Sunday Adelaja"},{"quote":"“Joblessness gives you unlimited access to wealth” ― Sunday Adelaja"},{"quote":"“You can create any product from time” ― Sunday Adelaja"},{"quote":"“Always convert your time into wisdom” ― Sunday Adelaja"},{"quote":"“Joblessness gives you the resource through which you can create a new you” ― Sunday Adelaja"},{"quote":"“Use time to discover who you are” ― Sunday Adelaja"},{"quote":"“Use time to convert yourself” ― Sunday Adelaja"},{"quote":"“The tragedy of life is when you do not know what to do with time” ― Sunday Adelaja"},{"quote":"“Wasting time is when seconds, minutes and hours are passing without being converted” ― Sunday Adelaja"},{"quote":"“Life is the subtotal of time” ― Sunday Adelaja"},{"quote":"“Life is a totality of time” ― Sunday Adelaja"},{"quote":"“Time spent wisely gets compensated” ― Sunday Adelaja"},{"quote":"“Investment is the best thing to do with time” ― Sunday Adelaja"},{"quote":"“Investing in yourself is the best way to utilize time” ― Sunday Adelaja"},{"quote":"“You multiply your life when you invest it” ― Sunday Adelaja"},{"quote":"“The purpose of work is to labor and invest time in your gift” ― Sunday Adelaja"},{"quote":"“Occupy the earth with the multiplication of yourself” ― Sunday Adelaja"},{"quote":"“The next thing to do after discovering who you are is to build and add value to yourself” ― Sunday Adelaja"},{"quote":"“Add value to yourself by exchanging your time with knowledge” ― Sunday Adelaja"},{"quote":"“Use your time to gain knowledge” ― Sunday Adelaja"},{"quote":"“Convert your time into useful assets” ― Sunday Adelaja"},{"quote":"“Convert your time into value” ― Sunday Adelaja"},{"quote":"“Use your time to create yourself” ― Sunday Adelaja"},{"quote":"“Instead of complaining, discover ways, tactics and tricks on how to reach out to people” ― Sunday Adelaja"},{"quote":"“President Trump is doing a great job of demonstrating how mean the rich can be to the poor, sick and elderly.” ― Steven Magee"},{"quote":"“President Trump is doing a great job of demonstrating that politicians routinely lie to their electorate.” ― Steven Magee"},{"quote":"“Live your life as a practical example to others” ― Sunday Adelaja"},{"quote":"“If you don’t take care of the disenfranchised and outcasts of your city, they will come knocking on your door one day with revenge and bitterness” ― Sunday Adelaja"},{"quote":"“Your calling and destiny is where your pain and joy meet” ― Sunday Adelaja"},{"quote":"“Your calling and destiny is where your love and hate meet” ― Sunday Adelaja"},{"quote":"“Workdays are, I imagine, rather like learning to ice-skate Torvill and Dean’s The Bolero. They start and end easily enough; it’s the bit in the middle that causes the pain in the arse.” ― Fennel Hudson, Fine Things: Fennel's Journal No. 8"},{"quote":"“It is our duty as believers to bring joy and fortune to the less privileged among us” ― Sunday Adelaja"},{"quote":"“When you show love and empathy to people, you draw them closer to your beliefs and traditions” ― Sunday Adelaja"},{"quote":"“Bring solutions, results and change to people” ― Sunday Adelaja"},{"quote":"“You can’t make a difference if you are not trained in the principles of God” ― Sunday Adelaja"},{"quote":"“Take responsibility for the disenfranchised people” ― Sunday Adelaja"},{"quote":"“Make sure your sphere of influence is a piece of Heaven” ― Sunday Adelaja"},{"quote":"“You bring the influence of the Kingdom to the people by giving them things that would interest them” ― Sunday Adelaja"},{"quote":"“Be a source of motivation wherever you are as a believer” ― Sunday Adelaja"},{"quote":"“Losing your job gives you time” ― Sunday Adelaja"},{"quote":"“Time is the resource from which everything is made” ― Sunday Adelaja"},{"quote":"“Time is the material from which everything is made” ― Sunday Adelaja"},{"quote":"“Everything in existence evolves from time” ― Sunday Adelaja"},{"quote":"“We are products of time” ― Sunday Adelaja"},{"quote":"“We were created from time” ― Sunday Adelaja"},{"quote":"“Our resources are made from time” ― Sunday Adelaja"},{"quote":"“Everything physical is a creation of time” ― Sunday Adelaja"},{"quote":"“Humans are created out of time” ― Sunday Adelaja"},{"quote":"“Everything is a product of time because it took a particular period of time to achieve that result” ― Sunday Adelaja"},{"quote":"“Information that a book possesses is made of time” ― Sunday Adelaja"},{"quote":"“Everything good you see is a product of time well spent” ― Sunday Adelaja"},{"quote":"“The amount of time spent on a product will determine its value” ― Sunday Adelaja"},{"quote":"“Total time spent together with effort yields the value of a product” ― Sunday Adelaja"},{"quote":"“Don’t just be a church goer, find God” ― Sunday Adelaja"},{"quote":"“-“Why do men like you do the job you do? It can’t be for the medals. And it’s certainly not the money.”Stone said nothing.-“Why then? God and country?”-“Both simpler and more complex, Mr. President.”-“What then?”-“So I can look at myself in the mirror.” ― David Baldacci, Hell's Corner"},{"quote":"“When you become a transformer, you become faced with the challenge of skepticism” ― Sunday Adelaja"},{"quote":"“Use your influence to make impact and help others grow” ― Sunday Adelaja"},{"quote":"“Let your ways and actions be in honor of Christ” ― Sunday Adelaja"},{"quote":"“Expand your vision and widen your reasoning” ― Sunday Adelaja"},{"quote":"“You can’t change the world if you don’t know the principles of God” ― Sunday Adelaja"},{"quote":"“We should each be a carrier of the Kingdom” ― Sunday Adelaja"},{"quote":"“You shouldn’t claim the land alone but also take on responsibilities and change the land” ― Sunday Adelaja"},{"quote":"“You should always make an impact in the area of your calling” ― Sunday Adelaja"},{"quote":"“Always take responsibility for the social life of the people” ― Sunday Adelaja"},{"quote":"“As believers, we should make the Kingdom of God visible to the people” ― Sunday Adelaja"},{"quote":"“We can all make impact in achieving a common goal” ― Sunday Adelaja"},{"quote":"“Our goal is to reflect the Kingdom of God” ― Sunday Adelaja"},{"quote":"“Our sphere of influence should reflect righteousness” ― Sunday Adelaja"},{"quote":"“The Kingdom of God is about peace, love, joy and righteousness” ― Sunday Adelaja"},{"quote":"“You wouldn’t do things to hurt others if only you understood the principles of God” ― Sunday Adelaja"},{"quote":"“Take responsibility for the city” ― Sunday Adelaja"},{"quote":"“Influence is not about what you can do but how you use it to change the lives of others” ― Sunday Adelaja"},{"quote":"“Success without a successor is a failure” ― Sunday Adelaja"},{"quote":"“You should train disciples and followers to work and perform better than you did” ― Sunday Adelaja"},{"quote":"“Don’t be satisfied with a particular sphere of influence only” ― Sunday Adelaja"},{"quote":"“Always work on extending your territory and capacity” ― Sunday Adelaja"},{"quote":"“Our main mandate in our place of work is to make sure that the people open up their hearts to others” ― Sunday Adelaja"},{"quote":"“Use your work as a platform to bring the principles of God to the people” ― Sunday Adelaja"},{"quote":"“Be a source of influence to others” ― Sunday Adelaja"},{"quote":"“Be a history maker” ― Sunday Adelaja"},{"quote":"“Impact people’s lives positively” ― Sunday Adelaja"},{"quote":"“Faith with work yields fulfillment” ― Sunday Adelaja"},{"quote":"“We shouldn’t use God for our purpose alone but also be instruments of the extension of His Kingdom” ― Sunday Adelaja"},{"quote":"“Employment is world slavery” ― Sunday Adelaja"},{"quote":"“You need to answer questions on where, when and what to do” ― Sunday Adelaja"},{"quote":"“Employment should not be your permanent assignment” ― Sunday Adelaja"},{"quote":"“Poverty is the origin of invention” ― Sunday Adelaja"},{"quote":"“Make your life a meaningful one” ― Sunday Adelaja"},{"quote":"“Joblessness gives you life ownership” ― Sunday Adelaja"},{"quote":"“We were created to use our lives as an instrument and everything we have to extend God’s Kingdom” ― Sunday Adelaja"},{"quote":"“Once you become delivered, you have to find your calling and how to discover God’s purpose for your life” ― Sunday Adelaja"},{"quote":"“Identify darkness in the society and find ways to help illuminate it” ― Sunday Adelaja"},{"quote":"“Our identity should be about what sphere of life we ought to bring to light as Christians” ― Sunday Adelaja"},{"quote":"“Wisdom solves almost anything” ― Sunday Adelaja"},{"quote":"“Product must be intentional” ― Sunday Adelaja"},{"quote":"“Joblessness releases you from the world system” ― Sunday Adelaja"},{"quote":"“You can be the solution to the problems of the people” ― Sunday Adelaja"},{"quote":"“Life becomes a blessing when you discover your calling” ― Sunday Adelaja"},{"quote":"“Don’t try to use God to achieve your purpose. Rather, aim to achieve His” ― Sunday Adelaja"},{"quote":"“God does not just save you for your personal interest but for you to become a channel for the salvation of others” ― Sunday Adelaja"},{"quote":"“Your complaint should be a pointer to what God wants you to do” ― Sunday Adelaja"},{"quote":"“Go to the root of the problems of people and discover ways to save them” ― Sunday Adelaja"},{"quote":"“Our purpose as believers is to make impact wherever we find ourselves” ― Sunday Adelaja"},{"quote":"“Don’t wait for people to locate you. Rather, reach out to people and help to bring them to Christ” ― Sunday Adelaja"},{"quote":"“You have to be strategic in your action” ― Sunday Adelaja"},{"quote":"“You have to bring awareness to the society” ― Sunday Adelaja"},{"quote":"“You don’t live until you begin to live for keeping” ― Sunday Adelaja"},{"quote":"“Our identity as Christians is a purpose-driven life” ― Sunday Adelaja"},{"quote":"“We were created to be deliverers to the people” ― Sunday Adelaja"},{"quote":"“Your calling should be your territory” ― Sunday Adelaja"},{"quote":"“When you begin to pursue your promised land, you get a lot of prohibitions and temptations” ― Sunday Adelaja"},{"quote":"“The results you produce open doors for greater opportunities” ― Sunday Adelaja"},{"quote":"“Bring real and practical life experience to the people” ― Sunday Adelaja"},{"quote":"“Education is not merely meant for you to write and pass exams, get a good job and a good spouse, and settle down for survival.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Your daily choices and actions should be rational and productive” ― Sunday Adelaja"},{"quote":"“The disappearing time is the race of life” ― Sunday Adelaja"},{"quote":"“Never get discouraged because you got fired” ― Sunday Adelaja"},{"quote":"“A value added life is a fruitful life” ― Sunday Adelaja"},{"quote":"“Be disciplined and prudent in the way you manage your time” ― Sunday Adelaja"},{"quote":"“Be disciplined and effective in your relationship with God” ― Sunday Adelaja"},{"quote":"“Self-evaluation and assessment should be a major part of our lives as believers” ― Sunday Adelaja"},{"quote":"“Only your calling can give you fulfillment” ― Sunday Adelaja"},{"quote":"“Your employment hides your purpose” ― Sunday Adelaja"},{"quote":"“Proper and effective time management is the best way to make it in life” ― Sunday Adelaja"},{"quote":"“Your spiritual and physical growth depends mainly on your time management and personal relationship with God” ― Sunday Adelaja"},{"quote":"“Maximizing time is making sure that every second is accounted for” ― Sunday Adelaja"},{"quote":"“Don’t only think of which job to get and live on. Think about which problem to solve and the jobs will keep suggesting themselves.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“People who boast about age are actually forgetting something special. Age is not barrier to or elevator to success; that’s the job of vision.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“A day should be your controlling and managing factor” ― Sunday Adelaja"},{"quote":"“Understanding and discovering yourself is a critical aspect of your life” ― Sunday Adelaja"},{"quote":"“Not money, not fame and not positions can transform an enemy into a friend but rather, it is love that can do such a job.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Life’s product should be made intentionally and consciously” ― Sunday Adelaja"},{"quote":"“Time is a diminishing factor” ― Sunday Adelaja"},{"quote":"“The product of your life depends on your choices” ― Sunday Adelaja"},{"quote":"“You need to pursue purpose and time to be productive” ― Sunday Adelaja"},{"quote":"“Discover and understand the true essence of time so as to know how best to utilize and effectively manage it” ― Sunday Adelaja"},{"quote":"“Be optimistic and don’t ever get discouraged or give up no matter how vain it may seem initially” ― Sunday Adelaja"},{"quote":"“Product is an output of efforts, skills and time” ― Sunday Adelaja"},{"quote":"“Proper and effective use of time yields good result” ― Sunday Adelaja"},{"quote":"“Locate things that motivate you and surround yourself with people that inspire you” ― Sunday Adelaja"},{"quote":"“Don’t neglect or ignore every second that passes” ― Sunday Adelaja"},{"quote":"“Your environment should be your time marker” ― Sunday Adelaja"},{"quote":"“Life is the totality of time” ― Sunday Adelaja"},{"quote":"“Practice what you preach and let people learn from you” ― Sunday Adelaja"},{"quote":"“Expand and extend yourself to effectively fulfill purpose” ― Sunday Adelaja"},{"quote":"“You need to break free from the chain of employment to fully utilize and discover your potential” ― Sunday Adelaja"},{"quote":"“Wealth is as a result of the value of time” ― Sunday Adelaja"},{"quote":"“Employment leaves you bare and empty” ― Sunday Adelaja"},{"quote":"“Locate your own territory and help others achieve theirs” ― Sunday Adelaja"},{"quote":"“Fulfillment is the essence of our existence” ― Sunday Adelaja"},{"quote":"“Don’t just save yourself alone, also bring salvation the people around you” ― Sunday Adelaja"},{"quote":"“Maximize all your gifts and potentials” ― Sunday Adelaja"},{"quote":"“Bring relevance to people and help them achieve their goals” ― Sunday Adelaja"},{"quote":"“Don’t be restricted to your comfort zone alone” ― Sunday Adelaja"},{"quote":"“Diminishing returns is the outcome of restriction” ― Sunday Adelaja"},{"quote":"“To be relevant, you need to be purposeful” ― Sunday Adelaja"},{"quote":"“Be innovative and creative” ― Sunday Adelaja"},{"quote":"“Bring relevance to the people before teaching them to be believers” ― Sunday Adelaja"},{"quote":"“Find out the needs of the people you are ministering to and help them overcome their fears” ― Sunday Adelaja"},{"quote":"“Living a Christian life is not equivalent to living a religious one” ― Sunday Adelaja"},{"quote":"“Don’t just practice religion, abide by the principles of Christ” ― Sunday Adelaja"},{"quote":"“Your goal in life should be to produce concrete product” ― Sunday Adelaja"},{"quote":"“The church is supposed to help the people discover their calling and reveal the Kingdom of God to them” ― Sunday Adelaja"},{"quote":"“Always yearn to be an instrument for the Kingdom” ― Sunday Adelaja"},{"quote":"“Life’s opportunities are meant to be utilized and explored” ― Sunday Adelaja"},{"quote":"“God’s greatest investment in our lives is our calling” ― Sunday Adelaja"},{"quote":"“To waste time is to become wasted” ― Sunday Adelaja"},{"quote":"“The way we utilize our time as humans determines who we become” ― Sunday Adelaja"},{"quote":"“Life is as a result of time evolution” ― Sunday Adelaja"},{"quote":"“Time is God’s gift to us as humans” ― Sunday Adelaja"},{"quote":"“Productivity is the essence of life” ― Sunday Adelaja"},{"quote":"“Your calling is your life assignment” ― Sunday Adelaja"},{"quote":"“Your calling can never fail you” ― Sunday Adelaja"},{"quote":"“Be flexible and adapt easily to new things” ― Sunday Adelaja"},{"quote":"“Don’t let the things of the world distract you. Focus on your purpose” ― Sunday Adelaja"},{"quote":"“We are not here to build our empire only but also to help people discover the kingdom of God” ― Sunday Adelaja"},{"quote":"“Be proactive” ― Sunday Adelaja"},{"quote":"“Be the light and source of inspiration that others see” ― Sunday Adelaja"},{"quote":"“Don’t be too rigid, always be ready and eager to make new discoveries” ― Sunday Adelaja"},{"quote":"“It’s only when you find God that you can discover your calling” ― Sunday Adelaja"},{"quote":"“Carrying out our purpose as believers is God’s plan for our lives” ― Sunday Adelaja"},{"quote":"“Empower people to achieve their calling” ― Sunday Adelaja"},{"quote":"“The goal of the church is to bring the kingdom answers to the people” ― Sunday Adelaja"},{"quote":"“Every day is exciting when you don’t live your life based on religion alone” ― Sunday Adelaja"},{"quote":"“We should be selfless in our practice as believers” ― Sunday Adelaja"},{"quote":"“We all have the freedom to fulfill our calling” ― Sunday Adelaja"},{"quote":"“As Christians, we should live a Kingdom-driven life” ― Sunday Adelaja"},{"quote":"“Perfect study is the key to being effective in the land of your calling” ― Sunday Adelaja"},{"quote":"“Your calling should be a pointer for your skill development” ― Sunday Adelaja"},{"quote":"“Discovering God is the key to discovering purpose” ― Sunday Adelaja"},{"quote":"“God’s purpose for our lives is our calling” ― Sunday Adelaja"},{"quote":"“Purposefully living a life that glorifies the Kingdom is the essence of our creation” ― Sunday Adelaja"},{"quote":"“Everyone has their divine calling and purpose” ― Sunday Adelaja"},{"quote":"“The needs of the people around you should your utmost priority” ― Sunday Adelaja"},{"quote":"“The desire of the people should be the major instrument used to draw them closer to God” ― Sunday Adelaja"},{"quote":"“Our actions as believers should be extensive and comprehensive” ― Sunday Adelaja"},{"quote":"“You get more reach and influence when you are being productive” ― Sunday Adelaja"},{"quote":"“Spreading the Word of Christ and the Kingdom should be our goal as believers” ― Sunday Adelaja"},{"quote":"“Change the value system of the people you are ministering to” ― Sunday Adelaja"},{"quote":"“Teach the people with love and help them abide to biblical principles” ― Sunday Adelaja"},{"quote":"“Teach them to understand biblical principles before converting them” ― Sunday Adelaja"},{"quote":"“Reveal God to the people and teach them His ways” ― Sunday Adelaja"},{"quote":"“A life without purpose is meaningless” ― Sunday Adelaja"},{"quote":"“Eliminate all distractions and focus on things that add value to your life” ― Sunday Adelaja"},{"quote":"“Don’t let your society and environment dictate what you do with your time” ― Sunday Adelaja"},{"quote":"“For you to be effective in your promised land, you must study the land” ― Sunday Adelaja"},{"quote":"“Develop your skill around your calling” ― Sunday Adelaja"},{"quote":"“Walk and learn from the people that inspire you to do great things” ― Sunday Adelaja"},{"quote":"“A life without product is a wasted life” ― Sunday Adelaja"},{"quote":"“Empower yourself and discover what you can do with your life through hard work, concentration and research” ― Sunday Adelaja"},{"quote":"“Do not always act out of religion” ― Sunday Adelaja"},{"quote":"“Life is a race against disappearing time” ― Sunday Adelaja"},{"quote":"“Until you fight the battle against time, you won’t know how best to manage your time” ― Sunday Adelaja"},{"quote":"“Only you can succeed in converting your values into product can you win the battle against time” ― Sunday Adelaja"},{"quote":"“Purposefully spend time to better yourself” ― Sunday Adelaja"},{"quote":"“To get an effective product, you need to find your calling” ― Sunday Adelaja"},{"quote":"“Be intentional and purposeful in your calling” ― Sunday Adelaja"},{"quote":"“Dedicate time to yourself and do things that help you grow” ― Sunday Adelaja"},{"quote":"“Effectiveness in life is a measure of how many products you are able to produce in life” ― Sunday Adelaja"},{"quote":"“Monitor and control every passing day so as to live without regrets” ― Sunday Adelaja"},{"quote":"“It’ll never be too late to start to make use of the time you still have left” ― Sunday Adelaja"},{"quote":"“Take practical and rational steps in maximizing your time” ― Sunday Adelaja"},{"quote":"“Make optimum use of every second that passes daily” ― Sunday Adelaja"},{"quote":"“Time is the chronological breakdown of life” ― Sunday Adelaja"},{"quote":"“Be persistent and diligent in the way you spend your time daily” ― Sunday Adelaja"},{"quote":"“Be fearless in releasing the productivity of your time” ― Sunday Adelaja"},{"quote":"“Adding value to your life is the only way to fulfill your calling” ― Sunday Adelaja"},{"quote":"“After discovering your calling, the next challenge you are faced with is how to maximize your time” ― Sunday Adelaja"},{"quote":"“Wasting and losing time is equivalent to wasting and losing your life” ― Sunday Adelaja"},{"quote":"“Your calling helps you to have goals” ― Sunday Adelaja"},{"quote":"“Always work and take productive actions, do not rely on prayers and fasting alone” ― Sunday Adelaja"},{"quote":"“Dedicate time to discovering yourself and find out the purpose of your creation” ― Sunday Adelaja"},{"quote":"“Don’t be too engrossed with things of the world; discover your purpose in life” ― Sunday Adelaja"},{"quote":"“You either waste, spend or invest time. Make your choice wisely” ― Sunday Adelaja"},{"quote":"“You need to see time correctly for you not to waste your life” ― Sunday Adelaja"},{"quote":"“Don’t be controlled by the tradition of men” ― Sunday Adelaja"},{"quote":"“Your life should be of benefit to others and you should always inspire them” ― Sunday Adelaja"},{"quote":"“Losing your job releases you from the control of the world system” ― Sunday Adelaja"},{"quote":"“You have to discover the essence of your creation” ― Sunday Adelaja"},{"quote":"“Getting fired from work paves way for a new beginning” ― Sunday Adelaja"},{"quote":"“Time lost can never be regained” ― Sunday Adelaja"},{"quote":"“Make each day count” ― Sunday Adelaja"},{"quote":"“Never see yourself as a disappointment or failure just because you were fired” ― Sunday Adelaja"},{"quote":"“Always explore new opportunities and ideas, you never know which will work for you” ― Sunday Adelaja"},{"quote":"“We were built differently, locate you own calling and explore it” ― Sunday Adelaja"},{"quote":"“Never give up. It might not seem easy at first but in the end, it will all be worth it” ― Sunday Adelaja"},{"quote":"“The quality of your life depends on how you take control of your time” ― Sunday Adelaja"},{"quote":"“Avoid a wasteful life and make each unit of time count” ― Sunday Adelaja"},{"quote":"“Be conscious of your actions daily” ― Sunday Adelaja"},{"quote":"“Living without regrets is maximizing time” ― Sunday Adelaja"},{"quote":"“We have to consciously monitor and maximize our time effectively and efficiently” ― Sunday Adelaja"},{"quote":"“What you do with your time on a daily basis determines how far you will go in life” ― Sunday Adelaja"},{"quote":"“The greatest dilemma man has to face is figuring out what to do with his time” ― Sunday Adelaja"},{"quote":"“As you grow older, you become faced with the problem of what to with your time” ― Sunday Adelaja"},{"quote":"“If you don’t pursue purpose, you won’t know what to with your time” ― Sunday Adelaja"},{"quote":"“Stop killing and wasting time. Get something done today” ― Sunday Adelaja"},{"quote":"“As humans, we should be able to answer the question: “What do you do with your time?” ― Sunday Adelaja"},{"quote":"“Until you discover what you can do with your time, you won’t know how to go about crucial things” ― Sunday Adelaja"},{"quote":"“Time should be seen and assessed in seconds, minutes, hours and days” ― Sunday Adelaja"},{"quote":"“Time is one of the most important components of life” ― Sunday Adelaja"},{"quote":"“You must live a life of self-consciousness always” ― Sunday Adelaja"},{"quote":"“Time used to do irrelevancies can be channeled into something productive instead” ― Sunday Adelaja"},{"quote":"“The product you produced is the evidence of the value in your life” ― Sunday Adelaja"},{"quote":"“I think about the story of Job I heard in Carol Sharp's Sunday school. How he sort of learned to lean into feeling hurt at the end, the way you might lean into a heavy wind that almost winds up supporting you after a while.” ― Mary Karr, The Liars' Club"},{"quote":"“Don’t make your job your permanent assignment. Rather, make your work your permanent assignment” ― Sunday Adelaja"},{"quote":"“Losing your job releases you to think effectively and make rational decisions” ― Sunday Adelaja"},{"quote":"“Do not get a job for a living. Rather, get work” ― Sunday Adelaja"},{"quote":"“The desire to get money through jobs enslaves us” ― Sunday Adelaja"},{"quote":"“Getting fired from work gives you the zeal to make your own inventions” ― Sunday Adelaja"},{"quote":"“Work is an instrument through which you carry out your life mandate” ― Sunday Adelaja"},{"quote":"“Employment deprives you of innovations” ― Sunday Adelaja"},{"quote":"“Being an entrepreneur is the greatest investment” ― Sunday Adelaja"},{"quote":"“A job is a temporary need” ― Sunday Adelaja"},{"quote":"“You need to invest your time on earth” ― Sunday Adelaja"},{"quote":"“Joblessness does not necessarily mean idleness” ― Sunday Adelaja"},{"quote":"“Poverty is the mother of invention” ― Sunday Adelaja"},{"quote":"“Losing your job is a great blessing in disguise” ― Sunday Adelaja"},{"quote":"“You can become great through the power of time” ― Sunday Adelaja"},{"quote":"“You can achieve great things by utilizing your God-given talent” ― Sunday Adelaja"},{"quote":"“Losing your job is an awesome opportunity to look inside yourself and make new discoveries” ― Sunday Adelaja"},{"quote":"“You can resolve any situation with wisdom” ― Sunday Adelaja"},{"quote":"“Human existence is as a result of the product of time” ― Sunday Adelaja"},{"quote":"“Time given out through jobs can be channeled into something productive” ― Sunday Adelaja"},{"quote":"“Work is created to be an instrument through which you release your potential” ― Sunday Adelaja"},{"quote":"“There is a huge difference between work and a job” ― Sunday Adelaja"},{"quote":"“Employment deprives you of purpose” ― Sunday Adelaja"},{"quote":"“Work is an instrument through which you bring yourself to fulfillment” ― Sunday Adelaja"},{"quote":"“Getting employment is equivalent to cutting your life into pieces bit by bit” ― Sunday Adelaja"},{"quote":"“You can multiply your life through work, not jobs” ― Sunday Adelaja"},{"quote":"“When life goes, the body becomes weaker” ― Sunday Adelaja"},{"quote":"“Losing your job gives you the opportunity to make your life count” ― Sunday Adelaja"},{"quote":"“You need to discover how to invest your life” ― Sunday Adelaja"},{"quote":"“You need to discover the form in which God wants your life to be” ― Sunday Adelaja"},{"quote":"“If you do not work for your dream or purpose, someone else will hire you to fulfill his/hers” ― Sunday Adelaja"},{"quote":"“A job is a contract whereby you sell out a bit of your life daily” ― Sunday Adelaja"},{"quote":"“For every day spent at a job, you empty your life” ― Sunday Adelaja"},{"quote":"“Your job cannot sustain you, only your calling can” ― Sunday Adelaja"},{"quote":"“Employment deprives you of the purpose of existence” ― Sunday Adelaja"},{"quote":"“If you don’t leave your job, your job will leave you someday” ― Sunday Adelaja"},{"quote":"“Losing your job gives you access to time” ― Sunday Adelaja"},{"quote":"“Time is the greatest wealth” ― Sunday Adelaja"},{"quote":"“We were created to work (not have jobs) for a living” ― Sunday Adelaja"},{"quote":"“When you accept employment, you are admitting that you cannot think or develop yourself” ― Sunday Adelaja"},{"quote":"“Employment bargains your life and time for a piece of currency” ― Sunday Adelaja"},{"quote":"“Employment stereotypes you” ― Sunday Adelaja"},{"quote":"“Giving a piece of your life daily through employment makes you empty” ― Sunday Adelaja"},{"quote":"“We were created to be productive” ― Sunday Adelaja"},{"quote":"“Losing your job releases you from the contract of giving a piece of your life daily” ― Sunday Adelaja"},{"quote":"“Life is made up of time” ― Sunday Adelaja"},{"quote":"“The only way to make life fruitful is by being productive” ― Sunday Adelaja"},{"quote":"“You have to discover the essence of your life” ― Sunday Adelaja"},{"quote":"“After losing you job, you have to sit, relax and discover yourself” ― Sunday Adelaja"},{"quote":"“Discover your calling and add value to it” ― Sunday Adelaja"},{"quote":"“Devote time wisely to discover your true self” ― Sunday Adelaja"},{"quote":"“Your calling multiplies you” ― Sunday Adelaja"},{"quote":"“Joblessness gives you time to grow” ― Sunday Adelaja"},{"quote":"“To work (at a job) is to sacrifice the life you have at the moment” ― Sunday Adelaja"},{"quote":"“Want to keep your life? Look for work, not a job” ― Sunday Adelaja"},{"quote":"“Joblessness sets you free” ― Sunday Adelaja"},{"quote":"“Joblessness is an opportunity to fulfill purpose” ― Sunday Adelaja"},{"quote":"“Don’t make your job your assignment. Rather, make your life assignment your career and job” ― Sunday Adelaja"},{"quote":"“Employment is the greatest dream killer” ― Sunday Adelaja"},{"quote":"“Joblessness opens the door for greater opportunities” ― Sunday Adelaja"},{"quote":"“Many a death was precipitated by the food, the job, or the medication whose main function was to postpone it.” ― Mokokoma Mokhonoana"},{"quote":"“To those of you with your years of service still ahead, the challenge is yours. Stop doubting yourselves. Have the courage to make up your minds and hold your decisions. Refuse to be BOUGHT for a nickel, or a million dollars, or a job!” ― Mary McLeod Bethune"},{"quote":"“Our minds become slaves to those we see as having total power to control us and to cause pain to us. We are quick to give up control of ourselves to those who have the power to rule us as long as they also have the power to feed us. This is the fundamental construct of a feudal society.” ― Majid Kazmi, The First Dancer: How to be the first among equals and attract unlimited opportunities"},{"quote":"“Unless they are off duty, no matter how wide it is, and even when it is sincere, a smile seems fake if the job description of the person who is smiling includes smiling.” ― Mokokoma Mokhonoana"},{"quote":"“More often than not, an inspirational or motivational speaker is someone who makes money from telling us that we can do all of the things that we can do … and pretty much all of the things that we cannot do.” ― Mokokoma Mokhonoana"},{"quote":"“Even the enemy needs permission from God to do what he wants with you.” ― Joyce Rachelle"},{"quote":"“Choose a job you love, Your work is going to fill a large part of your life.” ― Napz Cherub Pellazo"},{"quote":"“Life must be lived in speed and focus” ― Sunday Adelaja"},{"quote":"“Job and salary is the greatest slavery you can ever set upon yourself” ― Sunday Adelaja"},{"quote":"“The world system enslaves through jobs” ― Sunday Adelaja"},{"quote":"“Time is the essence of life” ― Sunday Adelaja"},{"quote":"“Establish your system of control to see that your team does there job” ― Sunday Adelaja"},{"quote":"“The most dangerous job is to be a president - That's nothing more than a fact!” ― Deyth Banger"},{"quote":"“Siku moja, jambo baya litatokea. Labda babu yako au mnyama wako kipenzi atafariki au shangazi yako atagundulika na kansa. Labda utafukuzwa kazi au utaachika kwa mumeo au mkeo mliyependana sana. Labda rafiki yako kipenzi atapata ajali mbaya ya gari na utatakiwa kupeleka taarifa kwa ndugu na marafiki zake. Kutoa taarifa ya jambo baya kwa mtu ni kazi ngumu sawa na kupokea taarifa ya jambo baya kutoka kwa mtu. Kama umeteuliwa kupeleka taarifa ya kifo au ya jambo lolote baya kwa mtu fanya hivyo kwa makini. Toa taarifa ya msiba au ya jambo lolote baya kwa hekima na busara kama Ibrahimu alivyofanya kwa Sara kuhusiana na kafara ya Isaka, si kama Mbenyamini alivyofanya kwa Eli kuhusiana na kutwaliwa kwa sanduku la agano na kuuwawa kwa watoto wake wawili. Jidhibiti kwanza wewe mwenyewe kama umeteuliwa kupeleka taarifa ya kifo au ya jambo lolote baya. Angalia kama wewe ni mtu sahihi wa kupeleka taarifa hiyo. Pangilia mawazo ya kile unachotaka kwenda kukisema au unachotaka kwenda kukiandika. Mwangalie machoni, si usoni, yule unayempelekea taarifa kisha mwambie kwa sauti ya upole nini kimetokea.” ― Enock Maregesi"},{"quote":"“Joblessness is a blessing” ― Sunday Adelaja"},{"quote":"“Life is all about opportunities” ― Sunday Adelaja"},{"quote":"“Work is God’s great investment in you” ― Sunday Adelaja"},{"quote":"“Those who waste time eventually become wasted” ― Sunday Adelaja"},{"quote":"“Time management is the major difference between the rich and poor” ― Sunday Adelaja"},{"quote":"“Time is a concrete product” ― Sunday Adelaja"},{"quote":"“Losing your job sets you free from the controlling mandate of your work” ― Sunday Adelaja"},{"quote":"“Losing your job is an awesome opportunity for new discoveries” ― Sunday Adelaja"},{"quote":"“When you lose your job, you gain ownership of your life” ― Sunday Adelaja"},{"quote":"“Losing your job shows you the worth of your time rather the worth of money” ― Sunday Adelaja"},{"quote":"“All money comes from the worth of time” ― Sunday Adelaja"},{"quote":"“Losing your job makes you come face to face with the greatest wealth” ― Sunday Adelaja"},{"quote":"“The wealth of time is greater than the wealth of money” ― Sunday Adelaja"},{"quote":"“Life is a product of time” ― Sunday Adelaja"},{"quote":"“Time is the material from which life is made” ― Sunday Adelaja"},{"quote":"“Losing your job gives you the material from which life is made” ― Sunday Adelaja"},{"quote":"“Dear my strong girls, you will all go through that phase of life making a mistake of helping a toxic girl whose friendship with you turns into her self-interest. This kind of girls is a real burden towards the empowerment of other females as they can never get past their own insecurity and grow out of high-school-like drama. Despite how advanced we are in educating modern women, this type will still go through life living in identity crisis, endlessly looking for providers of any kind at the end of the day. They can never stand up for others or things that matter because they can't stand up for themselves. They care what everyone thinks only doing things to impress men, friends, strangers, everyone in society except themselves, while at the same time can't stand seeing other women with purpose get what those women want in life. But let me tell you, this is nothing new, let them compete and compare with you as much as they wish, be it your career, love or spirit. You know who you are and you will know who your true girls are by weeding out girls that break our girlie code of honor, but do me a favor by losing this type of people for good. Remind yourself to never waste time with a person who likes to betray others' trust, never. Disloyalty is a trait that can't be cured. Bless yourself that you see a person's true colors sooner than later. With love, your mama. XOXO” ― Shannon L. Alder"},{"quote":"“To be successful, look for the job you will take if you don't need a job” ― Warren Buffett"},{"quote":"“It was going to be our job to annoy someone?” “I know—it’s a dream come true!” ― Joel N. Ross, The Lost Compass"},{"quote":"“A true professional not only follows but loves the processes, policies and principles set by his profession.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Beaming into the thick of a tree without becoming a lifelong tree hugger was a tricky business. A precision job. Scrooby’s job at the Time Saving Agency was a tough one. Billions of lives depended on him not screwing up. Literally billions and billions. Once, he’d screwed up in only a very small way and people wore those little yellow smiley faces on t-shirts for decades afterwards – and that was just a small screw up. He sighed. Here he sat, in the branches of an apple tree in an apple tree orchard – and without a single apple in sight. Below him, Isaac was waiting to get bonked on the noggin with an apple so that he could fulfill history by toddling off to invent gravity and shape scientific and mathematical principles for generations to come. Only one problem – no apples.” ― Christina Engela"},{"quote":"“Here’s the thing, people: We have some serious problems. The lights are off. And it seems like that’s affecting the water flow in part of town. So, no baths or showers, okay? But the situation is that we think Caine is short of food, which means he’s not going to be able to hold out very long at the power plant.”“How long?” someone yelled.Sam shook his head. “I don’t know.”“Why can’t you get him to leave?”“Because I can’t, that’s why,” Sam snapped, letting some of his anger show. “Because I’m not Superman, all right? Look, he’s inside the plant. The walls are thick. He has guns, he has Jack, he has Drake, and he has his own powers. I can’t get him out of there without getting some of our people killed. Anybody want to volunteer for that?\"Silence.“Yeah, I thought so. I can’t get you people to show up and pick melons, let alone throw down with Drake.”“That’s your job,” Zil said.“Oh, I see,” Sam said. The resentment he’d held in now came boiling to the surface. “It’s my job to pick the fruit, and collect the trash, and ration the food, and catch Hunter, and stop Caine, and settle every stupid little fight, and make sure kids get a visit from the Tooth Fairy. What’s your job, Zil? Oh, right: you spray hateful graffiti. Thanks for taking care of that, I don’t know how we’d ever manage without you.”“Sam…,” Astrid said, just loud enough for him to hear. A warning.Too late. He was going to say what needed saying.“And the rest of you. How many of you have done a single, lousy thing in the last two weeks aside from sitting around playing Xbox or watching movies?“Let me explain something to you people. I’m not your parents. I’m a fifteen-year-old kid. I’m a kid, just like all of you. I don’t happen to have any magic ability to make food suddenly appear. I can’t just snap my fingers and make all your problems go away. I’m just a kid.”As soon as the words were out of his mouth, Sam knew he had crossed the line. He had said the fateful words so many had used as an excuse before him. How many hundreds of times had he heard, “I’m just a kid.”But now he seemed unable to stop the words from tumbling out. “Look, I have an eighth-grade education. Just because I have powers doesn’t mean I’m Dumbledore or George Washington or Martin Luther King. Until all this happened I was just a B student. All I wanted to do was surf. I wanted to grow up to be Dru Adler or Kelly Slater, just, you know, a really good surfer.”The crowd was dead quiet now. Of course they were quiet, some still-functioning part of his mind thought bitterly, it’s entertaining watching someone melt down in public.“I’m doing the best I can,” Sam said.“I lost people today…I…I screwed up. I should have figured out Caine might go after the power plant.”Silence.“I’m doing the best I can.”No one said a word.Sam refused to meet Astrid’s eyes. If he saw pity there, he would fall apart completely.“I’m sorry,” he said.“I’m sorry.” ― Michael Grant, Hunger"},{"quote":"“And he thought of the two people who had held his job before him: Sam and Astrid. Both beaten into despair by trying to hold this group of kids together in the face of one disaster after another. Both of them now happy to let Edilio handle it.“No wonder,” Edilio muttered.“Stay inside unless absolutely necessary,” Edilio shouted, and not for the first or last time wished he was still just Sam’s faithful sidekick.” ― Michael Grant, Plague"},{"quote":"“If the food that one ate the night before were somehow able to be seen and identified through one’s clothes throughout the day, millions of employees would each fast ten or so days before their payday.” ― Mokokoma Mokhonoana"},{"quote":"“With today’s technology, social attitudes and appetite for self-actualisation, we’d ideally look upon our work with a sense of pride, involvement and accomplishment. But we’re rarely given the chance. Instead, we pretend to love our jobs with an almost idiotic zeal, while being secretly exhausted and insulted by them.” ― Robert Wringham, Escape Everything!"},{"quote":"“It is the sweat of the servants that make their squire look smart.” ― Amit Kalantri, Wealth of Words"},{"quote":"“The purpose of a profession is to fulfil the personal wishes of a prospect.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Every profession is an island whose inhabitants earn a precarious living by taking in each other’s washing.” ― Amanda Craig, A Vicious Circle"},{"quote":"“...if you do the job no one wants, you might eventually get the job everybody wants. But you have to be willing to climb the ladder, starting with the bottom rung.” ― Mark Batterson, All In: You Are One Decision Away From a Totally Different Life"},{"quote":"“What would be wicked would be to say, 'I will not give this person a job because he belongs to this category of people, and there's some kind of statistical tendency for this category of person to be different from that category...' Treat them as individuals! Look at the qualifications of this individual, and forget about the group, race, whatever you want to call it, to which he belongs.” ― Richard Dawkins"},{"quote":"“Everybody knows how others should do their jobs - but they don't know how to do theirs.” ― Nabil N. Jamal"},{"quote":"“But now ask the beasts, and let them teach you; And the birds of the heavens, and let them tell you. Or speak to the Earth, and let it teach you; And the fish of the sea declare to you. Who among all these does not know that the hand of the Lord has done this,In whose hand is the life of every living thing,And the breath of all mankind?” ― Job 12:7-10"},{"quote":"“Quinn came forward and Sam pulled him aside. His old friend looked tortured and sad.“What’s up, brah?” Sam asked.Quinn couldn’t speak. He was choked with emotion. “Dude . . .”“You want to stay in town.”“My crews . . . my boats and all . . .”Sam put a hand on his shoulder. “Quinn, I’m glad you found something so important to do. Something you really like.”“Yeah, but . . .”Sam pulled him into a brief hug. “You and me, we’re still friends, man. But you have responsibilities.” ― Michael Grant, Plague"},{"quote":"“Rich can live better than poor but they cannot live without poor.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Oh...oh... \"You\" the big job... should we be impressed!?” ― Deyth Banger, Code"},{"quote":"“He loved adventure but then he got hired by accenture!” ― Himmilicious"},{"quote":"“In a nice little house in Atro City there lived a man called Doktor Gleichstein. He was a kind of scientist, and he was very good at his job, which is why he always worked from home. He looked a little funny because he kept losing his eyebrows. Quantum Physics, is sort of like ordinary Physics, only you tend to spend a lot more time looking for the cat. He worked in the sitting room because he’d blown the garage up once already. Apparently a lot of things happened by accident in Quantum Physics.” ― Christina Engela, Innocent Minds"},{"quote":"“LIFE PLAN FOR YOUR DREAMPlan A - Apply for a job and use it to Finance Your dream.Plan B - Borrow Other People's Money (OPM) to Finance your dream if you don't want the job route.Plan C - Consider working full time and pursue your dream part-time.Plan D - Diligently work on your dream until it overtakes your job.Plan E - Effect a paradigm shift by making your dream full time and your job part time.Plan F - F means time to Fire your boss.” ― Oscar Bimpong"},{"quote":"“When you have a Job, it means someone has placed a limitation of TIME on you. Meaning every aspect of your life is controlled. It becomes stressing when you are at the bottom of the Career Ladder.” ― Oscar Bimpong"},{"quote":"“He’s dying!’ Doctor Cove, one of the ship’s two medical officers told me, looking at his med-scanner as he kneeled at the broken body of the only living Corsair on the black ship. I remember the look on his face as he told me – which seemed more to be puzzlement than actual concern. The man was a Corsair after all, and had injuries I could see, but he was conscious, and none of them looked fatal. But then, I’m no doctor. I never was any good at healing anything – and my job was doing the opposite, and I admit I’m pretty good at it. Always have been.” ― Christina Engela, Space Vacation"},{"quote":"“You can't fulfill your calling inside your comfort zone.” ― Johnathan Key"},{"quote":"“A job should only be a means of attaining the highest goal” ― Sunday Adelaja"},{"quote":"“You can change your Job but u cannot choose your calling” ― Sunday Adelaja"},{"quote":"“When you a get a job you are not qualified for, it will be evil to you and to your community.” ― Sunday Adelaja"},{"quote":"“For the present time, just do your job well” ― Sunday Adelaja"},{"quote":"“Rich people don’t work for money, they are doing what they like to do; they devote themselves to a job they love and do not live waiting for a well-deserved rest or retirement, but work passionately until the end of their lives” ― Sunday Adelaja"},{"quote":"“Do you know what happens when you play a country song backwards? You get your wife back, your dog back and your job back.” ― Richard Belzer"},{"quote":"“Two questions I'm pondering:1. If money didn't exist, would you still chase your dreams?2. If money didn't exist, would you still keep your job?If the answer is \"YES\" to both, you're on track. If the answer is \"NO\" to either, what needs to change?” ― Richie Norton"},{"quote":"“Stop chasing society’s definition of success and chase your own definition of success. Success is an emotion that is experienced when you are completely fulfilled and content with where you are in life; it has nothing to do with a specific job, a specific amount of money in your bank account, or the quality of material possessions you acquire. You can be the richest man in the world, but still, feel unsuccessful, and you can be the poorest man in the world, but still, feel extremely successful.” ― Kyle D. Jones"},{"quote":"“We are born, we get names, we get educated, we get values, we get job and money. But all this is not life, life is love found in friendship, friendship found in love and in love, sacrifice.” Vijay” ― Shaikh Ashraf, Friendship, Love & Sacrifice"},{"quote":"“For many people, a western lifestyle equates to living in a toxic home, working a toxic job, eating toxic food, being sick from your thirties onward and eventually dying from preventable disease.” ― Steven Magee"},{"quote":"“Maybe it wasn’t rational, but she didn’t like the idea of Leo invading her little world. Yesterday, Brooklyn had belonged to her. The Long Island ’burbs where she’d grown up had felt far away from the brick streets and renovated factory spaces of Brooklyn. In this job, she’d felt truly independent, putting down her own fragile roots in a new place. Fast forward twenty-four hours, and her daddy had joined the workplace and her ex-boyfriend had shown up to remind her of all that she’d lost. Really, a girl could be forgiven for feeling slightly hysterical. Not that there was any time to panic.” ― Sarina Bowen, Rookie Move"},{"quote":"“32. Before you criticize your parents for their failures and mistakes, ask yourself: “Will I really do that much better with my own children?” The job is tougher than it looks, and mistakes are inevitable!” ― James C. Dobson, Life on the Edge: The Next Generation's Guide to a Meaningful Future"},{"quote":"“For several people the challenge with the dream isn't bread & butter but the luxury.” ― Santosh Avvannavar, God's Table: The Last Supper"},{"quote":"“I notice you use 'work' and 'job' interchangeably. oughten to do that. A job's what you force yourself to pay attention to for money. With work, you don't have to force yourself. (Man dining at Claudia Sanders Dinner House)” ― William Least Heat-Moon, Blue Highways"},{"quote":"“He loved his job. What was advertising, anyway, but a knowledge of people and of which buttons to push to nudge them into opening their wallets?It was, he often though, an accepted, creative, even expected twist on picking those wallets. For a man who had spent the first half of his life as a thief, it was the perfect career.” ― Nora Roberts, Rising Tides"},{"quote":"“As I indicated in an earlier chapter, it is so important to pause and think through some of these basic issues while you are young, before the pressures of job and family become distracting. Everyone must deal with the eternal questions sooner or later. You will benefit, I think, from doing that work now. As I said earlier, whether you are an atheist, a Muslim, a Buddhist, a Jew, a New Ager, an agnostic, or a Christian, the questions confronting the human family are the same. Only the answers will differ.” ― James C. Dobson, Life on the Edge: The Next Generation's Guide to a Meaningful Future"},{"quote":"“Self-introspection is the way to improve any company, any marriage, any nation. And any job-hunt.” ― Richard N. Bolles, What Color Is Your Parachute? 2012: A Practical Manual for Job-Hunters and Career-Changers"},{"quote":"“If someone out of work knows only three words about their impending job-hunt, I’m willing to bet thosethree words will be: resumes/CV, interviews, and networking.” ― Richard N. Bolles"},{"quote":"“It is a great victory if you learn how to survive in today’s hard times; it’s an even greater victory if youhelp someone else survive and find meaningful work.” ― Richard N. Bolles, What Color Is Your Parachute? 2012: A Practical Manual for Job-Hunters and Career-Changers"},{"quote":"“One day a man has a job, and life is full of possibilities. The next day the job and the car are gone, and the man cannot look his wife in the eye.” ― Anita Shreve, Sea Glass"},{"quote":"“In a job you trade your freedom and time for money.” ― Ken Poirot"},{"quote":"“Police officers are poorly paid for a very stressful job that has them in very high powered radio frequency (RF) fields and in a daily environment that may result in them being assaulted, maimed or killed.” ― Steven Magee"},{"quote":"“Getting accepted or rejected is based on factors for a job is mere for selection and not the result. Life has bigger results awaiting to face! Face it with a smile!” ― Santosh Avvannavar, Get a Job WITHOUT an Interview - Google and Beyond: \"We don't mind to lose a good applicant, but definitely not hire a bad applicant.\""},{"quote":"“I had never considered that you might miss a job like you missed a limb -- a constant, reflexive thing. I hadn't thought as well as the obvious fears about money, and your future, losing your job would make you feel inadequate, and a bit useless. That it would be harder to get up in the morning than you were rudely shocked in to consciousness by the alarm. That you might missed the people you worked with, no matter how little you had in common with them.” ― Jojo Moyes, Me Before You"},{"quote":"“Many a woman would not be in a relationship with or married to her man, if he earned half of what he earns; and many a man would not be in a relationship with or married to his woman, if he earned twice as much as he earns.” ― Mokokoma Mokhonoana"},{"quote":"“Schedule a sit-down with your direct boss and establish what she expects you to be focusing on in the first days and weeks of the job. Take written notes and determine—this is especially important—what your deadlines are. … Then be sure to request feedback about how you’re doing. A few weeks after you’ve started, schedule another meeting with your boss. Don’t say, “Am I doing okay?” Say, “I’m really enjoying my job. Are there any suggestions you’d offer?” ― Kate White, I Shouldn't Be Telling You This: Success Secrets Every Gutsy Girl Should Know"},{"quote":"“Smile at people, pop your head into your boss’s office regularly and say hello, and come to your first meeting with something really smart to say.” ― Kate White, I Shouldn't Be Telling You This: Success Secrets Every Gutsy Girl Should Know"},{"quote":"“Not just one way to describe ourselves, but two ways, at least.Not just one way to hunt for a job, but two ways, at least.Not just one kind of job to hunt for, but two kinds of jobs, at least.Not just one size company to go after, but two sizes, at least.Not just one place we really would like to work at, but two places, at least.” ― Richard N. Bolles, What Color Is Your Parachute? 2012: A Practical Manual for Job-Hunters and Career-Changers"},{"quote":"“Just because you can’t find them doesn’t mean they don’t exist. You’ve got to change the way you’relooking for them. Because there are always job vacancies out there.” ― Richard N. Bolles, What Color Is Your Parachute? 2012: A Practical Manual for Job-Hunters and Career-Changers"},{"quote":"“The success of your job-hunt dependson you—with a little help from your friends. You must be in charge of it. You must plan it. You mustdirect it. You must know what works and what doesn’t work. Your job-hunt is by its very nature a“self-directed search.” ― Richard N. Bolles, What Color Is Your Parachute? 2012: A Practical Manual for Job-Hunters and Career-Changers"},{"quote":"“Most job-hunters (and even a few resume writers)assume a resume’s purpose is to “sell you,” or secure you a job. No, no, no. Its only purpose is to get youan interview. Selling is what you do after you’re in the interview room. It’s your task, when you’re face to face, notthat piece of paper’s.” ― Richard N. Bolles, What Color Is Your Parachute? 2012: A Practical Manual for Job-Hunters and Career-Changers"},{"quote":"“For many of us, the job-hunt offers a chance to make some fundamental changes in our whole life. It marksa turning point in how we live our life.It gives us a chance to ponder and reflect, to extend our mental horizons, to go deeper into the subsoilof our soul.It gives us a chance to wrestle with the question, “Why am I here on Earth?” We don’t want to feel thatwe are just another grain of sand lying on the beach called humanity, unnumbered and lost in the billionsof other human beings.We want to do more than plod through life, going to work, coming home from work. We want to findthat special joy, “that no one can take from us,” which comes from having a sense of Mission in our life.We want to feel we were put here on Earth for some special purpose, to do some unique work that onlywe can accomplish.We want to know what our Mission is.” ― Richard N. Bolles, What Color Is Your Parachute? 2012: A Practical Manual for Job-Hunters and Career-Changers"},{"quote":"“Electricians that like good health avoid the known biologically toxic very high powered electrical utility jobs.” ― Steven Magee"},{"quote":"“A job is the ultimate pyramid scheme.” ― Ken Poirot"},{"quote":"“My job is to entertain people by playing my music well. You shouldn't really be upset because people like you, should you?” ― Oliver"},{"quote":"“When you are unemployed, weekends are seven days long.” ― Mokokoma Mokhonoana"},{"quote":"“In any career, there is a moment when you are no longer need to be pushed up from below, but rather pulled up from above. Know when that moment comes and adjust your strategy accordingly.” ― Clifford Cohen"},{"quote":"“He who makes $25,000 annually through passive income is more enviable than he who earns $100,000 annually through a salary.” ― Mokokoma Mokhonoana"},{"quote":"“Idleness is a form of passivity in an active universe.” ― Michael Bassey Johnson, The Book of Maxims, Poems and Anecdotes"},{"quote":"“Wishes don’t change the world. Only actions will do that job.” ― Israelmore Ayivor, 101 Keys To Everyday Passion"},{"quote":"“Individual talent is an obstruction principally among teams that employ the facade of a synergy to diminish the majorities mediocrity.” ― Anthony Corlisatra"},{"quote":"“In a patriarchal society, one of the most important functions of the institution of the family is to make feel like a somebody whenever he is in his own yard a man who is a nobody whenever he is in his employer’s yard.” ― Mokokoma Mokhonoana"},{"quote":"“Don´t let your work define you. But let you define what works for you to defy and refine you even more.” ― Ana Claudia Antunes, A-Z of Happiness: Tips for Living and Breaking Through the Chain that Separates You from Getting That Dream Job"},{"quote":"“Some people will each start investing more of their salary on ‘their’ house and spending less of it on ‘their’ car or cars only when they start being able to take ‘their’ house to work, funerals, weddings, etc.” ― Mokokoma Mokhonoana"},{"quote":"“Education can provide bread and training can provide butter for the bread – that is going to soften from inside to help in looking at the perspective, change behavior and change perception” ― Santosh Avvannavar, Get a Job WITHOUT an Interview - Google and Beyond: \"We don't mind to lose a good applicant, but definitely not hire a bad applicant.\""},{"quote":"“It is only if the primary or only reason you do what you do is to make money that you will envy every random person who made or makes a lot of money (or money that exceeds what you made or make).” ― Mokokoma Mokhonoana"},{"quote":"“Career isn't about making money as everyone makes something. Rather it's a way of living that would create memorable memories to look back and smile” ― Santosh Avvannavar, Get a Job WITHOUT an Interview - Google and Beyond: \"We don't mind to lose a good applicant, but definitely not hire a bad applicant.\""},{"quote":"“A good interview is one that makes you feel interviewer was good who gifted the thoughts for years to come, those still lingering with several questions that need to be answered and scenarios that weren't touched upon. And yet you receive an offer.” ― Santosh Avvannavar, Get a Job WITHOUT an Interview - Google and Beyond: \"We don't mind to lose a good applicant, but definitely not hire a bad applicant.\""},{"quote":"“Lie Test: Do you want to check if your present role is a dream job? The following thought should answer your dilemma - \"If you are truly involved in your tasks at work, eight hours can make you feel few minutes; otherwise one would feel few minutes as eight hours\" Your mind can never lie! What did your test telling you?” ― Santosh Avvannavar, Get a Job WITHOUT an Interview - Google and Beyond: \"We don't mind to lose a good applicant, but definitely not hire a bad applicant.\""},{"quote":"“If you can find your perfect job, create one.” ― Lailah Gifty Akita"},{"quote":"“Explore the endless opportunities in life.” ― Lailah Gifty Akita"},{"quote":"“While you wait for your dream job, you can engage yourself with the available job.” ― Lailah Gifty Akita"},{"quote":"“Do the job for the joy of work.” ― Lailah Gifty Akita"},{"quote":"“Create the job, we wish to have.” ― Lailah Gifty Akita"},{"quote":"“Phronesis is a beautiful virtue, practise it and you shall reap the rewards…” ― Shana Pascoa"},{"quote":"“Not every poor or unemployed person who has one wears a political party’s t-shirt to reveal their political affiliation; some use it merely to conceal their nipples.” ― Mokokoma Mokhonoana"},{"quote":"“i'd rather not look for a job... to let a fine one find me. And that definitely wouldn't define me as a snob!;)” ― Ana Claudia Antunes, A-Z of Happiness: Tips for Living and Breaking Through the Chain that Separates You from Getting That Dream Job"},{"quote":"“As an applicant, you need to show recruiters that you have the skills, experience and knowledge that they need, and provide the evidence of this in a tailored application.” ― Chidiebere Prosper Agbugba"},{"quote":"“Energy should be used to check out stuff and think on them... So far I used it to criticize victims and killers... So far it's awesome job.” ― Deyth Banger"},{"quote":"“A big name or a big designation doesn't make a man big but responsibilities do.” ― Vikash Shrivastava"},{"quote":"“When I was instructed to use medical oxygen to do my job at the W. M. Keck Observatory from 2001 to 2006, I was never told about the legal health information that is now posted on oxygen cylinders. My memories of the green medical oxygen cylinders that we would use daily is that they had no information on them and we were never given a recognised legal oxygen administration training course for routine daily use or a medical prescription from a doctor. We were shown the three oxygen cylinders at the facility and told to use them whenever we developed headaches, which was multiple times daily. It was common to find all three oxygen cylinders in use by other very high altitude workers and to have to line up to get a turn on the magical medical gas.” ― Steven Magee"},{"quote":"“Working for OSHA is a horrible job to have. You have to ignore the whistle blowers and send them illegal letters saying that you cannot find any problems. I have a lot of those fraudulent letters, as I have been through OSHA twice. Once as the utility company employee and once as the utility company subcontractor employee. It is a disgusting & blatently corrupt system.” ― Steven Magee"},{"quote":"“News is how the government delivers propaganda to the masses and it is an essential requirement of the television broadcasting job to be emotionless to this.” ― Steven Magee"},{"quote":"“Europe, the land of easy mathematics where he who works adds up and he who retires subtracts. The land where the economy gets to stagger all over the continent.” ― Núria Añó"},{"quote":"“If you are looking for a job that may make you sick, I can recommend working at a high powered solar photovoltaic (PV) utility power plant.” ― Steven Magee"},{"quote":"“Pick a leader who will make their citizens proud. One who will stir the hearts of the people, so that the sons and daughters of a given nation strive to emulate their leader's greatness. Only then will a nation be truly great, when a leader inspires and produces citizens worthy of becoming future leaders, honorable decision makers and peacemakers. And in these times, a great leader must be extremely brave. Their leadership must be steered only by their conscience, not a bribe.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“If it was bliss to be alive, to hunt was rapture.” ― Barbara W. Tuchman, The Proud Tower: A Portrait of the World Before the War, 1890-1914"},{"quote":"“Passion does not translate easily into good income.” ― Philip Zaleski, The Fellowship: The Literary Lives of the Inklings: J.R.R. Tolkien, C.S. Lewis, Owen Barfield, Charles Williams"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“Usimdharau mtu aliyesaidia kukupa kazi ulipokuwa huna kazi, wala usimdharau mtu aliyesaidia kukulea ulipokuwa mdogo, au mtu aliyeokoa maisha yako au mtu aliyekusaidia kwa namna yoyote ile. Ukimdharau, utakaposhuka, atakusaidia kwa rehema za Mwenyezi Mungu.” ― Enock Maregesi"},{"quote":"“Even his own speeches bored him.” ― Barbara W. Tuchman, The Proud Tower: A Portrait of the World Before the War, 1890-1914"},{"quote":"“Idolatry means turning a good thing into the ultimate thing.” ― Timothy Keller"},{"quote":"“Don't sweat the small stuff\" doesn't work with parenting small children. They only work in small stuff. They aren't making company decisions. They are deciding whether to use a crayon on the wall. – Bill Klein” ― The Little Couple"},{"quote":"“it is the general rule of the moral universe that those men prosper who do their work with all their hearts, while those are almost certain to fail who go to their labour leaving half their hearts behind them.” ― Charles Haddon Spurgeon, Morning and Evening, Based on the English Standard Version"},{"quote":"“Just because you can't act EVERYWHERE doesn't mean you don't act ANYWHERE. – Madeleine Albright” ― Walter Isaacson, American Sketches: Great Leaders, Creative Thinkers, and Heroes of a Hurricane"},{"quote":"“What's the point of a good job if you're dead?” ― Andrew Garve, The Late Bill Smith"},{"quote":"“With or without money, the work must be done.” ― Lailah Gifty Akita"},{"quote":"“There is enough work for every soul, if we use our specific gifts to meet the specific needs of the society.” ― Lailah Gifty Akita"},{"quote":"“Looking to advance in journalism, one future editor displayed skilled as varied as economic analysis and humorous commentary.” ― Harold Holzer, Lincoln and the Power of the Press: The War for Public Opinion"},{"quote":"“Job tries to comfort himself with philosophical pessimism like the intellectuals of the nineteenth century. But God comforts Job with indecipherable mystery, and for the first time Job is comforted. . . . Job flings at God one riddle, God flings back at Job a hundred riddles, and Job is at peace. He is comforted with conundrums.” ― Chesterton, G. K."},{"quote":"“No matter what office LBJ assumed he lifted greater than when he found it.” ― David Pietrusza, 1960--LBJ vs. JFK vs. Nixon: The Epic Campaign That Forged Three Presidencies"},{"quote":"“Job change is a very crucial decision. This decision can make or break your career.” ― Abhishek Ratna, No Parking. No Halt. Success Non Stop!"},{"quote":"“Ever day you spend at work is a foundation for your future.” ― Abhishek Ratna, No Parking. No Halt. Success Non Stop!"},{"quote":"“Usimwabudu mungu mwingine isipokuwa Mungu. Usimwabudu mtu, mnyama, sanamu, samaki, au usiziabudu fikira zako kichwani. Usiitumikie kazi, mali, mila, anasa, siasa, wala usiyatumikie mamlaka au usiutumikie umaarufu au ufahari, kuliko Mungu. Ukiithamini kazi, mali, mila, anasa, siasa au ukiyathamini mamlaka, au ukiuthamini umaarufu au ufahari zaidi kuliko Mungu, au ukiyapa majukumu yako muda mwingi zaidi kuliko Mungu umeabudu miungu; wakati ulipaswa kumwabudu Mungu peke yake. Usiwe na vipaumbele vingine vyovyote vile katika maisha yako zaidi ya Mungu, kwani Mungu ni Mungu mwenye wivu.” ― Enock Maregesi"},{"quote":"“Работать - это значит: пот заливает глаза, шею, деревенеет спина, руки ломит от натуги, а ты не обращай ни на что внимания, подцепляй сноп за снопом, бросай на мостик. Затем Корч и позвал ее, а Корч не любит, чтобы работали кое-как, лишь бы отбыть черед. Работать - это значит работать, мучиться. этой муке только и живет одно терпеливое, тупое, сладкое, как мечта, желание: когда-то это должно кончиться - этот лязг, этот гул, эта спешка, и можно будет распрямиться, и постоять, и отдаться радости отдыха. Когда это будет неизвестно, знает только - не скоро, не скоро...” ― Мележ, Іван"},{"quote":"“Only God can make the common sacred.” ― Beth Moore, To Live Is Christ: Joining Paul's Journey of Faith"},{"quote":"“No one creates a perfect resume on their first try.” ― Matthew T. Cross, The Resume Design Book: How to Write a Resume in College & Influence Employers to Hire You [Color Edition]"},{"quote":"“Your education is important because with only a few words you can show an employer the depth of your potential.” ― Matthew T. Cross, The Resume Design Book: How to Write a Resume in College & Influence Employers to Hire You"},{"quote":"“A family man shouldn't trade his peace for profits, it is the job of a businessman.” ― Amit Kalantri"},{"quote":"“Just continue to \"walk in the light\" you have been given, and leave the future in God's hands. If He is calling you to do a job, He will make it possible for you to care for your family and overcome any other barriers to that responsibility.” ― James Dobson"},{"quote":"“Robert Kennedy was inspired to take on organized crime by watching the landmark movie On the Waterfront.” ― David Talbot, Brothers: The Hidden History of the Kennedy Years"},{"quote":"“99 % of the reason a person doesn't do something are 100% correct” ― Stanley Victor Paskavich, Stantasyland: Quips Quotes and Quandaries"},{"quote":"“Use your passion to create a job.” ― Lailah Gifty Akita"},{"quote":"“Many people want money but do not love to work.” ― Lailah Gifty Akita"},{"quote":"“You can create your ideal job.” ― Lailah Gifty Akita"},{"quote":"“How can I give up stalking when I have a family to feed? Get a job? I don't want to work for you, your work makes me puke, do you understand? This is the way I figure it: if a man works with you, he is always working for one of you, he is a slave and nothing else. And I always wanted to be myself, on my own, so that I could spit at you all, at your boredom and despair.” ― Arkady Strugatsky, Roadside Picnic"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“Work was intended not to give a man a reason to live, but rather to give him a means to live.” ― Criss Jami, Healology"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Find what you're good at. whatever it is, and become excellent at it. Excellence isn't magic - it's habit, the by product of doing something over and over and striving to be the best at it. Simply figure out what your passion is, and resolve to make excellence your habit.” ― Lauren Rowe, The Club"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“Pekerjaanmu kelak hanya penyambung nafkah, sebesar apapun kamu mencintainya, jangan takut untuk meninggalkan semua itu bila saatnya datang. Jangan ragu. Dirimu lebih besar dari yang kamu tahu” ― Dewi 'Dee' Lestari, Supernova: Petir"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“Not every single broke and unemployed person needs a job; some need customers.” ― Mokokoma Mokhonoana"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"},{"quote":"“A healthy person that uses medical oxygen to perform their job on a daily basis should expect to eventually become a sick person.” ― Steven Magee, Health Forensics"},{"quote":"“It was as if my sould had left my body, floated up to the ceiling, and was watching me destroy my own career with one deliberately assaultive punch. (Dark City Lights)” ― Peter Hochstein"},{"quote":"“The dreams we had of finding meaning and fulfillment through our jobs have faded into the reality of professional politics, burnout, boredom and intense competition.” ― Vicki Robin"},{"quote":"“As is the case with many adolescents, Lewis's increased command over over the things of the world brought with it a corresponding atrophy of the moral sense.” ― Philip Zaleski, The Fellowship: The Literary Lives of the Inklings: J.R.R. Tolkien, C.S. Lewis, Owen Barfield, Charles Williams"},{"quote":"“He cross-examined his very wine when he had nothing else at hand.” ― Charles Dickens, Great Expectations"},{"quote":"“He must become an apprentice to ordinary life.” ― Paul C. Nagel, John Quincy Adams: A Public Life, a Private Life"},{"quote":"“If you are not happy with the work you do, change it” ― Anamika Mishra"},{"quote":"“Always take the job, pursue the life, and have the friends that allow you to have as much freedom as possible.” ― James Altucher, The Rich Employee"},{"quote":"“The summit of Mauna Kea was definitely a place where it was better to be a hard to replace skilled engineer than an easy to replace technician. It was my experience that once you had developed Mauna Kea Sickness that the management team would blatantly harass you out of your job using nasty inhumane human resources techniques.” ― Steven Magee, Health Forensics"},{"quote":"“And I will wait for Jarod to work for me. For free, cause if it's paid, it's work and not love, unless, of course he loves to work, in which case he’ll surely love working for me, because I love people who love to do that to love to do that.” ― Will Advise, Nothing is here..."},{"quote":"“There is grace for survival; I survived two years without a regular salary.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“A man's action always takes it's result along.” ― Bijendra Kumar"},{"quote":"“Old fighters keep making comebacks. We are more alive when boxing than at almost any other time.” ― Davis Miller, Approaching Ali: A Reclamation in Three Acts"},{"quote":"“Leadership is built on inspirations. Inspiration does both the theoretical and the practical job. By inspiration, people are not only informed to know what is right. But they are also convinced to always do what’s right.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“If you can’t find a job, use your special gift to create a job.” ― Lailah Gifty Akita"},{"quote":"“Do what you are doing. Monastic motto” ― Rick Perlstein, The Invisible Bridge: The Fall of Nixon and the Rise of Reagan"},{"quote":"“When someone speaks against a person its gossip; until the person isn't heard it's still a hearsay.” ― Joey Lawsin"},{"quote":"“It's hypocritical to expect a job based on a curriculum built out of companies that for whatever reason rejected you.” ― Daniel Marques"},{"quote":"“It is a healthy approach not to expect persons to turn out precisely how you would have wished.” ― Criss Jami, Healology"},{"quote":"“Even the richest of brands are robbed by poor character.” ― Criss Jami, Healology"},{"quote":"“A leader does not reduce his speeds to meet the views of negative thinkers. He leaves them to do their job as he focuses.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“In many cases, it was the woman’s stomach—not her heart—that fell for her man.” ― Mokokoma Mokhonoana, The Selfish Genie: A Satirical Essay on Altruism"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“Do not waste your time and life, searching for a job.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“The job of reflection is to add a dimension of fable to the reality!” ― Mehmet Murat ildan"},{"quote":"“Toughened or coarsened by their worldly lives, the other dissenters could shrug and move on, but Souter couldn't. His whole life was being a judge.” ― Jeffrey Toobin, The Nine: Inside the Secret World of the Supreme Court"},{"quote":"“In some cases, it is the woman’s stomach—not her heart—that has left her man for another.” ― Mokokoma Mokhonoana, The Selfish Genie: A Satirical Essay on Altruism"},{"quote":"“Lincoln bore down or anything he handled, mastering both the details and the principles.” ― Richard Brookhiser, Founders' Son: A Life of Abraham Lincoln"},{"quote":"“Success requires discipline, dedication and diligence to the very end.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“One good deed is more worth than a thousand brilliant theories. Let us not wait for large opportunities, or for a different kind of work, but do just the things we \"find to do\" day by day.” ― Charles Haddon Spurgeon, Morning and Evening, Based on the English Standard Version"},{"quote":"“Never depend on a single income. Make Investments to create a second source.” - Warren Buffet” ― Archie Lee"},{"quote":"“On God's calendar, there are no ordinary days.” ― David McGee"},{"quote":"“Do not waste your time and life, searching for a job. Utilize your special skills to begin your own work.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Many of us wake up at the age of 40 one day, dreading going to work because we were forced to pick a career before we could legally buy a beer.” ― Dave Shepp"},{"quote":"“The effects of overworking; you forget which day it is and unable to think straight.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You have the capacity to do the work.Find the willpower to begin work.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“To cleave wood is a common every-day business, and yet it has its dangers; so then, reader, there are dangers connected with your calling and daily life which it will be well for you to be aware of. Your occupation may be as humble as log splitting, and yet the devil can tempt you in it. Nowhere is he safe who thinks himself so.” ― Charles Haddon Spurgeon, Morning and Evening, Based on the English Standard Version"},{"quote":"“I will wholeheartedly perform my holy duties.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“How much does a man's effort depend upon the age in which his work is cast? Pope Clement VII” ― Barbara W. Tuchman, The March of Folly: From Troy to Vietnam"},{"quote":"“If you want to go to places worth going, you have to be open to personal growth. No matter how much your job pays you, if it doesn’t offer you the opportunity to grow, your efforts would only go to waste. There are really just some things that money can’t buy. Never stop learning!” ― Kevin J. Donaldson"},{"quote":"“I believe the road to preeminent success in any line is to make yourself master IN THAT LINE. I have no faith in the policy of scattering one's resources. Andrew Carnegie” ― H.W. Brands, American Colossus: The Triumph of Capitalism, 1865-1900"},{"quote":"“Western farmers were individualists cheifly in their dreams.” ― H.W. Brands, American Colossus: The Triumph of Capitalism, 1865-1900"},{"quote":"“A live-in domestic worker: \"You are never sure that your soul is your own except when you are out of the house.” ― H.W. Brands, American Colossus: The Triumph of Capitalism, 1865-1900"},{"quote":"“A young mark twain on the make: \"I can't turn in inkstand into Aladdin's lamp.” ― H.W. Brands, American Colossus: The Triumph of Capitalism, 1865-1900"},{"quote":"“The horizons of man are incomparably narrower than that of the land on which he toils. Editor of the Nebraska journal” ― H.W. Brands, American Colossus: The Triumph of Capitalism, 1865-1900"},{"quote":"“Public servants in this Europe often do their best when they stop caring about whether they'll be fired.” ― Ron Suskind, The Way of the World: A Story of Truth and Hope in an Age of Extremism"},{"quote":"“He wasn't an especially charismatic or commanding individual, but what he lacked in personality he emphatically made up for in diligence.” ― Dan Jones, The Wars of the Roses: The Fall of the Plantagenets and the Rise of the Tudors"},{"quote":"“I loved to read when I was a kid, and as soon as I realized that an actual person got to make up the books I loved so much, I decided that that was the job for me.” ― Margaret Peterson Haddix"},{"quote":"“To kill for fun is the job of the psychopaths! And what is a matador, apart from being a mentally ill person?” ― Mehmet Murat ildan"},{"quote":"“Sam Rayburn on LBJ's recuperation from his heart attack: \"It would kill him if he relaxed.” ― Robert A. Caro, Master of the Senate"},{"quote":"“We are capable of performing the task.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“There are plenty of chances in life, what's important is what you make of them.” ― Katja Michael"},{"quote":"“Obviously, a lot of people involved with Volkswagen's emissions were aware of the diesel car software cheat. One has to wonder how many of them tried to stop it and perhaps were demoted or lost their jobs over trying to prevent the secret Volkswagen car emissions fraud?” ― Steven Magee"},{"quote":"“He who loves his job, will own it.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“As a manager, I was able to put the USA workplace mental health system to the test. In each of three separate companies there was an employee that was displaying mental health issues and I reported this to the human resources department. The outcome: I was terminated every time. The conclusion: Reporting mental health issues in USA employees will lose you your job!” ― Steven Magee"},{"quote":"“Leadership’s primary job is to enhance creative capacity by developing collectively effective leadership.” ― William A. Adams, Mastering Leadership: An Integrated Framework for Breakthrough Performance and Extraordinary Business Results"},{"quote":"“When he studied, it was not so much for a promotion as to EXCEL at his job.” ― David Halberstam, Firehouse"},{"quote":"“You need to work even if it is a menial or dirty job, because every job is participating in the process of creation.” ― Sunday Adelaja"},{"quote":"“One of the greatest secrets of great leaders; 'they are not controlled by what they cannot do'. They directed by what they can.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Do not waste your life, in search for a job.Use your special gifts to create work for yourself.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Maskini hutengeneza pesa kwa kufanya kazi asizozipenda. Tajiri hutengeneza pesa kwa kufanya kazi anazozipenda.” ― Enock Maregesi"},{"quote":"“Maskini hufanya kazi kwa bidii kupata pesa. Tajiri hutumia pesa kupata pesa.” ― Enock Maregesi"},{"quote":"“What a great pleasure to work for your living?” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Always work enthusiastically.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Parenthood is harder than conventional work, the author suggests, because our jobs develop a somewhat predictable flow and offer relatively short-term feedback. This leads to internal comparisons to the improvisational nature of parenting” ― Jennifer Senior, All Joy and No Fun: The Paradox of Modern Parenthood"},{"quote":"“The best thing that ever happened to you might be your new job, spouse, awards, etc, but I tell you that being granted to live in order to enjoy these things are wonderful privileges most people can't get.” ― Michael Bassey Johnson"},{"quote":"“Our fathers of faith have done a great job delivering our nations from the clutches of idolatry and witchcraft through signs and wonders” ― Sunday Adelaja"},{"quote":"“The way the early Protestants taught on the other hand is that everybody is a full time minister in their various places of work. They went to the extent of saying, your job, profession, occupation is your calling” ― Sunday Adelaja"},{"quote":"“Unfortunately, the board of directors that the middle managers report to generally make them aggressive. Imagine being hired into a company and then being told that you have to ignore the emerging health and safety issues (This is illegal!) and not inform the workers that the system is known to be dangerous (This is illegal!). You have two options: To go to jail for illegal activities sometime in the future, or to lose your job now and have all your USA workplace rights removed for recognizing the illegal activities that your Directors want you to engage in. Welcome to the corporate America management team!” ― Steven Magee"},{"quote":"“You talk to leadership in China, and THEY are all the engineers. They get what is going on immediately. The Americans don't because they're all lawyers.” ― John Doerr"},{"quote":"“You must fall in love with your job, over and over again, to own it.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Everybody must get a job.” ― Sunday Adelaja"},{"quote":"“On the street below, the weather is calm. But up here, high winds threaten to topple the workers. A sudden gust can knock them from their footing with its sheer force or send a fatal vibration through the beams on which they stand. And yet the men joke, laugh, stroll across the foot-wide beams as though they are on solid ground. To the people on the sidewalk, tiny as ants below, the skywalkers appear entirely unafraid. A hundred years ago, their grandfathers and great-grandfathers built the skyscrapers and bridges that surround them.” ― David Weitzman"},{"quote":"“Doing what you love is a sacred life.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“I know the value of my time!” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Use your special gifts to create work for yourself.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“So many amazing opportunities arise when a chapter of our life ends. When we resign from a job that we weren't happy in, or even get fired, it's actually a blessing because a better experience is waiting to happen. It's all about perspective.” ― Miya Yamanouchi, Embrace Your Sexual Self: A Practical Guide for Women"},{"quote":"“No doctor knows everything. There's a reason why it's called \"practising\" medicine.” ― Anonymous"},{"quote":"“Hate lawyers all you want. Unlike you, we'll never be replaced with robots. Case closed!” ― Natalya Vorobyova"},{"quote":"“Well, let's argue this out, Mr Blank. You, who represent Society, have the right to pay me four hundred francs a month. That's my market value, for I am an inefficient member of Society, slow in the uptake, uncertain, slightly damaged in the fray, there's no denying it. So you have the right to pay me four hundred francs a month, to lodge me in a small, dark room, to clothe me shabbily, to harass me with worry and monotony and unsatisfied longings till you get me to the point when I blush at a look, cry at a word. We can't all be happy, we can't all be rich, we can't all be lucky - and it would be so much less fun if we were. Isn't it so, Mr Blank? There must be the dark background to show up the bright colours. Some must cry so that the others may be able to laugh the more heartily.” ― Jean Rhys, Good Morning, Midnight"},{"quote":"“There is no need for comparison. Be happy with yourself and find satisfaction in your work.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“The extraneous duties, in a sense, were the job.” ― Tom Clancy, Executive Orders"},{"quote":"“In the meantime, I’ll get a job. I’ll pay my own way.” “A job?” “Mmm, yeah. It’s that thing people do to make money.” ― Kelley Armstrong, Omens"},{"quote":"“So where does that leave me? I like hosting the show....It’s become my identity. If that’s gone, where am I?” ― Barbara Delinsky, Blueprints"},{"quote":"“Job understood that he was nothing more than God’s invention and so too was his suffering” ― Johnny Rich, The Human Script"},{"quote":"“There is greatness in everyone already. The job of the leader is not to put greatness in anyone. The job of the leader is to make people discover and exploit the greatness already existing in them!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“Loving your work doesn’t mean finding a job you can tolerate for eight hours a day, but rather a job that gets you flying out of bed in the morning like a Jack Russell who just had a firecracker stuffed up his ass.” ― Ari Gold, The Gold Standard: Rules to Rule By"},{"quote":"“I became an actor because it was my clumsy attempt to become myself.” ― Martin Sheen, Along the Way: The Journey of a Father and Son"},{"quote":"“You wander. You work nearly every job known to man, it seems, only to arrive at the wonderings of philosophy.” ― Criss Jami, Healology"},{"quote":"“You will find a job, if you are willing to work.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Don't let money change your direction; that's the job of the giver of the money.” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“All professions have some element of theater to them.” ― David Halberstam, The Powers That Be"},{"quote":"“Sometimes it is better to say ‘no’ and lose your job than it is to say ‘yes’ and lose your soul.” ― Todd Stocker"},{"quote":"“I had had the job for three weeks. It was dreary. You couldn't read; they didn't like it. I would feel as if I were drugged, sitting there, watching those damned dolls, thinking what a success they would have made of their lives if they had been women. Satin skin, silk hair, velvet eyes, sawdust heart - all complete.” ― Jean Rhys, Good Morning, Midnight"},{"quote":"“Boss may be on, but leader can be anyone.” ― Ameya Agrawal"},{"quote":"“Why do lazy, minimum effort employees always seem to find places where they feel \"underappreciated\"?” ― Matt Chandler, Recovering Redemption: A Gospel Saturated Perspective on How to Change"},{"quote":"“You couldn't allow yourself to get bored. THAT would be a fight.” ― Tom Clancy, Executive Orders"},{"quote":"“Think little of yourselves, but do not think too little of your calling.” ― Charles H. Spurgeon"},{"quote":"“Most of us, at some time or other, get sucked into the lifeless vacuum of work; the cogs of the corporate machine that we keep turning until one day, when we depart this Earth, we may earn the word ‘lubricant’ on our headstone.” ― Fennel Hudson, Wild Carp: Fennel's Journal No. 4"},{"quote":"“Hughes might discuss Calvinism ably, but he did not live it, he was—by Time corporate standards—just a little lazy.” ― David Halberstam, The Powers That Be"},{"quote":"“I have what takes to get the job done.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“No matter how unattractive your job is, once you are earning with honesty and dignity you need not care what people think of you in your work uniform.” ― moolesh.k.dindoyal"},{"quote":"“The job description, like most, used complicated words that made job-hopefuls hesitant to apply because it may be out of their range of capability.” ― S.A. Tawks, The Spirit of Imagination"},{"quote":"“She didn't want to alienate herself from the very wealthy man that was about to offer her a job by declining the polite offer of a drink.” ― S.A. Tawks, The Spirit of Imagination"},{"quote":"“Doing nothing was as honourable as any available course of action. Think of Hamlet, think of Job, think of Jesus before Pilate.” ― Johnny Rich, The Human Script"},{"quote":"“Maskini ana mawazo ya kupata pesa bila kufanya kazi. Tajiri ana mawazo ya kupata pesa kwa kufanya kazi.” ― Enock Maregesi"},{"quote":"“A true Christian lives and labors on earth not for himself but for his neighbor. Therefore the whole spirit of his life him impels him to do even that which he needs not do, but which is profitable and necessary for his neighbor.” ― Martin Luther"},{"quote":"“I always like to be in the presence of people who are good at and love their jobs, Irrespective of their jobs.” ― Geoff Dyer, Another Great Day at Sea: Life Aboard the USS George H. W. Bush"},{"quote":"“Irritability was an occupational disease. Intolerant and intolerable belong in the same category.” ― Barbara W. Tuchman, The First Salute : View of the American Revolution"},{"quote":"“Cause every task of your day to be a sacred ministry to the Lord. however mundane your duties, for you they are a sacrament.” ― Richard J. Foster, Celebration of Discipline: The Path to Spiritual Growth"},{"quote":"“In books, coaching sessions, and networking events aimed at the white-collar unemployed, the seeker soon encounters ideologies that are explicitly hostile to any larger, social understanding of his or her situation. The most blatant of these, in my experience, was the EST-like, victim-blaming ideology represented by Patrick Knowles and the books he recommended to his boot-camp participants. Recall that at the boot camp, the timid suggestion that there might be an outer world defined by the market or ruled by CEOs was immediately rebuked; there was only us, the job seekers. It was we who had to change. In a milder form, the constant injunction to maintain a winning attitude carries the same message: look inward, not outward; the world is entirely what you will it to be.” ― Barbara Ehrenreich"},{"quote":"“I was a really good waitress. Waitressing takes a certain gusto. You need a good memory and an ability to connect with people fast. You have to learn how to treat the kitchen as well as you treat the customers. You have to figure out which crazy people to listen to and which crazy people to ignore. I loved waiting tables because when you cashed out at the end of the night your job was truly over. You wiped down your section and paid out your busboy and you knew your work was done.” ― Amy Poehler"},{"quote":"“There is an easy way of finding the job to be done today, just look around your environment; take note of the places that need cleaning and the places that need decoration; do one at a time!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“—Now my father had a way, a little like that of Job's (in case there ever was such a man—if not, there's an end of the matter.—Though, by the bye, because your learned men find some difficulty in fixing the precise æra in which so great a man lived;—whether, for instance, before or after the patriarchs, &c.—to vote, therefore, that he never lived at all, is a little cruel,—'tis not doing as they would be done by—happen that as it —My father, I say, had a way, when things went extremely wrong with him, especially upon the first sally of his impatience—of wondering why he was begot,—wishing himself dead;—sometimes worse:—” ― Laurence Sterne, The Life and Opinions of Tristram Shandy, Gentleman"},{"quote":"“The devil may not be interested in preventing you from knowing the undone job. What he may do is to make you think it’s somebody’s job and not yours.” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“The sweeper of the street is a leader in his own respect provided he does his job well with all love, diligence and attention than anyone would do when given the same broom sticks.” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“Being in touch with your strengths and weaknesses, as well as what motivates you, will help you be more successful in your job.” ― Joanie Connell, Flying Without a Helicopter: How to Prepare Young People for Work and Life"},{"quote":"“Well done, is well said.” ― Anthony Liccione"},{"quote":"“Ujasusi ni kitu cha muhimu kwa maendeleo ya nchi yoyote. Watu wanaoshughulika na ujasusi wanapaswa kuwa makini mno kwani kazi yao ni nyeti sana kulinganisha na kazi za watu wengine. Kosa dogo la kiusalama linaweza kubadili mwelekeo wa historia ya nchi.” ― Enock Maregesi"},{"quote":"“Get me your manager.” Dove held her head high and tried to seem older and more self-assured. The teenager barely registered her request. “Do it now. My friend here is about to crap his pants. Do you want to smell it?” Dove slapped her hands down on the counter, snapping the life into the girl. “Do you want to smell his shit?” ― Debra Anastasia, Fire in the Hole"},{"quote":"“It might come a time to not follow your passion, so to speak, although it must be prioritized. It may be the case that your passion will serve as the medic, your peace of mind, alongside a higher calling, with your higher calling being the point man.” ― Criss Jami, Healology"},{"quote":"“We feel unfulfilled when there is a gap between what is most important to us, the realm of personal leadership, and what we are actually doing with our time, the realm of personal management. You are satisfied with your day when there is a match between what you value and how you spend your time.” ― Matt Perman, What's Best Next: How the Gospel Transforms the Way You Get Things Done"},{"quote":"“The curse of the fall didn't affect only manual work, as we often seem to think. Excessive ambiguity that prevent us from figuring out how to navigate is really a form of confusion. Overload is one of the forms that frustration takes. The inordinate challenges we face in knowledge work can be traced to the fall just as much as the challenges in manual work. Send it especially lies behind the villain of lack of fulfillment. The reason we lack fulfillment is because we aren't fulfilling our true purpose, that is because we have sinned and deviated from God's path.” ― Matt Perman, What's Best Next: How the Gospel Transforms the Way You Get Things Done"},{"quote":"“If you launch a career doing something you don't really like, that even if you're successful, you won't feel successful, and you'll be contemptuous of your own success.” ― Douglas Copeland"},{"quote":"“Nanak dukhiya sab sansaar!This whole world is ridden with Sorrow.Stop comparing as we all have a fucked up life, family and job! No matter what others show and potray! ;)\"Jhaak ke dekhoge (I mean kareeb se) toh pata chalega ki saamne waale ke toh zyaada phate hai\" hahahahahaha” ― honeya"},{"quote":"“Those were times when brave men who knew and loved their profession couldn't be overlooked.” ― Thomas Hughes, Tom Brown at Oxford"},{"quote":"“WWPP ('WODEA Witness Protection Programme') ni Programu Maalumu ya Ushahidi ya Tume ya Dunia ya kuwakinga mashahidi wa kihalifu kwa kuwapa makazi mapya, majina mapya, kazi mpya, historia mpya ya maisha, na sura mpya, kuwakinga na Sheria ya Kitalifa ya Kolonia Santita. Ukivunja Sheria ya Kitalifa ya Kiapo cha Swastika cha Kolonia Santita utauwawa, tena utauwawa kinyama, wewe na familia yako.” ― Enock Maregesi"},{"quote":"“The only job a parent has is work themselves out of a job.” ― Holly Gates"},{"quote":"“My first job as assistant director was to make sure he didn't cast the talented blond dancer who had so easily stolen my boyfriend the summer before. I accomplished this with the persistent and skilled manipulation of a grade A bitch.” ― Tina Fey, Bossypants"},{"quote":"“I thought buying at the local market would be an excellent way to build positive relationships with the local villagers.” ― Eric Greitens, The Heart and the Fist: The Education of a Humanitarian, the Making of a Navy SEAL"},{"quote":"“Your job as a young adult is to become as valuable to the marketplace as you can. Your job as a human is to do so without working a day in your life.” ― Chris Matakas"},{"quote":"“The rhythms of the game complemented the lifestyle he preferred.” ― Nicholas Dawidoff, The Catcher Was a Spy: The Mysterious Life of Moe Berg"},{"quote":"“If you don’t own the company, it’s their job, not yours. They lease it to you for a while for the value you create beyond what you cost. At the end of the lease, if you paid off the tab and have more valuable knowledge and skills than you had when you signed on, it’s a good deal for everyone. If you take their money but don’t get better at what you do, you got burned.” ― Ken Goldstein, Endless Encores"},{"quote":"“När höjdarna ger dig en lort, putsar du upp den och säger \"Men Gud, så fin!\" Det för att de blir imponerade av ens intellekt, perceptionsförmåga och kapacitet. Om du inte gör det står du bara där med en lort i handen.” ― Stuart MacBride"},{"quote":"“Our task is to carry the Lord's peace into every situation, into every duty.” ― Davis Bunn, Janette Oke"},{"quote":"“Verstehst du, im Grunde sind doch die Mitarbeiter das Problem. Du zahlst, wenn du sie einstellst, du zahlst, wenn du sie rausschmeißt, und dazwischen muss du sie auch noch bezahlen.” ― Max Barry, Company"},{"quote":"“There seems a general rule that, the more obviously one’s work benefits other people, the less one is likely to be paid for it.” ― David Graeber"},{"quote":"“It’s hard to do a really good job on anything you don’t think about in the shower.” ― Paul Graham"},{"quote":"“, “As for a limit to one’s labors, I, for one, do not recognize any for a high-minded man, except that the labors themselves should lead to noble accomplishments.” ― Alexander the Great"},{"quote":"“Providing employment is the best form of social service, as it serves you, others, your country, your world - the entire society.” ― Amit Kalantri"},{"quote":"“No job is complete until the selfie is posted.” ― Ashok Kallarakkal"},{"quote":"“Thanks to his salary, an employee is free to eat whatever, wherever. However, because of his job, he is not free to eat whenever.” ― Mokokoma Mokhonoana, N for Nigger: Aphorisms for Grown Children and Childish Grown-ups"},{"quote":"“The vacancy in your heart doesn't connotes that nobody is seeking for the job of servicing your feelings, but because the employee must first have all the necessary credentials needed for the job.” ― Michael Bassey Johnson"},{"quote":"“Every technology will alienate you from some part of your life. That is its job. Your job is to notice. First notice the difference. And then, every time, choose.” ― Michael Harris"},{"quote":"“Ingredients to success: know what you do well, know what to do well, and know someone who's swell.” ― Criss Jami, Killosophy"},{"quote":"“Masters and highly successful people are in a romantic relationships with their work” ― Desmond Oshifeso"},{"quote":"“In a sense, discouragement does not have to exist. Allow it to be rather the encouragement to honestly reconsider all the options, then, as necessary, shine on.” ― Criss Jami, Killosophy"},{"quote":"“For mankind knows hardly a joy which will surpass that of approval of his work.” ― Ernest Vincent Wright, Gadsby"},{"quote":"“I think that most artists scorned would prefer to be known as the one with the genius brain risking no career over the one with the good brain and great career.” ― Criss Jami, Killosophy"},{"quote":"“Work is a vehicle with which man chases some fleeting destination called a full tummy.” ― Mokokoma Mokhonoana, N for Nigger: Aphorisms for Grown Children and Childish Grown-ups"},{"quote":"“Employment was invented to make education seem useful.” ― Mokokoma Mokhonoana, N for Nigger: Aphorisms for Grown Children and Childish Grown-ups"},{"quote":"“Professional’ does not necessarily mean that the person so labelled is good or knows what they are doing. In many a case, it merely means that they do whatever that they are a professional at for a living, not as a hobby.” ― Mokokoma Mokhonoana, N for Nigger: Aphorisms for Grown Children and Childish Grown-ups"},{"quote":"“Retirement is the menopause of an employee’s mind and hands.” ― Mokokoma Mokhonoana, N for Nigger: Aphorisms for Grown Children and Childish Grown-ups"},{"quote":"“Amid the joy of raising children will be some of the hardest work you’ll ever do.” ― Elizabeth George, One-Minute Inspirations for Women"},{"quote":"“There is no future in any job. The future lies in the person who holds the job.” ― George Crane"},{"quote":"“failure is costly, both to society and to individuals. Pretending that all people are equal in their abilities will not change the fact that a person with an average IQ is unlikely to become a theoretical physicist, or the fact that a person with a low level of music ability is unlikely to become a concert pianist. It makes more sense to pay attention to people’s abilities and their likelihood of achieving certain goals, so people can make good decisions about the goals they want to spend their time, money, and energy pursuing” ― David Hambrick"},{"quote":"“Being proud of my work and wanting to nurture this relationship, I never failed in my commitments to her. In general, I make a point of meeting all my deadlines. But, I distinctly remember one time that I couldn’t deliver the job in time…” ― Ajit Kumar Jha, Seeking Human Kindness"},{"quote":"“Do not complain about two things; your job and your position, because you can always change them.” ― M.F. Moonzajer, LOVE, HATRED AND MADNESS"},{"quote":"“Do it better than its ever been done!” ― Sherman Morris"},{"quote":"“There are two types of people in life when it comes to their careers: people who visualize, and people who imitate. The people who visualize paint their own vision of what their mark is in the world, while the people who imitate can only see what the visualizers want them to.” ― Ingrid Nkenlifack"},{"quote":"“There is no job more important than parenting. This I believe.” ― Benjamin Carson"},{"quote":"“The author describes Speaker of the House Sam Rayburn as \"seldom at ease without a gavel in his hand.” ― Robert A. Caro, The Path to Power"},{"quote":"“...teko girdėti: ,,Aš be darbo negaliu nė 15 minučių ištverti.\" Žmogus, kuris taip sako, iš tikrųjų gyvenimo negali 15 minučių ištverti. Gyvenimo baimė verčia dirbti. Bėga į darbą, kad gyventi nereikėtų. Kad mąstyti nereikėtų. Kad nebūtų. (...) Kai žmogus dirba, kad nenumirtų, tai viena. Kai žmogus dirba, kad negyventų - visai kas kita.” ― Mikalojus Vilutis, Sriuba"},{"quote":"“A friend’s 14-year-old niece was asked by her teacher what she wanted to be when she finished school. The teacher asked her to think hard about it and then get back to him with an answer. She didn’t know what to say to her teacher. A friend, on hearing the girl’s predicament, said: ‘Tell your teacher that, perhaps, the thing you want to be when you leave school hasn’t been invented yet.” ― Ian Sanders, Mash-up!: How to Use Your Multiple Skills to Give You an Edge, Make Money and Be Happier"},{"quote":"“Joy in your Job is possible to the extent you're willing to choose it.” ― Todd Stocker, Becoming The Fulfilled Leader"},{"quote":"“[A]though people get paid to do their jobs, you cannot pay someone to do their job passionately and wholeheartedly. Those qualities are not for sale; they are themselves gifts that can only be given freely, and are in many, many fields.” ― Rebecca Solnit"},{"quote":"“Why the delay? Why does God let evil and pain so flagrantly exist, even thrive, on this planet?...He holds back for our sakes. Re-creation involves us; we are, in fact, at the center of his plan...the motive behind all human history, is to develop us, not God. Our very existence announces to the powers in the universe that restoration is under way. Every act of faith by every one of the people of God is like the tolling of a bell, and a faith like Job's reverberates throughout the universe.” ― Philip Yancey, Disappointment with God"},{"quote":"“It's not just a question of doing what you love for a living. It's about doing what you love with love. Then your life and all be transformed.” ― Rasheed Ogunlaru"},{"quote":"“My men are my money.” ― Amit Kalantri, Wealth of Words"},{"quote":"“—Lo difícil no es ganar dinero sin más —se lamentaba—. Lo difícil es ganarlo haciendo algo a lo que valga la pena dedicarle la vida.” ― Carlos Ruiz Zafón, The Shadow of the Wind"},{"quote":"“Speaking of Newton but also commenting more broadly on education and the Enlightenment: \"I have seen a professor of mathematics only because he was great in his vocation, buried like a king who had done well by his subjects.” ― Voltaire"},{"quote":"“I thought that teaching twenty-eight energetic and needy children how to read had to be the hardest job on earth. I was wrong - mothering was. Now I had to give up my right to sleep when I needed it, to a meal without interruptions, to relaxation when I wanted it, and most importantly, my right to withdraw when I felt overwhelmed.” ― Jani Ortlund, Fearlessly Feminine: Boldly Living God's Plan for Womanhood"},{"quote":"“When my father was 17, he went to Montreal and found these submarine sandwich shops that were really successful, and weren't in Toronto [his home town]. So he went to my grandparents and said: \"Look, you have to give me the seed money to open up one of these places. We'll make a fortune. They've got lines going round the block. There's nothing like that here.\" And my grandfather's response was: \"Look, I'm sure these sandwiches are really good, and if we scraped the money together we could make a lot of money and your mother and I would be really proud of you, but you need to find something that has *magic* in it for you.\" It was off of that conversation that my father went to college on a music scholarship, started a film club and became one of the most successful directors of all time.” ― Jason Reitman"},{"quote":"“Practice hard,Train hard,work hard and Play harder.” ― Alcurtis Turner"},{"quote":"“Whenever there is a hard job to be done I assign it to a lazy man; he is sure to find an easy way of doing it.” ― Walter P. Chrysler"},{"quote":"“I think it is a duty I owe to my profession and to my sex to show that a woman has a right to the practice of her profession and cannot be condemned to abandon it merely because she marries. I cannot conceive how women's colleges, inviting and encouraging women to enter professions can be justly founded or maintained denying such a principle.[From a letter Brooks wrote to her dean, knowing that she would be told to resign if she married, she asked to keep her job. Nevertheless, she lost her teaching position at Barnard College in 1906. Dean Gill wrote that 'The dignity of women's place in the home demands that your marriage shall be a resignation.']” ― Harriet Brooks"},{"quote":"“We all have our unique careers that differ from one another, but the fact is that we must become \"teachers and learners\" at the end of it all! By the \"learning career\", we know what other people know; by the \"teaching career\", we make other people to know what we know!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Try to be the best; try never to be the worst! Live and play the role honey plays on your tongue in the lives of people; never do the job that pepper does on your eyes to others!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Talent without money, coach, vision and mission is a piteous adventure.” ― Michael Bassey Johnson"},{"quote":"“it was so hard to see what the future held because to perform at this game, you have to be “in the mud,” obsessed with the task at hand. Perspective is neutralized, stunted so that you can capture only the most relevant, time-sensitive data that will determine how to approach your opponent that day. Then you look up and realize your 20-year career has been a collection of days where you couldn’t see tomorrow.” ― Doug Glanville"},{"quote":"“Many men beg for a job but have no clue what hard work really means.” ― Bill Courtney, Against the Grain: A Coach's Wisdom on Character, Faith, Family, and Love"},{"quote":"“The essence of education is not to get a certificate or job but, to be a holistically developed person who can positively impact the society.” ― Ifeanyi Enoch Onuoha"},{"quote":"“You pay by the hour, even if the job only takes five minutes. I don’t do fractions.” ― John Connolly, The Wolf in Winter"},{"quote":"“To be a manager, one must be able to manage her own relationship with the people around her, as well as the relationships among her subordinates. Just being perfect in paperwork and operations does not make one a good manager.” ― Sophie L. Rose"},{"quote":"“Oczywiście trzeba zarabiać pieniądze. Ale żeby wychodzić z tego powodu z domu, to już jednak przesada.” ― Jaś Kapela, Janusz Hrystus"},{"quote":"“The bacteriologist, often risking his life to find cures for lethal afflictions, was another kind of imperial hero, as brave in his way as the soldier-explorer.” ― Niall Ferguson, Civilization: The West and the Rest"},{"quote":"“Reading is learning: Secure Future and earnings” ― Syed Sohail Ahmed"},{"quote":"“People enjoy doing what they do best.” ― Rafael k Nunes"},{"quote":"“The PC principle is to always treat your employees exactly as you want them to treat your best customers.” ― Stephen R. Covey, The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change"},{"quote":"“I needed to do my current job well, keep preparing, and wait on God’s timing. I needed to trust His leadership rather than try to force an outcome I wanted.” ― Tony Dungy"},{"quote":"“You better get used to touchy-feely around here, sweetie” ― Alex Rosa, Emotionally Compromised"},{"quote":"“Whether you are an astronomer or a life scientist, geophysicist, or a pilot, you've got to be there because you believe you are good in your field, and you can contribute, not because you are going to get a lot of fame or whatever when you get back.” ― Alan Shepard"},{"quote":"“លុយ ការងារ និងសេចក្តីសុខ ៖ មានមនុស្សជាច្រើនខំធ្វើការសន្សំលុយ ពេលបានលុយមកហើយទើបយកលុយទៅទិញសេចក្តីសុខ។ ពេលធ្វើការប្រៀបដូចនៅក្បែរភ្នក់ភ្លើង ខ្លះប្រើពេលរាប់អាទិត្យ រាប់ខែ រាប់ឆ្នាំ ទម្រាំបានលុយយកទៅទិញសេចក្តីសុខម្តងៗ។ ផ្ទុយពីមនុស្សមួយចំនួនទៀត គេធ្វើការដែលខ្លួនពេញចិត្ត ធ្វើការដែលខ្លួនស្រឡាញ់ ធ្វើតាមក្តីសុបិន គេមានសេចក្តីសុខនៅរៀងរាល់ម៉ោងធ្វើការ មិនព្រួយបារម្ភពីរឿងមានលុយឬអត់លុយដើម្បីយកទៅទិញក្តីសុខ។ ពិតមែនហើយលុយជួយសម្រួលអ្វីៗបានច្រើនយ៉ាង តែពុំមែនគ្រប់យ៉ាងនោះទេ ព្រោះមានអ្នកក្រជាច្រើនដែលដេកលក់ស្រួលនិងមានក្តីសុខជាងអ្នកមានមួយចំនួន ដែលគ្មានបញ្ញាក្នុងការរកសេចក្តីសុខឲ្យខ្លួនឯង?” ― Kim Channa"},{"quote":"“The end of the world came and my job did not change.” ― Daniel H. Wilson, Robogenesis"},{"quote":"“Isn't it interesting how much we dislike the days that allow us to enjoy our weekends? The days that pay. If you don't like Monday's, you're not living your authentic life! You’re in the wrong job! What do you really want to do with your life…?” ― James A. Murphy, The Waves of Life Quotes and Daily Meditations"},{"quote":"“Wenn man es geschafft hat, Respekt vor dem Job zu entwickeln, ist der Rücktritt nur die logische Konsequenz.” ― Philipp Lahm"},{"quote":"“If everyone had the luxury to pursue a life of exactly what they love, we would all be ranked as visionary and brilliant. … If you got to spend every day of your life doing what you love, you can’t help but be the best in the world at that. And you get to smile every day for doing so. And you’ll be working at it almost to the exclusion of personal hygiene, and your friends are knocking on your door, saying, “Don’t you need a vacation?!,” and you don’t even know what the word “vacation” means because what you’re doing is what you want to do and a vacation from that is anything but a vacation — that’s the state of mind of somebody who’s doing what others might call visionary and brilliant.” ― Neil deGrasse Tyson"},{"quote":"“All civilized wo/men are prostitutes: Some sell what's between their legs; the rest sell what's between their ears.” ― Mokokoma Mokhonoana"},{"quote":"“One way to be sure you are not making the wrong decision, is to lookvertically upwards” ― Oche Otorkpa, The Unseen Terrorist"},{"quote":"“If hard work is the source of happiness, then we can conclude that the main job of procrastination is to delay that happiness for excuses to kill.” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“To some women, a job plays the role of a man. To most women, a man plays the role of a job.” ― Mokokoma Mokhonoana"},{"quote":"“Mtu aliyepoteza kila kitu katika maisha yake ana uwezo wa kufanya chochote.” ― Enock Maregesi"},{"quote":"“Mtu aliyepoteza kazi na mke na watoto wake kuuwawa kwa mfano, watu wanapaswa kuwa makini na yeye, ana uwezo wa kufanya chochote.” ― Enock Maregesi"},{"quote":"“Degree lets you to the chair of interview, but it cannot provide you job” ― Pawan Mehra"},{"quote":"“Keep negative people long meters away from you; their presence is a threat to your high self-esteem! Job, the man of God kept his wife afar before he could make it again!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Writing is a profession that has no real career structure and your best advice when you hit a difficulty is probably going to come from another writer one or two rungs on the career ladder ahead of you.” ― Sara Sheridan"},{"quote":"“I realised early on that being an author is a hugely misunderstood job.” ― Sara Sheridan"},{"quote":"“Civilization is the commercialization of survival.” ― Mokokoma Mokhonoana"},{"quote":"“Job tip: If you were the employer, what kind of person would you most desire as an employee? Be that person.” ― Ziad K. Abdelnour, Economic Warfare: Secrets of Wealth Creation in the Age of Welfare Politics"},{"quote":"“There are no boring jobs, only boring men.” ― Amit Kalantri"},{"quote":"“បងប្អូនត្រូវចងចាំ តម្លៃរបស់មនុស្សម្នាក់ៗ មិនមែនជាតម្លៃដែលគេដាក់អោយនោះទេ តម្លៃរបស់មនុស្សម្នាក់ៗ ជាតម្លៃនៃការងាររបស់គេ ការងាររបស់គេ កំណត់តម្លៃរបស់គេ” ― Khem Veasna"},{"quote":"“Grabbing readers by the imagination is a writer's job.” ― Sara Sheridan"},{"quote":"“I'm a novelist by trade and my job is to write a story rather than reconstruct actual events.” ― Sara Sheridan"},{"quote":"“Being able to read well in public and talk about your work in an engaging fashion is part of most writers' job specification.” ― Sara Sheridan"},{"quote":"“Everyone assumes writers spend their time lounging around, writing and occasionally striking a pose whilst having a think.” ― Sara Sheridan"},{"quote":"“I want to do a good job living today.” ― Katerina Stoykova-Klemer"},{"quote":"“The financial value put on the job of the writer and the misconceptions around that make it extremely difficult to enter the profession.” ― Sara Sheridan"},{"quote":"“You need to know the constituency you belong to...and that is revealed by your constituents. When your constituents are speaking in public and making of stories, your constituency can be \"journalism\".” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“The garden is an unemployed township-based man's cubicle.” ― Mokokoma Mokhonoana"},{"quote":"“I'm a professional writer and I consider it part of my job to publicise my work and these days part of that job is done online.” ― Sara Sheridan"},{"quote":"“I spend a lot of time imagining things - in fact, you could say that imagining things is my job.” ― Sara Sheridan"},{"quote":"“I jealously guard my research time and I love fully immersing myself in those dusty old books and papers. It's one of the most enjoyable parts of my job.” ― Sara Sheridan"},{"quote":"“Being a writer is a more difficult job than people imagine.” ― Sara Sheridan"},{"quote":"“It's part of a writer's job to be nosy about everything.” ― Sara Sheridan"},{"quote":"“Jan, mon ami, si tu crois que pour faire ceque l'on aime il faut avoir du génie, la majorité des êtres qui peuplent la terre ferait rien. Aimer ce que l'on a décidé de faire suffit.” ― Gilbert Sinoue-Ζιμπέρ Σινουέ"},{"quote":"“I didn’t want to give up my job and join the ranks of the Doing Fuck All brigade no matter how much money I had in the bank.” ― Sara Sheridan, Ma Polinski's Pockets"},{"quote":"“12% of employees eat because they are hungry. 88% of employees eat because it is 1 o’clock.” ― Mokokoma Mokhonoana"},{"quote":"“Somebody is born. Somebody goes to school. Somebody learns to conform. Somebody types a CV. Somebody gets a job. Somebody follows orders. Somebody gets a golden watch. And then, eventually, Somebody dies. And, a Nobody is buried.” ― Mokokoma Mokhonoana, The Confessions of a Misfit"},{"quote":"“If growing up means not seeing one’s family and friends on the regular—all in the name of paying the bills, then growing up is overrated.” ― Mokokoma Mokhonoana, The Confessions of a Misfit"},{"quote":"“The poorest person on earth is not the person who has no job, no cars, no money and no house. The poorest person is the one who has no vision. Visionlessness is poverty in disguise.” ― Israelmore Ayivor, Michelangelo | Beethoven | Shakespeare: 15 Things Common to Great Achievers"},{"quote":"“A genius does what he masters. An ordinary man tries to master what he does.” ― Mokokoma Mokhonoana, The Confessions of a Misfit"},{"quote":"“A job interview is a competition won by those who are qualified the most, and, those who are willing to be payed the least.” ― Mokokoma Mokhonoana"},{"quote":"“To a man, a woman is fun to be with … until she gains weight. To a woman, a man is fun to live with … until he loses his job.” ― Mokokoma Mokhonoana"},{"quote":"“The rich spend their life living; the poor spend their life making a living.” ― Mokokoma Mokhonoana"},{"quote":"“Employment is slavery. Workers merely have a choice over where to serve their daily eight-hour sentence.” ― Mokokoma Mokhonoana, The Confessions of a Misfit"},{"quote":"“The scientist is not responsible for the laws of nature. It is his job to find out how these laws operate. It is the scientist’s job to find the ways in which these laws can serve the human will. However, it is not the scientist’s job to determine whether a hydrogen bomb should be constructed, whether it should be used, or how it should be used. This responsibility rests with the American people and with their chosen representatives.” ― Edward Teller"},{"quote":"“When a man's girlfriend's parents ask him what it is that he does for a living: they’re not really concerned about him; they’re concerned about their daughter’s tummy.” ― Mokokoma Mokhonoana"},{"quote":"“When it comes to getting a job or client, congruent value is aligning the employer's need with your value add.” ― Richie Norton, Résumés Are Dead and What to Do About It"},{"quote":"“It's a rotten job, but somebody's got to do it.” ― Agatha Christie, The Seven Dials Mystery"},{"quote":"“You know, Piggly Wiggly never could hang on to a night stock manager. Your math skills would be a plus, maybe even your Spanish, and you don't mind staying up late.\"\"Piggly Wiggly, wow. I hadn't thought about that. I'll swing by, pick up an application tomorrow. But if it doesn't pan out maybe ... Never mind, it's a crazy idea.\"\"No, tell me. I want to hear it.\"\"Well, just as a backup plan, I did hear that Sony has an opening. They're, um, they're looking for a rock star. The hours suck, but it's no worse than night stock manager at Pigs. I bet it pays better too.\"Isabel stopped in her tracks, playfully slapping his arm. \"Aidan, that's genius! That's what you should do! I've heard you sing, you can carry a decent tune.\" She looked him up and down. \"With a little work, you can probably pull off the image.\"He tugged on her arms until she was in his. \"Only if you're sure. Only if it's what we want.\"\"Aidan, it's who you are. I've known it since the day we brought that first guitar here. I'd never want to take that away.” ― Laura Spinella, Perfect Timing"},{"quote":"“We often hear that mathematics consists mainly of 'proving theorems.' Is a writer's job mainly that of 'writing sentences?” ― Gian-Carlo Rota"},{"quote":"“Follow your passion; Do not get married to it, though.” ― Ashok Kallarakkal"},{"quote":"“A vagina is an uneducated woman’s diploma.” ― Mokokoma Mokhonoana"},{"quote":"“Torn clothes are funny … until your dad gets fired.” ― Mokokoma Mokhonoana"},{"quote":"“Employees go to school for 12 – 18 years merely to impress prospect employers in a 12 – 18 minutes interview.” ― Mokokoma Mokhonoana"},{"quote":"“School fools a lot of people. Professionally, one thing is not the most that one person can be.” ― Mokokoma Mokhonoana, The Confessions of a Misfit"},{"quote":"“When your job is what defines you, when that is the be-all and end-all of your existence, what does a fake smile and a sallow look matter. You have to save your job to keep body and soul together, don't you?” ― Andy Paula"},{"quote":"“If you schlep a shit job everyday, keep and feed a little secret life--whether it's writing, art, running, music, your thoughts. It's yours.” ― Don Roff"},{"quote":"“El trabajo, creando el hábito del esfuerzo, sería la mejor escuela del carácter; pero la sociedad enseña a odiarlo, imponiéndolo precozmente, como una ignominia desagradable o un envilecimiento infame, bajo la esclavitud del yugo y de horarios, ejecutado por hambre o por avaricia, hasta que el hombre huye de él como de un castigo: sólo podrá amarlo cuando sea una gimnasia espontánea de sus gustos y de sus aptitudes.” ― José Ingenieros, El hombre mediocre"},{"quote":"“A model’s opinion seldom matters. The only time that he is required to open his mouth is when he is required to smile at the camera.” ― Mokokoma Mokhonoana"},{"quote":"“If you want your dreams to work out for you, you must work with them. Pay the price and have the package of your accomplishments in full versions.” ― Israelmore Ayivor"},{"quote":"“I want to make a difference. But get a job? I worry that will make the ordinary, like everybody else.” ― Claire Messud, The Emperor's Children"},{"quote":"“Do your job well without expecting any appreciation; then you will see that all the appreciation will come onto you just like the summer rains coming onto the thirsty flowers! Just do your job well!” ― Mehmet Murat ildan"},{"quote":"“When a man's bank balance becomes too small, his woman flees. For a man to do the same, his woman's body — or vagina — has to do the opposite.” ― Mokokoma Mokhonoana"},{"quote":"“Job was comfortless before the speech of Jehovah and is comforted after it. He has been told nothing, but he feels the terrible and tingling atmosphere of something which is too good to be told.” ― G.K. Chesterton, G.K.C As M.C.: Being a Collection of Thirty-Seven Introductions"},{"quote":"“At its core, each vocation is a particular, unique instantiation of the father’s summons to the true homeland of the kingdom. The etymological root of the word ‘vocation’ points in this direction. The word is derived from the Latin verb “vocare” – “to call.” Thus, through the son the father calls each one of us home.” ― Mark Doherty"},{"quote":"“I take it that he is more than just a woodcutter.”“No one is just a woodcutter,” replied Terence.“A person's always more than his present occupation.” ― Gerald Morris, The Savage Damsel and the Dwarf"},{"quote":"“God does not need our good works, but our neighbor does.” ― Martin Luther"},{"quote":"“I wasn't sleeping on the streets at night. Of course, there were a lot of good people sleeping in the streets. They weren't fools, they just didn't fit into the needed machinery of the moment. And those needs kept altering.” ― Charles Bukowski, Pulp"},{"quote":"“The primary purpose of going to college isn't to get a great job. The primary purpose of college is to build a strong mind, which leads to greater self-awareness, capability, fulfillment, and service opportunities, which, incidentally, should lead to a better job.” ― Sean Covey, The 6 Most Important Decisions You'll Ever Make: A Guide for Teens"},{"quote":"“Let the preacher tell the truth. Let him make audible the silence of the news of the world with the sound turned off so that in the silence we can hear the tragic truth of the Gospel, which is that the world where God is absent is a dark and echoing emptiness; and the comic truth of the Gospel, which is that it is into the depths of his absence that God makes himself present in such unlikely ways and to such unlikely people that old Sarah and Abraham and maybe when the time comes even Pilate and Job and Lear and Henry Ward Beecher and you and I laugh till the tears run down our cheeks. And finally let him preach this overwhelming of tragedy by comedy, of darkness by light, of the ordinary by the extraordinary, as the tale that is too good not to be true because to dismiss it as untrue is to dismiss along with it that catch of the breath, that beat and lifting of the heart near to or even accompanied by tears, which I believe is the deepest intuition of truth that we have.” ― Frederick Buechner, Telling the Truth: The Gospel as Tragedy, Comedy, and Fairy Tale"},{"quote":"“For God's sakes, quit worrying about your next job. Just do the best you can at the job you have now, and the offers will come. And when they do, if you have confidence in yourself you don't have to feel that you can't turn it down if it isn't quite right for you because you fear you'll never get another offer. You will. Wait for the right opportunity, and turn down all the rest. It will make all the difference.” ― Bo Schembechler, Bo's Lasting Lessons: The Legendary Coach Teaches the Timeless Fundamentals of Leadership"},{"quote":"“... In a ROWE* people don't have schedules.They show up when they want.They don't have to be in the office at certain time, or anytime.They just have to get their work done.How they do it ?When they do it ?Where they do it ?It's totally up to them.Meetings & this kind of environments are Optional.What happens ... ?Almost across the board !- Productivity goes up- Worker Engagement goes up- Worker Satisfaction goes up- Turnovers goes down- Autonomy .. Mastery .. Purpose -these are the building blocks of new way of doing things.\"______________________________________________________________*ROWE: results-only work environment” ― Daniel Pink"},{"quote":"“A question is a door and an unopened door is just part of the wall and as long as it's standing it's doing its job.” ― Brian McGreevy, Hemlock Grove"},{"quote":"“Books are only half our job ; the other half is human nature.” ― Mary Virginia Provines, Bright Heritage"},{"quote":"“Make no mistake: Your salary is held to the same standards your grades were held to in the educational system, where you couldn't surpass a 100 no matter how hard you worked or how intelligent you were.” ― Carlos Roche, How to Turn Your Boss Into Your Employee"},{"quote":"“12% of employees study further to learn more. 88% of employees study further to earn more.” ― Mokokoma Mokhonoana"},{"quote":"“In the end when God does speak, it is not the pious friends who are commended. God tells then they have been guilty of misrepresenting God. Only Job – only angry, defiant, doubting Job has been faithful.The story of Job reminds us that God is not offended when we question. Indeed, if anything God is offended when we speak too glibly. Make room in your heart for the angry, defiant and doubting questions. You may find God there as well.” ― Peggy Haymes, Strugglers, Stragglers and Seekers: daily devotions for the rest of us"},{"quote":"“There's a fine line between career criminals and career professionals because most of us fall somewhere in between.” ― Samantha Leahy"},{"quote":"“I love my career. It is a career. A difficult one that takes many hours and total dedication to my craft. It is also what I was born to do--tell stories and entertain.” ― Michelle M. Pillow"},{"quote":"“This is not his job, I thought, it's his passion.” ― Howard Schultz, Onward: How Starbucks Fought for Its Life without Losing Its Soul"},{"quote":"“My job is to know what other people do not know.” ― Sherlock Holmes"},{"quote":"“We are trained to be employees, but no one said that we have endure a limited salary that barely keeps pace with inflation.” ― Carlos Roche"},{"quote":"“გაქვს დრო მუშაობისთვის,და გაქვს დრო სიყვარულისთვის.სხვა რამისთვის დრო უბრალოდ არ გრჩება.” ― Coco Chanel"},{"quote":"“...it’s my job to lead you to success, and, if you fail, it’s because I failed, not you.’” (Spoken by Bracke, told by Eric)” ― Shannon A. Thompson, Minutes Before Sunset"},{"quote":"“The doctrine of vocation deals with how God works through human beings to bestow His gifts. God gives us this day our daily bread by means of the farmer the banker, the cooks, And the lady at the check-out counter. He creates new life – the most amazing miracle of all – by means of mothers and fathers. He protects us by means of the police officers, firemen, and our military. He creates. Through artists. He heals by working through doctors, nurses, and others whom He has gifted, equipped, and called to the medical professions.” ― Gene Edward Veith Jr."},{"quote":"“People who like their job will give it their best. Those who don't, show it by a poor performance.” ― Ellen J. Barrier"},{"quote":"“A religious person without no job is a dead person. (Iigbagbo ti koni ise oku ni. - Yoruba proverb)” ― Habeeb Akande"},{"quote":"“Imagination is pure potentiality for creation. We shouldn't submit it to the hourly wages we subject our time at work.” ― Carlos Roche, How to Turn Your Boss Into Your Employee"},{"quote":"“If you need an alarm clock, you need a new job.” ― Ziad K. Abdelnour, Economic Warfare: Secrets of Wealth Creation in the Age of Welfare Politics"},{"quote":"“Setiap strategi untuk mengurangi kemiskinan antargenerasi harus dipusatkan pada pekerjaan, bukan pada kesejahteraan--bukan hanya karena pekerjaan itu memberikan kebebasan dan pendapatan, melainkan juga karena pekerjaan itu mendatangkan kedisiplinan, struktur, harga diri, dan kesempatan untuk berkembang dalam kehidupan masyarakat.” ― Barack Obama, The Audacity of Hope: Thoughts on Reclaiming the American Dream"},{"quote":"“When we help others to perform at the highest level of their potential, we receive something of value; our character is strengthened.” ― Ellen J. Barrier"},{"quote":"“It was his vocation to pleasure as many women as possible, in pursuit of his own pleasure. It was as close to a job as he got.” ― Rosanna Leo, Sweet Hell"},{"quote":"“Say this one time with me: \"Would you like that in a pump or a loafer?\"... Good. Now memorize it, because starting tomorrow, the only job that you're going to be able to get is selling SHOES!” ― George Huang, Swimming with Sharks"},{"quote":"“Job is an optimist. He shakes the pillars of the world and strikes insanely at the heavens; he lashes the stars, but it is not to silence them; it is to make them speak.” ― G.K. Chesterton"},{"quote":"“When we perform at our highest level of potential, we are content. Because we have given I best in what we enjoy doing.” ― Ellen J. Barrier"},{"quote":"“I‘m very aware that my personal life, my marriage, is the source of speculation and interest in the department and with the public. I can live with that. I’m also aware that my husband’s businesses, and his style of conducting his businesses, are also the source of speculation and interest. I have no particular problem with that. But I resent very much that my reputation and my husband’s character should be questioned this way. From the media, Commander, it’s to be expected, but not from my superior officer. Not from any member of the department I’ve served to the best of my ability. I want you to take note, Commander, that turning in my badge would be like cutting off my arm. But if it comes down to a choice between the job and my marriage, then I lose the arm.” ― J.D. Robb"},{"quote":"“... a practical problem can only be solved by action itself. When your practical problem is how to earn a living, a book on how to make friends and influence people cannot solve it, though it may suggest things to do. Nothing short of the doing solves the problem. It is solved only by earning a living.” ― Mortimer Jerome Adler, How to Read a Book: The Classic Guide to Intelligent Reading"},{"quote":"“No man engaged in a work he does not like can preserve many saving illusionsabout himself. The distaste, the absence of glamour, extend from the occupation to the personality. It is only when ourappointed activities seem by a lucky accident to obey the particular earnestness of our temperament that we can taste the comfort of complete self-deception.” ― Joseph Conrad, The Secret Agent"},{"quote":"“It is the writer's job to craft a story so compelling that strangers will pay to hear it.” ― Seeley James"},{"quote":"“I too was pinched off from a piece of clay, I too modeled by omnipotence and flankedby things too wonderful for me” ― Bryana Johnson, Having Decided To Stay"},{"quote":"“The American College of Sports Medicine found that the productivity of people after exercise was an average of 65 percent higher than those who did not exercise. If I have something that's really bothering me, so much that it almost hurts my head to try to sort it out, I always find the solution in a puddle of sweat! Intense exercise is like taking a magic pill that gives you the ability to solve problems like a superhero.” ― Chalene Johnson, PUSH: 30 Days to Turbocharged Habits, a Bangin' Body, and the Life You Deserve!"},{"quote":"“In bad countries the government takes care of everyone. In the best ones that's not necessary!‏” ― Celso Cukierkorn, Secrets of Jewish Wealth Revealed!"},{"quote":"“Never leave a job unfinished, unless you are unable to finish it.” ― Santonu Kumar Dhar"},{"quote":"“For the man in the paddock, whose duty is is to sweep up manure,the supreme terror is the possibility of a world without horses. Totell him that it is disgusting to spend one’s life shoveling up hotturds is a piece of imbecility. A man can get to love shit if hislivelihood depends on it, if his happiness is involved.” ― Henry Miller"},{"quote":"“Never send a Man in to do a Donkey's job” ― Josh Stern"},{"quote":"“For most of us a job is bread and butter and for most of others its just bread and butter.” ― Aniruddha Sastikar"},{"quote":"“I heart my job. I get to make things up for a living.” ― Michelle M. Pillow"}]
