[{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"}]
