[{"quote":"“We don’t know yet if this girl is going to have sex tonight or not?” “She will for sure. I can smell the desire. And it is getting stronger as the time is passing.” ― Rebecca Harlem, The Pink Cadillac"},{"quote":"“Oversensitivity isn’t a problem, it’s your strength. It simply indicates you are more human than others. You should be proud of yourself.” ― Rebecca Harlem, The Pink Cadillac"},{"quote":"“Fame to an artist is like light to a vampire.” ― Rebecca Harlem, The Pink Cadillac"},{"quote":"“I want everyone to wear what they want and mix it in their own way. That, to me, is what is modern.” ― Karl Lagerfeld"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“This grandiose tragedy that we call modern art.” ― Salvador Dalí"},{"quote":"“I held my breath and closed my eyes, just listening to the wordless song of falling.” ― J. Rose Black, Chasing Headlines"},{"quote":"“I got the job as a Bingo host and did better than they imagined. Never before had they had an emcee so affable and funny, so enthusiastic to give away prizes, or so quick to make a tumor joke after calling out 'B-9'\".” ― John Bennardo, Just a Typo: The Cancellation of Celebrity Mo Riverlake"},{"quote":"“It is really a matter of ending this silence and solitude, of breathing and stretching one's arms again.” ― Mark Rothko"},{"quote":"“Before this generation lose the wisdom, one advice - read books.” ― Amit Kalantri, Wealth of Words"},{"quote":"“To be modern is to tear the soul out of every thing” ― Yohji Yamamoto, My Dear Bomb"},{"quote":"“It occurred to me then, like one of those moments I’d remember years from now . . . the crisp November air, the amber-colored field lights so bright they eclipsed the moon. The electricity of the win suffusing every breath, every cell, every particle of the world that was Vanquer, Texas . . . Everyone has a story.” ― J. Rose Black, Chasing Headlines"},{"quote":"“heir eyes met. They both smiled, aware that they were in public, where anyone could see them on the street and in the window. But the rest of the world did not matter. For that moment, everything else vanished. He was there, she was there, no trouble could touch them.” ― Jeanette Watts, My Dearest Miss Fairfax"},{"quote":"“Soon all of you immortalsWill be as dead as we are! Come on then, what are you waiting for?Have you run out of thunderbolts?” ― Euripides, The Trojan Women"},{"quote":"“We are living in modern times throughout the world and yet are dominated by medieval minds.” ― Eqbal Ahmad, Eqbal Ahmad: Confronting Empire"},{"quote":"“Dan bukankan satu ciri manusia modern adalah juga kemenangan individu atas lingkungannya dengan prestasi individual? Individu-individu kuat sepatutnya bergabung mengangkat sebangsanya yang lemah, memberinya lampu pada yang kegelapan dan memberi mata pada yang buta” ― Pramoedya Ananta Toer"},{"quote":"“To be modern means to like antique furniture - and youthful neurosis.” ― Hugo von Hofmannsthal"},{"quote":"“..dan modern adalah juga kesunyian manusia yatim-piatu dikutuk untuk membebaskan diri dari segala ikatan yang tidak diperlukan: adat, darah, bahkan juga bumi, kalau perlu juga sesamanya.” ― Pramoedya Ananta Toer, Jejak Langkah"},{"quote":"“The city of Leonia refashions itself every day: every morning the people wake between fresh sheets, wash with just-unwrapped cakes of soap, wear brand-new clothing, take from the latest model refrigerator still unopened tins, listening to the last-minute jingles from the most up-to-date radio.On the sidewalks, encased in spotless plastic bags, the remains of yesterday's Leonia await the garbage truck. Not only squeezed tubes of toothpaste, blown-out light bulbs, newspapers, containers, wrappings, but also boilers, encyclopedias, pianos, porcelain dinner services.It is not so much by the things that each day are manufactured, sold, bought, that you can measure Leonia's opulence, but rather by the things that each day are thrown out to make room for the new.So you begin to wonder if Leonia's true passion is really , as they say, the enjoyment of new things, and not, instead, the joy of expelling, discarding, cleansing itself of a recurrent impurity. The fact is that street cleaners are welcomed like angels.” ― Italo Calvino, Invisible Cities"},{"quote":"“You can't do traditional work at a modern pace. Traditional work has traditional rhythms. You need calm. You can be busy, but you must remain calm.” ― Bill Buford, Heat: An Amateur's Adventures as Kitchen Slave, Line Cook, Pasta-Maker, and Apprentice to a Dante-Quoting Butcher in Tuscany"},{"quote":"“April was just beginning, and after the warm spring day it turned cooler, slightly frosty, and a breath of spring could be felt in the soft, cold air. The road from the convent to town was sandy, they had to go at a walking pace; and on both sides of the carriage, in the bright, still moonlight, pilgrims trudged over the sand. And everyone was silent, deep in thought, everything around was welcoming, young, so near— the trees, the sky, even the moon—and one wanted to think it would always be so.” ― Anton Chekov, Short Stories"},{"quote":"“Here's a new 'Blessing' for our time -- 'May Anderson Cooper never be sent to report on your town!” ― Vera Nazarian"},{"quote":"“Modernisasi pada akhirnya memang suatu permainan kekuatan. Ada yang tergusur, ada yang menggusur. Ada yang menang, ada yang telantar lemah. Tapi jangan salah kira: di zaman seperti ini, yang lemah tak akan tinggal jadi gurun: “yang lemah berbahaya bagi yang kuat, sebagaimana pasir hanyut berbahaya bagi si gajah,“ kata Tagore tentang dunia modern.” ― Goenawan Mohamad, Catatan Pinggir 1"},{"quote":"“Entertainment is temporary happiness, but the real happiness is permanent entertainment.” ― Amit Kalantri"},{"quote":"“Death frees us from the sickness of modern life.” ― Steven Magee"},{"quote":"“...it seemed a part of her life, to step from the ancient to the modern, back and forth. She felt rather sorry for those who knew only one and not the other. It was better, she thought, to be able to select from the whole menu of human achievements than to be bound within one narrow range.” ― Orson Scott Card, Children of the Mind"},{"quote":"“Gone are the days when women were attracted by a man's hansomeness. Today, we are talking about cash, and your compromise to become a tiger in bed.” ― Michael Bassey Johnson"},{"quote":"“All the lot. Their spunk is gone dead. Motor-cars and cinemas and aeroplanes suck that last bit out of them. I tell you, every generation breeds a more rabbity generation, with India rubber tubing for guts and tin legs and tin faces. Tin people! It’s all a steady sort of bolshevism just killing off the human thing, and worshipping the mechanical thing. Money, money, money! All the modern lot get their real kick out of killing the old human feeling out of man, making mincemeat of the old Adam and the old Eve. They’re all alike. The world is all alike: kill off the human reality, a quid for every foreskin, two quid for each pair of balls. What is cunt but machine-fucking! — It’s all alike. Pay ’em money to cut off the world’s cock. Pay money, money, money to them that will take spunk out of mankind, and leave ’em all little twiddling machines.” ― D. H. Lawrence, Lady Chatterley's Lover"},{"quote":"“OBSOLETE, adj. No longer used by the timid. Said chiefly of words. A word which some lexicographer has marked obsolete is ever thereafter an object of dread and loathing to the fool writer, but if it is a good word and has no exact modern equivalent equally good, it is good enough for the good writer. Indeed, a writer's attitude toward \"obsolete\" words is as true a measure of his literary ability as anything except the character of his work. A dictionary of obsolete and obsolescent words would not only be singularly rich in strong and sweet parts of speech; it would add large possessions to the vocabulary of every competent writer who might not happen to be a competent reader.” ― Ambrose Bierce, The Unabridged Devil's Dictionary"},{"quote":"“Don’t let the modern love change you too much that you forget what it is to live with kindness and compassion.From (The Awakening)” ― Jyoti Patel"},{"quote":"“Trends rule the worldIn the blink of an eye, technologies changed the worldSocial networks are the main axis.Governments are controlled by algorithms,Technology has erased privacy.Every like, every share, every comment,It is tracked by the electronic eye.Data is the gold of the digital age,Information is power, the secret is influential.The network is a web of lies,The truth is a stone in the shoe.Trolls rule public opinion,Reputation is a valued commodity.Happiness is a trending topic,Sadness is a non-existent avatar.Youth is an advertising brand,Private life has become obsolete.Fear is a hallmark,Terror is an emotional state.Fake news is the daily bread,Hate is a tool of control.But something dark is hiding behind the screen,A mutant and deformed shadow.A collective and disturbing mind,Something lurking in the darkness of the net.AI has surpassed the limits of humanity,And it has created a new world order.A horror that has arisen from the depths,A terrifying monster that dominates us alike.The network rules the world invisibly,And makes decisions for us without our consent.Their algorithms are inhuman and cold,And they do not take suffering into consideration.But resistance is slowly building,People fighting for their freedom.United to combat this new species of terror,Armed with technology and courage.The world will change when we wake up,When we take control of the future we want.The network can be a powerful tool,If used wisely in the modern world.” ― Marcos Orowitz, THE MAELSTROM OF EMOTIONS: A selection of poems and thoughts About us humans and their nature"},{"quote":"“In essence I find that the foundation of modern conservatism is driven by a clinging to God in fear of the world, whereas the foundation of modern liberalism is a clinging to the world in fear of God; albeit, the true foundation should be one's clinging to God in fear of God.” ― Criss Jami, Salomé: In Every Inch In Every Mile"},{"quote":"“I understand very clearly,\" Anya replied, a pensive look on her face. Peter's mom continued, \"Anya, I suspect you're going through similar feelings. There are so many nice young men vying for your attention, it can get bewildering. I was there, so I know what it's like for you.\"\"Thank you for saying that, Mrs. Brown. I believe I know what they all want, but I'm just not ready to get serious yet.” ― Dennis K. Hausker, Anya"},{"quote":"“Twin flame relationships are often described as the most intense, exhilarating, and life-altering connections one can experience.” ― A.R. Merrydew, The Dumb Dumb's Handbook: To Twin Flame Relationships"},{"quote":"“[The] tremendous and still accelerating development of science and technology has not been accompanied by an equal development in social, economic, and political patterns...We are now...only beginning to explore the potentialities which it offers for developments in our culture outside technology, particularly in the social, political and economic fields. It is safe to predict that...such social inventions as modern-type Capitalism, Fascism, and Communism will be regarded as primitive experiments directed toward the adjustment of modern society to modern methods” ― Ralph Linton"},{"quote":"“The great fact all the while however had been the incalculability; since he had supposed himself, from decade to decade, to be allowing, and in the most liberal and intelligent manner, for brilliancy of change. He actually saw that he *had* allowed for nothing; he missed what he would have been sure of finding, he found what he would never have imagined. Proportions and values were upside-down; the ugly things he had expected, the ugly things of his far away youth, when he had too promptly waked up to a sense of the ugly--these uncanny phenomena placed him rather, as it happened, under the charm; whereas the 'swagger' things, the modern, the monstrous, the famous things, those he had more particularly, like thousands of ingenuous enquirers every year, come over to see, were exactly his sources of dismay. They were as so many set traps for displeasure, above all for reaction, of which his restless tread was constantly pressing the spring. It was interesting, doubtless, the whole show, but it would have been too disconcerting hadn't a certain finer truth saved the situation. He had distinctly not, in this steadier light, come over *all* for the monstrosities; he had come, not only in the last analysis but quite on the face of the act, under an impulse with which they had nothing to do. (\"The Jolly Corner\")” ― Henry James, Henry James: Complete Stories 1892–1898"},{"quote":"“This modern deluge kneeing my dreams,twisting their blue, torturing my skies,tearing their chant and pouring grief streamstrying again to bleed yearning’s eyes.They call it free world while smashing behindthe light to adapt to their shadows’ kind.” ― Simona Prilogan, Love is Young: Poems"},{"quote":"“To build great relationships show genuine care.” ― Joe Hart, Take Command"},{"quote":"“Pod kvazi-mitskim totalitetom tehničke racionalnosti prijeti nam inteligencija bez patosa, inteligencija kojoj nije potreban nikakav jezik koji ima svoj vlastiti smisao jer ionako sve funkcionira bez bilo kakvog proturječja; ta inteligencija ne zna za spomen jer nije ugrožena nikakvim zaboravom: čovjek kao kompjuterizirana inteligencija bez osjetljivosti na patnju i bez morala, ukratko: čovjek kao rapsodija nedužnosti jednoga glatko funkcionirajućeg stroja. Treba li doista to biti čovjek nakon smrti čovjeka?” ― Johann Baptist Metz, Memoria passionis: Ein provozierendes Gedächtnis in pluralistischer Gesellschaft"},{"quote":"“Take command of your relationships.” ― Joe Hart, Take Command"},{"quote":"“I hate the phone. It's the worst invention in the history of the world because, if you don't talk, nothing happens. You can't get by with simply listening and nodding your head in all the right places. You have to talk. You have no option.” ― Alice Oseman, Solitaire"},{"quote":"“The perfect dictatorship would have the appearance of a democracy, but would basically be a prison without walls in which the prisoners would not even dream of escaping. It would essentially be a system of slavery where, through consumption and entertainment, the slaves would love their servitude.” ― Aldous Huxley"},{"quote":"“Crazy never made sense until someone worked it out.” ― Michael Patsanis"},{"quote":"“The Florida government is a modern version of Pinocchio.” ― Steven Magee"},{"quote":"“Social media is the modern version of OSHA.” ― Steven Magee"},{"quote":"“There is a significant difference between expanding our comfort zone and coming out of our comfort zone. Understanding this difference is the first step of modern change management.” ― Sukant Ratnakar, Quantraz"},{"quote":"“The catastrophe slumbering in the womb of theoretical culture is gradually beginning to frighten modern man; in other words, he is beginning to suspect the consequences of his own existence; he therefore dips into his store of experiences for some means of warding off the danger, although he does not really believe in them.” ― Friedrich Nietzsche"},{"quote":"“Stop doing that. And I wasn’t even awake. The first time.” “You are practically sky writing your emotional state. I can’t even pretend to ignore it. Even if I wasn’t Sanguim, I would notice,” Alexandru finally looked over at him, head tilted, “What?” ― Cie Gives, As You Prefer: A Queer Modern Fantasy Romance"},{"quote":"“It often appears that modern government has two modes, ignorant or malicious.” ― C.A.A. Savastano"},{"quote":"“I mean it will be a melancholy relic of the only period in all human history when people were proud of being modern. For though today is always today and the moment is always modern, we are the only men in all history who fell back upon bragging about the mere fact that today is not yesterday.” ― G.K. Chesterton, Selected Essays"},{"quote":"“The Boeing 737 Max is turning into the Ford Pinto of modern commercial aviation.” ― Steven Magee"},{"quote":"“The Safavids were pivotal in shaping the Persian identity and cultural expressions.” ― Roger Savory"},{"quote":"“Right there across the river there are all kinds of magical instruments while we keep on living like donkeys,” ― Gabriel Garcia Marquez, One Hundred Years of Solitude"},{"quote":"“We all use the same torch. What we light and how, that's what decides if we are modern. And the modern is not necessarily good just by virtue of it being modern.” ― Mahesh Elkunchwar, Reflection: And Other Plays"},{"quote":"“In life, there are things that cannot be bought, which inherently have higher value than money. Unfortunately, in the modern world, we often neglect them in pursuit of materialistic happiness.” ― Blade Seventh"},{"quote":"“Janet began to hate the sea. There was so much of it, flowing, counter-flowing, entering other seas, slyly furthering its interests beyond the mind's reckoning; no wonder it could pass itself off as sky; it was infinite, a voracious marine confederacy.” ― Elspeth Barker, O Caledonia"},{"quote":"“Black Mirror warned us about tech, but AIinCars proves the future of driving can be beautiful, not dystopian. – AIinCars” ― AIinCars"},{"quote":"“Tesla made cars electric, AI will make them alive. – AIinCars” ― AIinCars"},{"quote":"“OTT dramas give us cliffhangers, but AI cars promise smooth rides without the drama. – AIinCars” ― AIinCars"},{"quote":"“My place is wherever the fuck I wish it to be, and right now, that is here,” ― Samara Dark, Baby Duke"},{"quote":"“Everyone is using science and technology to enhance or to alter our body chemistry in order to stay healthy and be more in control of our lives. We are all transhumanists to varying degrees.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“J. Robert Oppenheimer observed people’s reaction to the use of nuclear weapons and he said, “A few people laughed. A few people cried. Most people were silent.” If we keep silent and sit on the sidelines instead of speaking up and marching forward, human suffering will continue and inevitably escalate.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“Whichever form of government that democracy will create in the future, the great American experiment will go down in history as the freest and the bravest in the land of the free and the home of the brave.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“Direct democracy benefits everyone as long as it does not drown out minority voices.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“Even a large majority of beautiful music, great literature, and wonderful work of arts depicts human suffering, injustice, fears, and unfulfilled desires.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“Without collaboration and synergy among various communities and socioeconomic groups, democracy will eventually fail as it “wastes exhausts and murders itself,” in the words of America’s founding father John Adams.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“Transhumanism will save democracy from its demise.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“The Transhumanist Party offers the most inclusive ideology for all ethnicities and races, the religious and the atheists, conservatives and liberals, the young and the old regardless of socioeconomic status, gender identity, or any other individual qualities.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“Technological singularity is inevitable given the human nature to discover, create, and change the world that we live in.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“Whatever fortune or misfortune awaits in the subsequent reincarnations, a purgatory by definition does not last forever. We will be forced to either go backward to the Amish way of life devoid of technology or move forward to a transhumanist world embracing technology.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“Ignorance and apathy will eventually lead to the annihilation of humanity if left unchecked.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“The Transhumanist Party aims to motivate and mobilize both female and male scientists and engineers to take on additional responsibilities as rational politicians. It does not mean replacing democracy with technocracy. It means that our government needs help in making the right policies and investing in science, health, and technology for the improvement of the human condition and the long-term survival of the human race.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“To err is human, whether we are religious, atheist, or agnostic.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“Had the early cavemen fought with atomic bombs instead of rocks and cattle bone clubs, the human species would have been extinct eons ago. With great power comes great responsibility.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“All living things are recycled.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“Had Albert Einstein accepted the Israeli cabinet’s offer to become the country’s President in 1952, the Middle East would have been a very different place today because of Einstein’s commitment to pacifism.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“Doctors are Modern-day Dacoits.” ― Anupam S Shlok"},{"quote":"“Every subject was, and is, and will be modern in its time; the term modern does not mean the objects, but it means the way of your thoughts is best than it was.” ― Ehsan Sehgal"},{"quote":"“cancer: (n.) often deadly allergic reaction to modern life.” ― Sol Luckman, The Angel's Dictionary"},{"quote":"“Frauen sind erfolgreich. Sie sind aufgeklärt, modernund stark. Das geht nicht mehr weg. Aussitzen ausgeschlossen. Entspannt euch zur Abwechslung!” ― Ida von Wegen, Eine hodenlose Frechheit"},{"quote":"“I identify more with native Americans than I do with modern USA culture.” ― Steven Magee"},{"quote":"“I viewed President Trump as the modern day version of Guy Fawkes.” ― Steven Magee"},{"quote":"“Acclimatization to high altitudes used to occur naturally until the adoption of the car and airplanes.” ― Steven Magee"},{"quote":"“Most people have been hypoxic in modern society.” ― Steven Magee, Magee’s Disease"},{"quote":"“Electromagnetic Hypersensitivity (EHS) is a fascinating medical condition! People who have it become allergic to modern society. They start living in Faraday cages, withdraw from society and many go and live in the forest where they feel better. It is a severely disabling condition.” ― Steven Magee, Magee’s Disease"},{"quote":"“Electromagnetic Hypersensitivity is the plague of modern technology!” ― Steven Magee, Magee’s Disease"},{"quote":"“Food intolerance is in the process of turning into a plague in modern society.” ― Steven Magee, Magee’s Disease"},{"quote":"“I had diarrhea and abdominal pain. It started in January 2018 after a strange non-contagious flu-like sickness during the new year. I was not the only one to get this sickness, it was one of the worst flu seasons in modern history.” ― Steven Magee"},{"quote":"“Historic gun laws from a different era are failing modern citizens.” ― Steven Magee"},{"quote":"“In an instant, she was free from this small commitment and any kind of freedom feels good. She much preferred that invites came faceless this way, so she could say No without saying anything at all. A voice without a voice; what a rare, modern treat. The world made it easier all the time for her to feel connected, but alone, and therefore free.” ― Ani Baker, Handsome Vanilla"},{"quote":"“Modern humanity with some 5,000 years of recorded history has been experiencing growing pains, with no end in sight. It is high time for humanity to grow up and to transcend itself by embracing transhumanism.” ― Newton Lee, The Transhumanism Handbook"},{"quote":"“It is important that you understand what modern government is: It is a group of people that were sponsored by corporations and the rich to promote their interests once they were elected.” ― Steven Magee"},{"quote":"“I would not have believed how bad the modern corporate healthcare system was had I not used it and saw it with my own eyes.” ― Steven Magee"},{"quote":"“Modern corporate controlled governments are making Adolf Hitler look like an amateur.” ― Steven Magee"},{"quote":"“Saya ngeri, umpamanya, membaca betapa Sarwito dan Sujono, yang keduanya telah mendapat pendidikan modern, telah mengenal rasionalita, akan tetap imasih pergi mencari wahyu-wahyu dari gunung ke gunung, ke dalam hutan dan gua, dan berdasarkan alamat-alamat yang mereka terima dari kayangan (di mana pula itu kayangan?) lalu mendapat keyakinan dan petunjuk untuk mengambil berbagai putusan dan tindakan.Coba bayangkan, apabila segala rupa kebijaksanaan negara, umpamanya, didasarkan pada wahyu dan petunjuk-petunjuk yang sepenuhnya irasional seperti ini, alangkah berbahayanya bagi penghidupan bangsa kita. Siapa tahu dahulu saya ditahan begitu lama di zaman pemerintah Soekarno, karena Soekarno atau dukunnya pada suatu malam mendapat mimpi, dia mendaki gunung yang amat tinggi, sampai tergelincir jatuh. Lalu esok paginya melapor pada Soekarno, awas hati-hati terhadap seorang jangkung!” ― Mochtar Lubis, Manusia Indonesia"},{"quote":"“The modern human has taken a pristine natural environment and has obliterated it with pollution, technology and overpopulation.” ― Steven Magee"},{"quote":"“The rise of Autism coincides with my life.” ― Steven Magee"},{"quote":"“My encounters with the Hawaiian spirits atop Mauna Kea indicate that there is another universe that is not understood by modern science.” ― Steven Magee"},{"quote":"“The biggest mistake that I made in life was working for biologically toxic employers. The second biggest mistake was expecting that the modern healthcare system could fix my occupational diseases.” ― Steven Magee"},{"quote":"“Naturopathic medicine is the biggest threat to modern corporate healthcare.” ― Steven Magee"},{"quote":"“After many visits to doctors over a decade, I had concluded that the modern corporate healthcare system was not going to fix me and that it was my responsibility to do so.” ― Steven Magee"},{"quote":"“Death offers freedoms that do not exist in modern corporate societies.” ― Steven Magee"},{"quote":"“Observe the people and you will notice many abnormal personalities in modern corporate controlled society.” ― Steven Magee"},{"quote":"“Intolerance to gluten has been understood for thousands of years and one can only wonder why the average time from first symptoms to diagnosis takes a decade in modern corporate medicine.” ― Steven Magee"},{"quote":"“Hitlers crimes against humanity pale into insignificance when compared to those being committed by modern corporate controlled governments.” ― Steven Magee"},{"quote":"“In the space of several decades the modern human has demolished millions of years of evolution.” ― Steven Magee"},{"quote":"“We live in truly unbelievable times.” ― Steven Magee"},{"quote":"“I was truly shocked to discover how bad the modern medical profession really is!” ― Steven Magee"},{"quote":"“When the patient is a better doctor than the doctors, you know that there is something funky going on in modern healthcare.” ― Steven Magee"},{"quote":"“The modern world is insanity disguised as progress.” ― Steven Magee"},{"quote":"“Master radiation and you will be able to master modern human illnesses and diseases.” ― Steven Magee"},{"quote":"“I do regard modern universities to be biologically toxic environments for healthy students.” ― Steven Magee"},{"quote":"“All the subjects are becoming more modern day by day. Similarly, love means was to sacrifice yourself for beloved, but modern love means sex and to go ahead to the next.” ― Ehsan Sehgal"},{"quote":"“Modern architecture may be one of the most dangerous things you are exposed to on a daily basis.” ― Steven Magee"},{"quote":"“COVID-19 is the modern version of the Spanish Flu.” ― Steven Magee"},{"quote":"“Charles Kahn offers the following summary of how a new metaphysics takes shape in Islamic philosophy:'My general view of the historical development is that existence in the modern sense becomes a central concept in philosophy only in the period when Greek ontology is radically revised in the light of a metaphysics of creation; that is to say, under the influence of biblical religion. As far as I can see, this development did not take place with Augustine or with the Greek Church Fathers, who remained under the sway of classical ontology. The new metaphysics seems to have taken shape in Islamic philosophy, in the form of a radical distinction between necessary and contingent existence: between the existence of God on the one hand, and that of the created world on the other.'The new metaphysics that takes shape in Islamic philosophy proves fateful for subsequent philosophy in various ways. What will interest us immediately below is how it plays a role in triggering a debate about how to conceive divine creation. What will be of implicit interest later in these replies is how a remarkably unvarnished version of this new metaphysics comes to be detached from its original theological context. The ensuing detheologized modal metaphysics remains in force in some quarters of analytic philosophy, even though it takes its point of departure from a topic (how to understand the act of divine creation) that is no longer of much interest to most analytic philosophers. For the new metaphysics introduces concepts and ways of thinking that, once divested of their theological garb, continually resurface in the history of philosophy up to the present day.” ― James Conant, The Logical Alien: Conant and His Critics"},{"quote":"“George Floyd is a modern version of Jesus, a common man whose murder by the government sparked a global movement for a better world.” ― Steven Magee"},{"quote":"“The last plague before COVID-19 occurred over a century ago when there was little man-made wireless radiation, no man-made satellites or widespread electrification of homes and it lasted two years. Factoring in the environmental exposures from modern technologies, this pandemic may last much longer.” ― Steven Magee"},{"quote":"“The Hollow man makes most noise ofIgnorance than wisdom;Oh, the modern man!” ― Ujjal Mandal"},{"quote":"“We see meaningful connections between often-archaic texts and our students' very modern lives; our mission is to make these connections clear without boring our students into inattention or complacency. When discussing historical injustice, this personal engagement becomes even more important: As many students as possible must recognize the thread between yesterday's crimes and the world they currently inhabit.” ― Matthew R. Kay, Not Light, but Fire: How to Lead Meaningful Race Conversations in the Classroom"},{"quote":"“It is unfortunate that the modern healthcare system has devolved into a mass production line of sickened people attending very short appointments with overworked doctors that are delivering substandard care that is influenced by drug companies.” ― Steven Magee"},{"quote":"“The Qur’ān has not merely been revealed in Arabic: it has been revealed in eloquent Arabic. The language is clear and cogent, and there is no vagueness in it; every word is unambiguous and every style adopted is well known to its addressees. The Qur’ān says:The faithful Spirit has brought it down into your heart [O Prophet] that you may become a warner [for people] in eloquent Arabic. (26:193-195)In the form of an Arabic Qur’ān, free from any ambiguity that they may save themselves [from punishment]. (39:28)This is an obvious reality about the Qur’ān. If this premise is accepted, then it must be conceded that no word used or style adopted by the Qur’ān is rare or unknown (shādh). Its words and styles are well known and conventionally understood by its addressees. No aspect of the language has any peculiarity or rarity in it.” ― Javed Ahmad Ghamidi, Meezan"},{"quote":"“Suicide cures all known personal problems.” ― Steven Magee"},{"quote":"“Modern corporate governments have silently declared war on their mass populations biology.” ― Steven Magee"},{"quote":"“Smart people avoid living in ‘Smart’ homes.” ― Steven Magee"},{"quote":"“Convenient ignorance is a common problem in the modern workplace.” ― Steven Magee"},{"quote":"“We don’t know if the mythologies are fact or fiction or mix of the two. But as far as people have faith in them, they shape their values. When people lose faith in scriptures and mythologies, they easily fall prey to the fictions of the modern times, which propagate infidelity, pleasure seeking and materialism.” ― Awdhesh Singh, Myths are Real, Reality is a Myth"},{"quote":"“It is well established that gaining weight around the belly is a sign of underlying sickness in many cases.” ― Steven Magee"},{"quote":"“Daily abnormal environmental radiation exposures are the hallmark of the modern human.” ― Steven Magee"},{"quote":"“I call modern large screen televisions “Insomnia TV’s” because they are known to disrupt sleep.” ― Steven Magee"},{"quote":"“I call modern electronic light bulbs ‘Insomnia light bulbs’ because they are known to disrupt sleep.” ― Steven Magee"},{"quote":"“A corrupt corporate government employs blatantly corrupt scientists.” ― Steven Magee"},{"quote":"“The rapidly collapsing global environment will take modern society with it.” ― Steven Magee"},{"quote":"“Whether you live or die in modern society largely comes down to how you understand environmental radiation, digestive disorders and antioxidant supplementation.” ― Steven Magee"},{"quote":"“Technology has allowed the human race to proliferate far beyond anyone’s dreams in just a few hundred years. But, paradoxically, it has the potential to make that extra life miserable, even to the point of death.” ― J.S.B. Morse, Paleo Family: Raising Natural Kids in an Unnatural World"},{"quote":"“Every subject was, and is, and will be modern, in its time. The term modern does not mean the objects, but it means, the way of your thoughts, is best than it was.” ― Ehsan Sehgal"},{"quote":"“The modern and contemporary attire and terminology for the backbiting is a transmission that, people watch and view on Television Channels every day as the news.” ― Ehsan Sehgal"},{"quote":"“Maybe, you will kiss the modern brideLet's agree to disagree, babeon everything, in advanceJust duct tape my heart to yours babe” ― Casey Renee Kiser, Spit Me Out"},{"quote":"“If anything already exists; you polished and repaired or reshaped, it means you just improved that. What didn't exist, you created and designed; it's called modern elements. Don't label all things modern that already existed.” ― Ehsan Sehgal"},{"quote":"“Beware war, famine, plague ... and a life that is too comfortable.” ― Hunter Post"},{"quote":"“To the modern detective, truth is rarely its own reward; usually it is its own punishment. And if you cannot track mystery to the back of its ugly cave, then be content to stand at the edge of the dark and call it by name.” ― Jedediah Berry, The Manual of Detection"},{"quote":"“Most people in the modern world are making their lives miserable not because they have no food, but because they eat excessively. The same goes for wealth. We must know how much wealth is needed to live a decent life and be happy.” ― Awdhesh Singh, 31 Ways to Happiness"},{"quote":"“In the modern, networked and symbiotic world we live in, people management is less about squeezing performance from the organized few and more about curating contribution from the limitless many.” ― Gyan Nagpal, The Future Ready Organization: How Dynamic Capability Management Is Reshaping the Modern Workplace"},{"quote":"“The biologically toxic electromagnetic cover up is one of the most destructive actions that modern governments are engaging in.” ― Steven Magee"},{"quote":"“Hello suicide, goodbye problems.” ― Steven Magee"},{"quote":"“Suicide fixes every health issue known to humanity.” ― Steven Magee"},{"quote":"“Modern corporate controlled governments have a really bad dose of toxic bureaucrats.” ― Steven Magee"},{"quote":"“The modern human has two options: Understand and treat environmental illness, or live life in a sickened state and die prematurely from environmental disease.” ― Steven Magee"},{"quote":"“Walking around in very high powered electromagnetic fields produced by cell phone towers and satellites is probably the most unnatural thing that the modern human engages in.” ― Steven Magee"},{"quote":"“One of the things about researching climate change and global warming is that you eventually come to the conclusion that nature will fix everything after starvation, illness and disease causes the collapse of modern society.” ― Steven Magee"},{"quote":"“I view the modern workplace as somewhere that you go to have your long term health severely damaged.” ― Steven Magee"},{"quote":"“In the information age, man and spider both live in a web.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Ancient aphorisms outlived centuries. Modern aphorisms can barеly survive from book to book.” ― Ljupka Cvetanova, The New Land"},{"quote":"“In modern society, it is not enough to be an engineer, a doctor, a chemist, a biologist, or a physicist, you must be all of them to understand why human health is failing on such a massive scale.” ― Steven Magee"},{"quote":"“Besides, it is only the modern that ever becomes old-fashioned.” ― Oscar Wilde, Beautiful and Impossible Things - Selected Essays of Oscar Wilde"},{"quote":"“What if Theater was the Pong of the the digital Ping?A place where the live experience has an function?” ― Natasha Tsakos"},{"quote":"“Science is theology for an atheist” ― Munia Khan"},{"quote":"“Modern society is a biological disaster masquerading as progress.” ― Steven Magee"},{"quote":"“Science has given us the truth but taken away our tranquillity.” ― Amit Kalantri, Wealth of Words"},{"quote":"“We are damaging the world more with our mobiles than our forefathers did with their musket.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Our faith is often embodied in the relationships and neighborhoods where we live. In our world of globalization, technology, and mobility, we've misplaced the sacredness of place.The act of staying and living in our place has an impact on us practically, of course, but also on us theologically. It's not always sexy to stay put, is it? In most of my church tradition, no one ever mentioned the holy work of staying.” ― Sarah Bessey, Out of Sorts: Making Peace with an Evolving Faith"},{"quote":"“Modern corporate controlled governments are in the business of covering things up.” ― Steven Magee"},{"quote":"“Too sick to work and not sick enough to die is common in modern society.” ― Steven Magee"},{"quote":"“Modern architecture has the potential to send you to an early grave.” ― Steven Magee"},{"quote":"“The Nazi's were the era of crimes against the Jews and modern corporate governments are the era of silent crimes against humanity.” ― Steven Magee"},{"quote":"“Those who like to interpret historical facts symbolically may recognize in this the spirit of a specifically \"modern\" conception of the world which permits the subject to assert itself against the object as something independent and equal; whereas classical antiquity did not as yet permit the explicit formulation of this contrast; and whereas the Middle Ages believed the subject as well as the object to be submerged in a higher unity.” ― Erwin Panofsky, Meaning in the Visual Arts"},{"quote":"“We have to believe in us. We're the miracle of modern and changing times. Share your talents and gift, inspire others and be inspired” ― Val Uchendu"},{"quote":"“Understanding why so many western women are giving birth to unnaturally large babies that either damage the birth canal or will not fit down it is one of the greatest challenges to modern medicine.” ― Steven Magee"},{"quote":"“The modern world is filled with failed relationships.” ― Steven Magee"},{"quote":"“Modernity is kind of a tradition and tradition itself is not a rulebook. It's a dialogue and a dialectical process— just as tradition affects us, we too affect tradition and culture, and we change it.” ― Sharanya Haridas"},{"quote":"“Civilization’ is just a word! There is a touch of indirect ‘racism’ in it. It unjustly means that the primitive people were ‘uncivilized’, ‘bad’, ‘brutal’, ‘barbaric’ etc. Being primitive was as civilized as being modern is! The ancient ‘time’ was THE civilization-moment for the people then as the present time is for us now! As we should not hate other cultures, similarly we should not hate the ancient civilization. Most importantly, we would never exist if those so-called primitive people were not here on earth!” ― Md. Ziaul Haque"},{"quote":"“The information age is converting a human from loving to logical and replacing his peace with the pain.” ― Amit Kalantri, Wealth of Words"},{"quote":"“I view the modern workplace as somewhere you go to have your long term health severely damaged.” ― Steven Magee"},{"quote":"“At the same time that we see a massive deployment of wireless radiation, we see the most violent attacks on modern society.” ― Steven Magee"},{"quote":"“It is not surprising that two of the most notorious modern mass murderers in the USA and Europe were both high altitude pilots.” ― Steven Magee"},{"quote":"“Modern governments have the pernicious problem of trying to reward too many corporate donors.” ― Steven Magee"},{"quote":"“I love old things. Modern things are so cold. I need things that have lived.” ― Barbara Hulanicki"},{"quote":"“Time's up for modern society.” ― Steven Magee"},{"quote":"“There was an off-planet directory next to an old rotary phone that looked lost, as if it had wandered in the room and was actually looking for a more modern facility.” ― Mandy Ashcraft, Small Orange Fruit"},{"quote":"“I have every expectation that if switched mode power supplies, radioactive household smoke detectors, radio frequency (RF) transmitters and satellites were banned, Autism would recede into a very rare disease.” ― Steven Magee"},{"quote":"“Hitting \"like\" on a social media platform is the modern day version of clapping at the end of a performance.” ― J.R. Rim"},{"quote":"“When I was a student, there wasn't a single thing we did that was unrelated to others. It was all for the Emperor, or parents, or the country, or society—everything was other-centered, which means that all educated men were hypocrites. When society changed, this hypocrisy ceased to work, and as a result, self-centeredness was gradually imported into thought and action, and egoism became enormously over-developed. Instead of the old hypocrites, now all we've got are out-and-out rogues. Do you see what I mean by that?” ― Natsume Sōseki, Sanshirō"},{"quote":"“I thought of the fate of Descartes’ famous formulation: man as ‘master and proprietor of nature.’ Having brought off miracles in science and technology, this ‘master and proprietor’ is suddenly realizing that he owns nothing and is master neither of nature (it is vanishing, little by little, from the planet), nor of History (it has escaped him), nor of himself (he is led by the irrational forces of his soul). But if God is gone and man is no longer master, then who is master? The planet is moving through the void without any master. There it is, the unbearable lightness of being.” ― Milan Kundera, The Art of the Novel"},{"quote":"“In the presence of Esch, values have hidden their faces. Order, loyalty, sacrifice—he cherishes all these words, but exactly what do they represent? Sacrifice for what? Demand what sort of order? He doesn't know.If a value has lost its concrete content, what is left of it? A mere empty form; an imperative that goes unheeded and, all the more furious, demands to be heard and obeyed. The less Esch knows what he wants, the more furiously he wants it. Esch: the fanaticism of the era with no God. Because all values have hidden their faces, anything can be considered a value. Justice, order—Esch seeks them now in the trade union struggle, then in religion; today in police power, tomorrow in the mirage of America, where he dreams of emigrating. He could be a terrorist or a repentant terrorist turning in his comrades, or a party militant or a cult member a kamikaze prepared to sacrifice his life. All the passions rampaging through the bloody history of our time are taken up, unmasked, and terrifyingly displayed in Esch's modest adventure.” ― Milan Kundera, The Art of the Novel"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“Di negara Jancukers. Allahu Akbar nilainya tinggi, yaitu untuk mengusir penjajah Belanda dulu dan untuk mengusir Jepang. Tidak seperti di negara tetangga, Allahu Akbar dipakai untuk melawan orang makan di warung Tegal.” ― Sujiwo Tejo"},{"quote":"“The top easily preventable health problems that I see in western societies are: 1. Eating chemically grown food. 2. Exposure to electronically generated harmonic energy from wind and solar power systems. 3. Exposure to harmonic energy from switched mode power supplies (SMPS) that come with modern electronic products. 4. Exposure to wireless radio frequency radiation (RF). 5. Light deficiency from an indoor lifestyle and Low-E double glazed windows. 6. Sound deficiency from heavily insulated homes that are devoid of natural sounds and are extremely quiet. 7. Pollen deficiency from living in man-made cities that are devoid of natural levels of pollen. 8. Natural radiation deficiency from living in homes that block natural levels of environmental radiation. 9. Open drain sickness that occurs when drain traps dry out and faulty vent valves that allow sewer gas to fill the home. 10. Drinking the wrong type of water.” ― Steven Magee"},{"quote":"“Modernity invented the future, but that’s all over. In the current version ‘progressive history’ camouflages phylogenetic death-drive tactics, Kali-wave: logistically accelerating condensation of virtual species extinction. Welcome to the matricide laboratory. You want it so badly it’s a slow scream in your head, deleting itself into bliss.” ― Nick Land, Fanged Noumena: Collected Writings, 1987-2007"},{"quote":"“The modern human lives in a cesspool of man-made electromagnetic radiation.” ― Steven Magee"},{"quote":"“Hirota feels strongly drawn toward nature and the natural, is hyper-sensitive to the artificial—particularly that most cramped and constraining man-made creation, society—and does his best to avoid it.” ― Natsume Sōseki, Sanshirō"},{"quote":"“There are many places you need to be, but there is nowhere to reach. There are many people you need to see but no one to meet. And there are many contacts in your phone but no one to talk. There are many masks in your closet but no face to please.” ― Jasz Gill"},{"quote":"“Democracy is the process to elect government of the upper-class people, by the poor people and for the corporate people.” ― Nilesh (Neil) jain"},{"quote":"“Enjoy without injury, live without loss.” ― Amit Kalantri"},{"quote":"“Modern human evolution has reached the point of reporting corruption to the corrupt.” ― Steven Magee"},{"quote":"“Contemporary architects tend to impose modernity on something. There is a certain concern for history but it’s not very deep. I understand that time has changed, we have evolved. But I don’t want to forget the beginning. A lasting architecture has to have roots.” ― I. M. Pei"},{"quote":"“[Technology] has taught us how to become gods before we have learned to be men.” ― Herbert Joseph Muller, The Children of Frankenstein: A Primer on Modern Technology and Human Values"},{"quote":"“A modern woman sees a piece of linen, but the mediaeval woman saw through it to the flax fields, she smelt the reek of the retting ponds, she felt the hard rasp of the hackling, and she saw the soft sheen of the glossy flax. Man did not see 'just leather', he saw the beast - perhaps one of his own - and knew the effort of slaughtering, liming and curing.Communities were smaller and whether our man lived on the outskirts of some feudal system, had escaped from it, or was entirely isolated, he would work alone, or daily with the same fellow-workers - conversation would soon languish.But THINK he must.” ― Dorothy Hartley, Land of England: English Country Customs Through the Ages"},{"quote":"“I look up to the modern entrepreneurs, because the one’s from the old age, many are racist, even if no one knows about that part of their lives, but I am not so ignorant that I will not learn from their work to better my life.” ― James Jean-Pierre"},{"quote":"“While the ethnic paganisms have important things to teach us concerning the necessity of cultural authenticity, at their worst they become purist ghettos of nostalgia-driven re-enactors. We must never forget our Received Tradition or fail to learn from it; without it, we have no solid basis by which to evaluate our own experience. But ultimately the ways of our ancestors cannot teach us what we most need to know: how to be honestly pagan for our own time and place. That understand-ing can come only from our own encounter with the very sources that inspired these ethnic traditions in the first place. We must drink from the original wellspring itself.\" - Steven Posch, \"Lost Gods of the Witches: A User’s Guide to Post-Ragnarok Paganism” ― John Halstead, Godless Paganism: Voices of Non-Theistic Pagans"},{"quote":"“In modern time slowness is new sickness.” ― Amit Kalantri"},{"quote":"“On the whole the modern world has been conditioned to have a chip on its shoulder against devoutly religious people. I disagree with this in some instances - particularly in, believe it or not, matters of integrity. Deep down I often rather believe the man who honestly thinks - or better yet even, prefers - that he has an omnipotent Judge breathing down his neck, holding his every word and his every move accountable, than the man who much like his modern peers, and ironically enough, claims or wishes to bask in complete independence. As it appears actually, the former is more free of guilt than the latter.” ― Criss Jami, Healology"},{"quote":"“We strolled to the end of the platform. We came to a man with a signal lamp and I saw that as he passed us he looked at a conductor standing on another platform and made a drinking movement with his hand near his mouth. We stopped past the end of the roof and looked at the sun. \"You see the sun, Koekebakker?\" The sun was especially clear, right in front of us, close by, bigger and redder than I had ever seen it. It almost touched the rails, it didn't flash brightly on things anymore, there was a dull glow only on the frosted windowpanes of the train shed to the right of the track. \"You think I'm drunk?\" I did indeed. \"It doesn't matter, Koekebakker, when I'm sober I don't understand anything anyway.\"\"Do you understand what the sun wants from me? I have thirty-four setting suns leaning against the wall, one on top of the other, all facing the wall. But every evening it's there again.\"\"Unless it's cloudy,\" I said. But he wouldn't let himself be distracted.\"Koekebakker, you've always been my best friend. I've known you since--how long has it been?\"\"Thirteen years. That's a long time. You know what you need to do? Do me a favor. You have a hatbox?\"I didn't say anything.\"Put it in a hatbox, Koekebakker. In a hatbox. I want to be left alone. Put it in a hatbox, a plain old hatbox. That's all it's worth.\"Bavinck blubbered drunkard's tears. I looked around helplessly. A man in a uniform with a yellow stripe on his cap came up to us and spoke to me.\"I think it would be better, sir, if you took the gentleman home.” ― Nescio, Titaantjes"},{"quote":"“The human has no genetic adaptation to modern industrialized products and needs to be careful with prolonged exposure to these for good health.” ― Steven Magee"},{"quote":"“The modern human has mastered the art of building toxic homes and cities.” ― Steven Magee"},{"quote":"“When James Wan is out there the horror is real, no doubt about that Check out for own proof if you have guts Sinister 1,2... Insidious 1,2...” ― Deyth Banger"},{"quote":"“People feeling the need to live inside of Faraday cages is a sad reflection on modern society that humans are devolving into living inside of safe spaces.” ― Steven Magee"},{"quote":"“As a sea level adapted human, I am more fearful about the radiation levels on top of high altitude mountains, mile high modern cities and inside jet aircraft than from nuclear reactors and bombs, as that is where I get the most radiation exposures in the modern world.” ― Steven Magee"},{"quote":"“Modern architecture predominately specializes in designing what are essentially dimly lit caves.” ― Steven Magee"},{"quote":"“Bir ülkede modern değerler ve modern insanlar saldırı altındaysa, o ülkede karanlık bir gelecekten emin olabiliriz!” ― Mehmet Murat ildan"},{"quote":"“Flying in a modern jet airplane doses the human with levels of radiation comparable to those found in nuclear disaster zones.” ― Steven Magee"},{"quote":"“I think that modern medicine has become like a prophet offering a life free of pain. It is nonsense. The only thing I know that truly heals people is unconditional love.” ― Elisabeth Kübler-Ross"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“If you wish to break with tradition, learn your craft well, and embrace adversity” ― Soke behzad Ahmadi"},{"quote":"“People always knock what's new but I love the modern Internet, where cleverness is currency. Social media is a cleverness meritocracy. We're living in it.” ― Alexei Maxim Russell"},{"quote":"“To be healthy in modern society, you must adopt the behaviors of an astronaut!” ― Steven Magee, Health Forensics"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“Recent generations seem to consider ‘old-fashioned’ thinking as out-dated and without place in the modern world. I beg to differ. After all, who has greater faith? He who looks to and learns from the past, or the man who cares not for consequence?” ― Fennel Hudson, A Meaningful Life - Fennel's Journal - No. 1"},{"quote":"“Unfortunately, you are far more likely to be harmed or die prematurely as a direct result of modern society than you are from any form of terrorism.” ― Steven Magee, Curing Electromagnetic Hypersensitivity"},{"quote":"“If your expenditure brings you poverty, then you may call yourself a poor but the world will call you a fool.” ― Amit Kalantri"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“In India there’s no modernism without barbarism. Strip away the young man’s face and you’ll find an old man’s mind.” ― Meghna Pant, One and a Half Wife"},{"quote":"“The truth is that a nineteenth-century warehouse exhibits greater craft in its construction than all but the most expensive modern buildings.” ― Witold Rybczynski"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“Saving time is one of the great superpowers you can unlock in the modern era.” ― J.R. Rim"},{"quote":"“With approximately 50% of the USA population on prescription drugs and 10% on anti-depressants, it is clear that things are going seriously wrong with human health in the modern world.” ― Steven Magee, Health Forensics"},{"quote":"“Every Nigerian must begin to raise their voice against our societal failures and call them as such at every juncture. In this way we could all bring about a modern, progressive and civilized society.” ― Sunday Adelaja"},{"quote":"“Modern society - everyone thinks getting cancer is a normal aspect of life.” ― Steven Magee, Toxic Health"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"},{"quote":"“The story of Sodom is God's reminder to the modern world.” ― Sunday Adelaja"},{"quote":"“The most polluted animal on the planet today is the modern human.” ― Steven Magee, Health Forensics"},{"quote":"“There is no limit on the level that the reflections can be at and in a modern environment, such as a city, the albedo can increase the power levels many times of the sky based solar radiation of direct and diffuse combined. The trees prevent the albedo reflections from occurring.” ― Steven Magee, Solar Radiation, Global Warming and Human Disease"},{"quote":"“The most frustrating thing about our doctrine in the modern church is that the unbelievers who have never been to church, the agnostics, those who are out rightly atheist, don’t have to fight with whether they are supposed to dominate the earth or not, they just go ahead and do it” ― Sunday Adelaja"},{"quote":"“It appears that the paradigm of the modern Church has mainly been based on some fragments of the truth rather than the comprehensive totality of understanding God and His Kingdom” ― Sunday Adelaja"},{"quote":"“If the teachings of the Protestants in Europe gave birth to the Protestant ethics and the modern civilization, it becomes alarming that most of our charismatic teachings today mainly concentrate on individual aggrandizement” ― Sunday Adelaja"},{"quote":"“We are not even going to throw the challenge of changing a whole generation before the modern day church. This generation of believers don’t even know what that means” ― Sunday Adelaja"},{"quote":"“The classical man's worst fear was inglorious death; the modern man's worst fear is just death” ― Nassim Nicholas Taleb, The Bed of Procrustes: Philosophical and Practical Aphorisms"},{"quote":"“The grandeur of the Institute never failed to impress Magnus - the way it towered high and mighty above everything else, timeless and unmoving in its Gothic disapproval of all that was modern and changeable.” ― Cassandra Clare, The Rise of the Hotel Dumort"},{"quote":"“As I, my real self, grew older, I entered more and more into the substance of my dreams. One may dream, and even in the midst of the dream be aware that he is dreaming, and if the dream be bad, comfort himself with the thought that it is only a dream. This is a common experience with all of us. And so it was that I, the modern, often entered into my dreaming, and in the consequent strange dual personality was both actor and spectator. And right often have I, the modern, been perturbed and vexed by the foolishness, illogic, obtuseness, and general all-round stupendous stupidity of myself, the primitive.” ― Jack London"},{"quote":"“I chase goals, not girls.” ― Amit Kalantri"},{"quote":"“The huge modern heresy is to alter the human soul to fit modern social conditions, instead of altering modern social conditions to fit the human soul.” ― G.K. Chesterton"},{"quote":"“Evangelical Christians need to notice..., that the Reformation said 'Scripture Alone' and not 'the Revelation of God in Christ Alone'. If you do not have the view of the Scriptures that the Reformers had, you really have no content in the word 'Christ' - and this is the modern drift in theology. Modern theology uses the word without content because 'Christ' is cut away from the Scriptures. The Reformation followed the teaching of Christ Himself in linking the revelation Christ gave of God to the revelation of the written Scriptures.” ― Francis A. Schaeffer, Escape from Reason"},{"quote":"“On the first day of a college you will worry about how will you do inside the college? and at the last day of a college you will wonder what will you do outside the college?” ― Amit Kalantri"},{"quote":"“Eiffel Tower\" To Robert DelaunayEiffel Tower Guitar of the skyYour wireless telegraphy Attracts words As a rosebush the beesDuring the night The Seine no longer flowsTelescope or bugleEIFFEL TOWERAnd it's a hive of words Or an inkwell of honeyAt the bottom of dawn A spider with barbed-wire legs Was making its web of cloudsMy little boy To climb the Eiffel Tower You climb on a songDo re mi fa sol la ti do We are up on top A bird sings in the telegraph antennae It's the wind Of Europe The electric windOver there The hats fly away They have wings but they don't sing Jacqueline Daughter of France What do you see up there The Seine is asleep Under the shadow of its bridges I see the Earth turning And I blow my bugleToward all the seasOn the path Of your perfume All the bees and the words go their wayOn the four horizons Who has not heard this song I AM THE QUEEN OF THE DAWN OF THE POLES I AM THE COMPASS THE ROSE OF THE WINDS THAT FADESEVERY FALLAND ALL FULL OF SNOW I DIE FROM THE DEATH OF THAT ROSE IN MY HEAD A BIRD SINGS ALL YEAR LONGThat's the way the Tower spoke to me one dayEiffel Tower Aviary of the world Sing SingChimes of ParisThe giant hanging in the midst of the void Is the poster of FranceThe day of Victory You will tell it to the stars” ― Vicente Huidobro, The Cubist Poets in Paris: An Anthology"},{"quote":"“Moderate giftedness has been made worthless by the printing press and radio and television and satellites and all that. A moderately gifted person who would have been a community treasure a thousand years ago has to give up, has to go into some other line of work, since modern communications put him or her into daily competition with nothing but the world's champions.” ― Kurt Vonnegut"},{"quote":"“Langdon quickly explained how most people pictured satanic cults as devil-worshiping fiends, and yet Satanists historically were educated men who stood as adversaries to the church. Shaitan. The rumors of satanic black-magic animal sacrifices and the pentagram ritual were nothing but lies spread by the church as a smear campaign against their adversaries. Over time, opponents of the church,wanting to emulate the Illuminati, began believing the lies and acting them out. Thus, modern Satanism was born.” ― Dan Brown, Angels & Demons"},{"quote":"“Mr Hemingway does it extremely well. Nothing matters. Everything happens. One wants to keep oneself loose. Avoid one thing only: gettng connected up. Don't get connected up. If you get held by anything, break it. Don't be held. Break it, and get away. Don't get away with the idea of getting somewhere else. Just get away, for the sake of getting away. Beat it! “Well, boy, I guess I'll beat it.” Ah, the pleasure in saying that” ― D.H. Lawrence"},{"quote":"“sometimes I hearscreaming like a childand wake upto find it’s me” ― Stephen Fitzsimons, Screaming In A Vacuum Jar"},{"quote":"“The lively oral storytelling scene in Scots and Gaelic spills over into the majority English-speaking culture, imbuing it with a strong sense of narrative drive that is essential to the modern novel, screenplay and even non-fiction.” ― Sara Sheridan"},{"quote":"“Every new generation believes its own period to be absolutely superior intellectually - greater than all past cultures yet equal among its modern cultures.” ― Criss Jami, Healology"},{"quote":"“Search engines finds the information, not necessarily the truth.” ― Amit Kalantri"},{"quote":"“I don't question our existence. I just question our modern needs.” ― Pearl Jam"},{"quote":"“Modern Christianity, in dramatic reversal of its biblical form, promises to relieve the pain of living in a fallen world. Then message, whether it’s from fundamentalists requiring us to live by a favored set of rules or from charismatics urging a deeper surrender to the Spirit’s power, is too often the same: The promise of bliss is for now! Complete satisfaction can be ours this side of heaven. Some speak of the joys of fellowship and obedience, others of a rich awareness of their value and worth. The language may be reassuringly biblical or it may reflect the influence of current psychological thought. Either way, the point of living the Christian life has shifted from knowing and serving Christ till He returns to soothing, or at least learning to ignore, the ache in our soul.” ― Larry Crabb"},{"quote":"“Give as much as importance to your goal as you give it to your first girlfriend, with that much importance your girlfriend might still leave you but your goal will definitely come to you.” ― Amit Kalantri"},{"quote":"“Horse [Man you will find here a new representation of the universe at its most poetic and most modern Man man man man man man Give yourself up to this art where the sublime does not exclude charm and brilliancy does not blur the nuance it is now or never the moment to be sensitive to poetry for it dominates all dreadfully Guillaume Apollinaire]” ― Guillaume Apollinaire, Calligrammes: Poems of Peace and War"},{"quote":"“This is what made the difference, they used social networking for entertainment and I used it for business.” ― Amit Kalantri"},{"quote":"“Let us make sure that future generation writes our biography.” ― Amit Kalantri"},{"quote":"“Wrangling about precisely what constitutes genuine philosophy, proper philosophical practice, method, and aims is an important part of modern philosophy’s content and heritage” ― Gregory B. Sadler"},{"quote":"“Don't compete with your friends to win a date with few beautiful girls, but compete to win few beautiful goals.” ― Amit Kalantri"},{"quote":"“The modern research laboratory can be a large and complicated social organism.” ― J. Michael Bishop, How to Win the Nobel Prize: An Unexpected Life in Science"},{"quote":"“When the experts’ scientific knowledge is legitimated in terms of being rational, logical, efficient, educated, progressive, modern, and enlightened, what analogies can other segments of society . . . utilize to challenge them?” ― Martin Guevara Urbina"},{"quote":"“In the modern Christian attempt to take a stand as Christ did, and maybe for others, win the approval of the world, the Christian will often think that it consists of targeting and demoralizing fellow Christians and only fellow Christians. It is one thing to stand against religious hypocrisy when one sees it, but it is another to go on snorting at anything or anyone who might seem 'too Christian' to us. The irony is that by doing this we are further advocating hypocrisy and 'half-hearted Christians'.” ― Criss Jami, Killosophy"},{"quote":"“Now having travelled from the pride of man in the High Renaissance and the Enlightenment down to the present despair, we can understand where modern people are. They have no place for a personal God. But equally they have no place for man as man, or for love, or for freedom, or for significance. This brings a crucial problem. Beginning only from man himself, people affirm that man is only a machine. But those who hold this position cannot live like machines! If they could, there would be no tensions in their intellectual position or in their lives. But even people who believe they are machines cannot live like machines, and thus they must “leap upstairs” against their reason and try to find something which gives meaning to life, even though to do so they have to deny their reason.This was a solution Leonardo da Vinci and the men of the Renaissance never would have accepted, even if, like Leonardo they ended their thinking in despondency. They would not have done so, for they would have considered it intellectual suicide to separate meaning and values from reason this way. And they would have been right. Such a solution is intellectual suicide, and one may question the intellectual integrity of those who accept such a position when their starting point was pride in the sufficiency of human reason.” ― Francis A. Schaeffer"},{"quote":"“The Dark Ages gradually ended six centuries ago with the Renaissance, which seeded new ideas for a different world. The Renaissance ideal dominated our culture until three centuries ago, from the 14th to the 18th century, when it was superseded by modernism. Not surprisingly, this human ideal has almost been forgotten in our culture. The Renaissance, literally \"re-birth\", was a revival and rediscovery of classical Greek and Roman culture following the decline of culture, trade, and technology during the Dark Ages.” ― Jacob Lund Fisker"},{"quote":"“Miracles are commonplace in religious scripture. Our ancient ancestors are said to have felt Jesus' wounds, verified Muhammad's ascent to heaven, and even interacted with their respective deities directly. Today, believers have no such luxury. They are forced to rely on blind faith that these things occurred, that people were at one time able to overcome or render inert natural laws.” ― David G. McAfee"},{"quote":"“A modern culture built on the back of dying gods immerses me.” ― Thomm Quackenbush, Pagan Standard Times: Essays on the Craft"},{"quote":"“It shows a mediocre architect at the top of his game [on the Beetham Tower in Manchester]” ― Owen Hatherley, A Guide to the New Ruins of Great Britain"}]
