[{"quote":"“It's a funny thing about life, once you begin to take note of the things you are grateful for, you begin to lose sight of the things that you lack.” ― Germany Kent"},{"quote":"“Your smile is your logo, your personality is your business card, how you leave others feeling after having an experience with you becomes your trademark.” ― Jay Danzie"},{"quote":"“How to win in life:1 work hard 2 complain less 3 listen more 4 try, learn, grow5 don't let people tell you it cant be done6 make no excuses” ― Germany Kent"},{"quote":"“Today is the only day in which we have any power.” ― Steve Maraboli, Life, the Truth, and Being Free"},{"quote":"“Kindness is universal. Sometimes being kind allows others to see the goodness in humanity through you. Always be kinder than necessary.” ― Germany Kent"},{"quote":"“Independent will is our capacity to act. It gives us the power to transcend our paradigms, to swim upstream, to rewrite our scripts, to act based on principle rather than reacting based on emotion or circumstance.” ― Stephen R. Covey"},{"quote":"“You can succeed at almost anything for which you have unbridled enthusiasm.” ― Zig Ziglar"},{"quote":"“Take time daily to reflect on how much you have. It may not be all that you want but remember someone somewhere is dreaming to have what you have.” ― Germany Kent"},{"quote":"“No matter how dysfunctional your background, how broke or broken you are, where you are today, or what anyone else says, YOU MATTER, and your life matters!” ― Germany Kent"},{"quote":"“The only way you're going to reach places you've never gone is if you trust God's direction to do things you've never done.” ― Germany Kent"},{"quote":"“I dont write books so that you can be fascinated with me. I write them so you can be fascinated with YOU!” ― Steve Maraboli, Unapologetically You: Reflections on Life and the Human Experience"},{"quote":"“Be polite in your speeches. Good information rudely communicated will make no positive difference.” ― Israelmore Ayivor, Mine Your Gold: How to dig up and optimize your hidden greatness"},{"quote":"“Don't be in a hurry to achieve your dreams. Take a day to play with your kids and relax - your dreams will still be there tomorrow.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Do not come into agreement with fear. Activate your faith, live in victory, speak over your life and expect great things to come your way.” ― Germany Kent"},{"quote":"“Failure only happens when you lose your willpower to continue trying...If we let the obstacles get the best of us then it was our choice to fail, not fate.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Winners dont do different things They do things differently” ― Shiv Kera"},{"quote":"“The truth no matter how hard it is to bear, must be accepted and confronted head on because it is real. Businesses and people who accept truth soar.” ― Germany Kent"},{"quote":"“Not everyone is always going to like you. What impresses one person may turn another away. To thine own self be true.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“The first thing others see is YOU—not your resume, background, or credentials. A picture is truly worth a thousand words and how you dress is the “picture” you provide for all the world to see.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Embrace change and practice flexibility. It will make you more agile in adapting to new people and situations.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Why leave your success up to dumb luck or accident when you can take a stand, make a plan, and be proactive in your pursuits and possibilities?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Whether you're delivering a sales presentation to a new client, going on a trip, speaking in front of a thousand people, or handling a customer complaint, when you are prepared, you are more empowered to do your best and perform at a higher level. It feels great!” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Without proper readiness, we’re subject to a 'flub,' or a costly mistake which might have been easily prevented with some simple homework beforehand. Failing to do so deteriorates credibility and reputation, leaving us vulnerable to an unfavorable impression.” ― Susan C. Young"},{"quote":"“Knowledge imparts a sense of authority. It will help you stand out and give you an edge over your competition.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“By performing a simple Google search, a website review, a visit to their LinkedIn profile, or a media release search on the person you are about to meet, you can find out where they’ve been, what they care about, and where they’re going. Whether you learn an interesting fact about a hobby they enjoy, the breed of their dog, or something you both have in common, it will show that you took the time to research and that you care about them as a person.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Doing your research ahead of time shows that you care about your client and your reputation. Referencing this information will better enable you to ask relevant questions and link their answers to your product or service to create a win-win situation.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Being prepared not only reduces our stress level and keeps us from looking stupid, but it builds the confidence that other people have in us that we are dependable, reliable and can be counted upon.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Being prepared prevents us from getting tripped up by unexpected glitches and surprises.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Whether it is in the way you walk, talk, dress, or behave, your personal brand impacts how people react and respond to you. It is the essence of what makes you likable, knowable, and trustworthy. And it is what can make you memorable and sought after in the marketplace.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Does your appearance accurately convey the message of who you are that you are trying to get across? When trying to make an excellent first impression in business but in doubt of what to wear, dress one level up from what is expected—if it's casual, dress in business casual, etc.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Many people have never discovered the power generated from a heart of service. They show up to life projecting a right of entitlement in which their needs are their first priority and they will do whatever it takes to forward their own agenda without any concern for how it impacts others. This behavior pushes people away, creates barriers to trust and communication, and leaves a bad impression.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Walk the talk and project confidence. If at first you don’t feel confident, fake it until you make it.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Get outside your comfort zone. Stretch beyond your norm and try new things.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Self-confident people don’t make their self-esteem, self-image, happiness, or self-confidence dependent on another person’s approval, validation, or acceptance.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Smile generously at others and you may find that their smiles are returned right back to you.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Celebrate the success of others and they will be happy to see you succeed.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“True confidence is not something that can always be determined by a first impression. It may take a few interactions to detect whether a person is full of false bravado or if they are the \"real McCoy.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Even something as simple as ending a sentence with the tone of a question mark rather than a period can diminish a person’s authority and credibility.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Even the smartest and most successful of people will experience lower self-confidence occasionally, but the difference is that they deliberately shift out of it and refuse to stay there.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“If you want to appear more confident—speak slowly, articulately, clearly, and deliberately. Communicating with clarity will not only help you build more confidence in yourself, but it will inspire respect from others.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Self-confident people are proud of their accomplishments, but can remain humble without bragging.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Self-confident people face their fears head-on and are willing to take risks.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Self-confident people Know that obstacles are only temporary setbacks.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Self-confident people tend to be optimistic thinkers and focus on the positives.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Share your happiness with others—its contagious!” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A positive attitude will empower you to be more resilient to proactively adapt to change.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Be a source of positive energy and inspiration for others.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A positive attitude will help you be more inspiring and motivating to others.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“What is YOUR personal brand? How are you packaging your unique talents, style, personality and/or products to represent who you are, what you do, and how you show yourself to the world?” ― Susan C Young"},{"quote":"“Is your branding serving your needs for positive impact? Is it paving the way for a great first impression on people when they meet you, think of you, speak of you, or even see you on the Internet? If not, it’s time for a change, and it is perfectly within your control.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Project your “brand” to be remarkable and memorable. Whether through a positioning statement, product placement, advertising campaign, service, a logo, mission, or message, your brand is what makes you and/or your company remarkable—or not.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A “brand” identifies how you are unique and different. It is an attention-getter to help you stack up against your competitors. It also shares with us what we can expect by doing business with you.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Whether you are in business or simply want to be remembered positively, frankly consider these things: What makes you feel special and significant? What makes you unforgettable? When people see or think of you, what image do you think comes to mind?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“How can you stand apart from the herd? How can you start to be noticed so people will remember you? How can you be heard above the noise? “What is your personal branding that makes you special, unique, individual, and memorable?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Color is one of the most important and distinctive elements in enhancing your image. Wearing the colors which are best matched to your personality, energy, skin tone, hair color, and body type will make you look healthier, more vibrant, confident, successful, and approachable.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“People will form impressions, assumptions, opinions, and judgments all within a few short seconds. To make a favorable first impression and make these seconds count, enhance your image by choosing clean, crisp, appropriate attire that reflects confidence and professionalism.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Like it or not, how we each present ourselves to the world, by way of our appearance, attire, behavior, and speech, all send messages on our behalf.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Making a great first impression is not an accident, and with a little planning, experimentation, and application, you can transform your style, substance, and impact.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Once you are dressed there may be still more you can do to enhance, complement, or complete your look. Simply changing your accessories will change your entire impression.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Proven professionals know that by focusing on quality, you can’t lose with the classics and your clothes will last longer. It’s not about having expensive clothing, it is about having style.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“The one who loses something is not a looser somewhere he/she is achieving more than that. You are the best just look at the mirror.” ― Anuj Tiwari, Journey Of Two Hearts! -will be cherished forever"},{"quote":"“Be Your Best Without the Stress!Be the director and actor in your movie, called My Life.” ― Katrina Radke"},{"quote":"“The challenge of being authentic for people pleasers is that we really want people to like and accept us. Being vulnerable, however, requires that we come to terms with the fact that not everyone is going to like us, and that it is okay. Not everyone needs to like us.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Passion is at the heart of your motivation. Let it fuel your spirit and feed your joy. It is your catalyst for courageous pursuits—and it will provide you the stamina to stick with it.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Passionate people are great about discovering what lights their fire and going for it. They might be encouraged by others who share their passion, but they don’t rely on others to tell them what they need to do or how they need to do it.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When employees are motivated and love what they do you will see higher productivity, less turnover, healthier communication, increased loyalty, and a happier environment.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Put the right people in the right positions to ensure their personal strengths and talents are being utilized and appreciated.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“If you want to improve performance and productivity, set a vision that inspires and delights.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“If Not now WHEN?” ― Najah Roberts"},{"quote":"“Be anything but NORMAL, be wild, be a leader, be you.” ― Najah Roberts"},{"quote":"“I love inspiring people and if I can make a difference in one person's life then that's success for me.” ― Germany Kent"},{"quote":"“ਕਦੇ ਵੀ ਫਿਕਰ ਨਾ ਕਰੋ ਕਿਉਂਕਿ ਚਿੰਤਾ ਨਾਲ ਸਿਰਫ ਬਿਮਾਰੀਆਂ ਲੱਗਦੀਆਂ ਨੇ ਮਸਲੇ ਹੱਲ ਨਈਂ ਹੁੰਦੇ” ― Mandeep khanpuri"},{"quote":"“মানুষের মনের ভিতর যদি ভালো কিছু করার জিদ একবার চেপে বসে আর সে যদি লক্ষ্যকে ঠিক রেখে পরিশ্রম করে যায়, তাহলে- কিছুদিন আগে বা পরে- তার জীবনে সফলতা আসবেই এবং আসতে বাধ্য।” ― গাজী মিজানুর রহমান"},{"quote":"“একদিন আপনিও সফল হবেব। সেইদিন আপনি না চাইলেও শত শত মানুষ আপনার জীবনের গল্পগুলো শুনতে চাইবে। সেই গল্পগুলো বলতে বলতে আপনি ক্লান্ত হয়ে যাবেব। তারপরও মানুষ আপনার মুখে শুনতে চাইবে। অন্তত নিজের মনের ভিতর আগলে রাখা সেই জমা কথাগুলো বলার জন্য হলেও আপনাকে অন্তত একবার সফল হতে হবে।” ― গাজী মিজানুর রহমান"},{"quote":"“Happiness is permanent, what is temporary is sadness.” ― preetyautobiocraft"},{"quote":"“success is not a day work, it is a consistent work from the past” ― Joyful Livinghub"},{"quote":"“Life challenges and obstacles are the number one factors of success in life” ― Joyful Livinghub"},{"quote":"“Must read, Great book to read.” ― Piyush Malik, A man with sleeping dreams: Motivation"},{"quote":"“Future doesn't build in one day, it build daily” ― Onipede Ayomide"},{"quote":"“Something that cannot be created duringnumerous experiments can be constructed as a result of a vision.” ― Julia Karmaz Larsen, The Touch Points"},{"quote":"“Everyone has dreams, even a madman has his own dream. But when you don’t take action, a dream becomes a wish.” ― Onipede Ayomide"},{"quote":"“What love we're given, we'll have forever. What love we fail to give, will be lost for all eternity.” ― Leo Buscaglia (Dr. Love)"},{"quote":"“Shoot for the moon. Even if you miss it you will land among the stars.” ― Les Brown"},{"quote":"“Transformation is the ability and willingness to live beyond your form.” ― Wayne Dyer"},{"quote":"“If you don’t know where to start, just take a step in any direction. With focus and consistency, you’ll eventually find your own path.” ― Onipede Ayomide"},{"quote":"“Be useful to people. That way you're helping yourself, you're building something for yourself. They can one day recommend you, have your back or be a miracle you'll need someday. You might not see it now, but you're helping yourself somehow.” ― Zinny Ekechukwu"},{"quote":"“Many people are motivated by other people’s success, but they don’t have the discipline to get started and take risks.” ― Onipede Ayomide"},{"quote":"“Your biggest enemy is your mindset, train it to be positive. If your mindset is positive, you will have a positive life. And if it's negative, you will have a negative life.” ― Onipede Ayomide"},{"quote":"“The world is moving faster than you think. Don’t waste your time, because before you know it, you will already be 30 or older. Your determination today defines your next 10 years.” ― Onipede Ayomide"},{"quote":"“A healed Black woman is a force to be reckoned with.” ― Bethanee Epifani J. Bryant"},{"quote":"“Whatever good you have to bring into the world will be beneficial and it will be more than enough.” ― Bethanee Epifani J. Bryant"},{"quote":"“You might have wondered many a times that even though you plan and prepare yourself to deal with a particular situation, you end up in falling into trouble? Have you ever evaluated the reason for this?If you think over it, you will realise that it is majorly because of your negligence in realising the impulsive reactions that you make while taking the necessary steps into your work or journey.And with this impulsive reactions, you yourself create a conflict between your quick-tempered emotions and intelligence, And as you lose patience in understanding you make quick decisions, thus often end up falling into trouble.So, the trick which you need to learn, understand and practice is to have patience and calmness within yourself so as to build a habit to react only after understanding the whole situation.” ― Prashant Agarwal"},{"quote":"“The only time you learn is when someone thrusts an opportunity at you and you are not sure.” ― Vineet Raj Kapoor"},{"quote":"“I am my problem, therefore I am also my solution.” ― Najah Roberts"},{"quote":"“The choice is simple - Learn or get left.” ― Najah Roberts"},{"quote":"“Train your brain to understand the importance of your dreams” ― Cindrella"},{"quote":"“Some people are able to find the beauty in everything; they're meant to change the world” ― Cindrella"},{"quote":"“True happiness is permanent. It doesn't vanish if the cause is gone” ― Cindrella"},{"quote":"“If you're not playing the main role in your own story, you're probably living someone else's life” ― Cindrella"},{"quote":"“Success is a state of min, but it needs your effort to become a fact” ― Cindrella"},{"quote":"“Sometimes it will take a long time to reach your destination, but you have to keep trying” ― Cindrella"},{"quote":"“Leaders don't fight to stay on top, they fight for others to lift them up” ― Cindrella"},{"quote":"“Success is a state of mind, but it needs your effort to become a fact” ― Cindrella"},{"quote":"“Breakdown your aim into small achievable goals in order to reach it” ― Cindrella"},{"quote":"“No matter how you feel right now, tomorrow is another day. Live it and win it” ― Cindrella"},{"quote":"“Manipulation is a smart defense mechanism, honest people choose to be stupid in these situations” ― Cindrella"},{"quote":"“Don’t count on others’ love for you. If you inadvertently lose their respect, they will intentionally spare you out of their lives” ― Cindrella"},{"quote":"“Moral dilemmas are not to test your manners, but to teach you a good lesson. It’s your choice to understand it or not” ― Cindrella"},{"quote":"“Words have no meaning if they’re not exposed to action. Action has no power if it’s not interpreted to words.” ― Cindrella"},{"quote":"“They say \"never say never\".Well, I can assure you that, you will NEVER make me feel bad about being black, being a woman, and being ambitious. If this offends, sounds like a personal issue and you have my thoughts and prayers (cuz I'm a Christian too). Live in and for your purpose. You were not created to be mediocre. And continue to pay it forward. Someone can always learn from your testimony.” ― Liz Faublas, You Have a Superpower: Mindi Pi Meets Ava \"Why Can't I Go Outside\""},{"quote":"“Most people are always trying to pick the next winning stock and invest in the next winning company. They often forget that they themselves are a \"company\". Instead of trying to go all in on other companies, why not go all in on yourself.” ― Wilbert Wynnberg"},{"quote":"“Our results never decide what we are?Just your hard work and your efforts decide whether you are a loser or not ..-DSDASHING SHIBUSHIBU CHANDRAN” ― Shibu chandran"},{"quote":"“You can see the weakness in man when he's in competition with his family or his peers. When he could be in competition with himself.” ― Rasmee Yasin"},{"quote":"“The stumbling block of man is his ignorance as to where God’s power truly resides. He looks externally for the keys to his freedom, not knowing that the means to his liberation are already within him.” ― Dr. Billy Alsbrooks"},{"quote":"“Take the stones people throw at you and use them to build a monument.” ― Robin Sharma, Робин Шарма"},{"quote":"“The world is a stage waiting for you to take lead or become an audience.” ― Aiyaz Uddin"},{"quote":"“Assume nothing and judge less” ― Karen Gibbs, STOP THE DOWNWARD SPIRAL"},{"quote":"“The only weapon that you need in a battle of words is the truth.” ― Mitta Xinindlu"},{"quote":"“Motivational Speakers\", once they had more fear, stress and depression than you...but they fought and conquered.” ― M.Rehan Behleem"},{"quote":"“Today’s present is tomorrow’s past,So make this present a beautiful one.” ― Luffina Lourduraj"},{"quote":"“I am a flower breaking ground.” ― Bethanee Epifani J. Bryant"},{"quote":"“Todos los sueños son ridículos para la gente normal, hasta que ven cómo vas y los alcanzas, y cierras todas las bocas.” ― Jorge Balderas Gálvez"},{"quote":"“Learn to listen with your eyes and not your ears” ― Marques The Writer"},{"quote":"“The essence of our industry is to be able to present something to somebody in the most concise form and in the quickest way possible.” ― Maxim Behar, The Global PR Revolution: How Thought Leaders Succeed in the Transformed World of PR"},{"quote":"“Real greatness is not what you have in life, it’s what you overcome.” ― Eliyahu Jian, The Finding God Workbook: CTW52"},{"quote":"“Creating independence through your actions will help you remove shame.” ― Eliyahu Jian"},{"quote":"“Friendship is vital to our spiritual growth.” ― Eliyahu Jian, Affirmations and Inner Reflections from Eliyahu"},{"quote":"“It Doesn't matter if you choose religion or spirituality; whatever you choose do it with happiness.” ― Eliyahu Jian, The Finding God Workbook: CTW52"},{"quote":"“When you are happy you can do anything” ― Jill Liberman"},{"quote":"“There is no failure, but in failing to begin or failing to continue. Everything else is an education or motivation.” ― Christopher Babson, BOLD! Life & GOAL Success System: Live and Succeed with Passion, Purpose & Positive Personal Power"},{"quote":"“If you ask me a question. Then you say the answer does not matter. You should not be worried or dispute the answer I give you.” ― De philosopher DJ Kyos"},{"quote":"“Value Yourself” ― who"},{"quote":"“From the movies that you watch to the songs on your radio. Down to the magazines placed ever so neatly in the grocery house, you know the ones with the movie stars. Since they wouldn’t make any money if you already loved who you are. See there is no profit in saying you’re already perfect and beautiful too.” ― Richard Williams"},{"quote":"“I grabbed the mic and walked towards the stage. They said, “Knock them dead, Steve!”I replied, “They’re already dead...I’m about to knock them ALIVE!” ― Steve Maraboli"},{"quote":"“I live never greed, world!Nothing here mine,Never purchased this sky and where I here standing in land” ― Aabas Sadkani, Therefore You: Thoughtful dream of you & me"},{"quote":"“Your conviction, fearlessness, and relentless pursuit of your best self are your Superpowers!!” ― Liz Faublas, You Have a Superpower"},{"quote":"“Those who are successful look at \"no\" as \"not right now” ― Marques The Writer"},{"quote":"“Set up your vision in such a way that it will continue to live even after you die” ― Marques The Writer"},{"quote":"“In 2019 the revolution¬ary advent of social media has now reached its full swing, and 100 percent of all deeds, thoughts, deals, and acts in our lives are public.” ― Maxim Behar, The Global PR Revolution: How Thought Leaders Succeed in the Transformed World of PR"},{"quote":"“Avoid interacting with fake people, it's painful for your mind” ― Cindrella"},{"quote":"“Sometimes doing nothing is the only right thing to do” ― Cindrella"},{"quote":"“Winners are those who choose kindness as their attitude, cheerfulness as their personality, and happiness as their path” ― Cindrella"},{"quote":"“Reality is what we choose to believe” ― Cindrella"},{"quote":"“Giving up on something means you have the right to own it. If you don't have that right don't fool yourself” ― Cindrella"},{"quote":"“Sometimes when you get hurt, you'll be able to forgive, but not forget. Be honest with yourself” ― Cindrella"},{"quote":"“Doing the right thing supposed to make you feel better, if not, it's definitely not the right thing” ― Cindrella"},{"quote":"“There's no cure for bad-hearted people unless they admit it” ― Cindrella"},{"quote":"“Memories are beautiful because they (are) memories.Reviving them ruins your life's journey” ― Cindrella"},{"quote":"“You're a victim only if you choose to be.” ― Cindrella"},{"quote":"“As a black woman, the decision to love yourself just as you are is a radical act. And I'm as radical as they come.” ― Bethanee Epifani J. Bryant"},{"quote":"“The real opportunity for success lies within the person and not in the job.” ― Zig Ziglar, See You at the Top"},{"quote":"“I won't say it, i'll show it.” ― Srinu Maripi"},{"quote":"“You have inside you an amazing power that will help you leave the past behind and guide your tomorrow for an amazing adventure. Never under estimate your internal power, your internal power of God. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“A dream is an explosion of your inner passion are you willing to risk it all to fulfill your dream. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Success is the process of walking into your dream one-step at a time. Make the effort to take the step. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“You get to choose what scares you the most, take your curves on the road and lean into them with confidence. For before you know it, you are on the long wide-open road of Success… ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“A curve in the road is just a detour to your wide-open world of opportunities. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“I am in the art of creating myself, How about you? Do not just find yourself create yourself for success. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Life is about using all the skills in your toolbox. Paint your life with vibrant color, soothing music, and hang around exciting people who will stretch your colors from red and blue to purple. Use all your senses and enjoy your surroundings. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Are you paying attention? Listen, look and receive the lessons of life for they are everywhere... ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Remove the mask you think others want to see. Instead, let them see your true, authentic self.” ― Pamela Wigglesworth"},{"quote":"“The echo of your silliness defines the speed and distance of your awareness; - keep wishing through actionable failures that reasonably calculate your success.” ― Kangoma Kindembo"},{"quote":"“The best complaint is an action that turns into results, not an action that results in complaints.” ― Kangoma Kindembo"},{"quote":"“Every up has a down facing it. And every down shifts if you know how switch between the two! Never give up, go around your failure.” ― Kangoma Kindembo"},{"quote":"“My Pet's MyTherapist When I'm feeling down she says, \"Rough, rough!\" She's such a good supporter and makes such great critique at the same time!. That's what I call a \"pet talk\". She's FURbulous and I absolutely love her !!” ― Ana Claudia Antunes, 70 Inspirational Quotes in Spiritual Notes: Simple Ideas, Lasting Ideals, Light and Love in Spiritual Languages"},{"quote":"“I do what people say I can't.” ― Lorenzo Dozier, 31 Days to Live"},{"quote":"“You can speak fluently or passionately and still not be worth listening to.” ― Mokokoma Mokhonoana"},{"quote":"“In the Way of Excellence, life and your athletic activity is truly a journey, not a destination. Peace comes from loving every moment and every step of the way. Every day is a new beginning” ― Tobe Hanson, Athlete's Way of Excellence: Ancient Chinese Wisdom Revealing the Secrets to Modern Day Athletic Peak Performance and How to Be in The Zone"},{"quote":"“There is an athletic body in all of us.” ― Tobe Hanson, Athlete's Way of Excellence: Ancient Chinese Wisdom Revealing the Secrets to Modern Day Athletic Peak Performance and How to Be in The Zone"},{"quote":"“The Way of Excellence is going with the flow of things, dealing only with what is in your control in the present moment, having awareness if you need to commit to something, engaging whole heartedly in your activity, accepting and learning from an outcome and remembering and applying what you learned, and lastly, resting and recovering.” ― Tobe Hanson, Athlete's Way of Excellence: Ancient Chinese Wisdom Revealing the Secrets to Modern Day Athletic Peak Performance and How to Be in The Zone"},{"quote":"“MISPLACEMENT OF BEINGS\"September 11, 2011 at 3:24 PMTHERE ARE GODS OF SPORTS(MICHAEL JORDAN)THERE ARE GODS OF MUSIC (MICHAEL JACKSON)AND THERE ARE EVEN GODS OF WAR (AMERICA) \"THIS IS NECESSARY\" THIS GALACTIC COSMIC UNIVERSE IS CONSTANTLY EXPANDING, AND EVOLVING MORE AND MORE STARS ARE BEING BIRTH TO ANNOUNCE THEIR EXISTENCE FOR WE ARE ALL APART OF THIS NEVER ENDING PROCESS IN WHICH WE CALL LIFE WEATHER WE ARE AWARE OF THIS OR NOT WE ARE ALL, AS SPACE CAN BE DEFINE AS THE DNA OF GOD WE ARE THE INTELLECT OF THE COMPLETE SOURCE IN WHICH WE AS LIGHT BEING SHOULD EXPRESS THIS KNOWLEDGE BUT THE FACT THAT SOME STILL WILL NOT EXPRESS OR IS AFRAID OF WHAT THEY MIGHT LOOSE IS IS A STRIKING TO ONES HEART KNOW WHO YOU ARE....LOVE,TRUTH,PROSPERITY” ― Stephen Jahseed Lark, Tell The World: Understanding Oneself"},{"quote":"“Most often than not, I am saddened, at the thought of the human idea of me not being wealthy, rich and famous enough, to be a professional motivational speaker, whenever I stepped into the insanity of a thinking human.” ― Mr One ZED"},{"quote":"“Do not fear the coming storm...instead focus only on the gifts it brings you ...every storm that blows through your life....will teach you something X” ― Mark Marsland"},{"quote":"“1. Start your day as if a list is prepared for the performers of the day, your name is right at the top. 2. Do not speak to the customers by whispering, you are not gaining their confidence – speak confidently.3. Do not waste your time in waiting for the opportunities, if they were on the road they would have arrived by now. Walk to them.4. No excuses please, change it or pass it on to someone who can. Do not sit on the opportunity. 5. If you have to be kept hidden in the field, you are simply a burden on the team. Please improve your fielding.” ― Shahenshah Hafeez Khan"},{"quote":"“The Universe Works on Yin and Young. You can't just take without giving back you can't inhale without exhaling.” ― Eliyahu Jian, Affirmations and Inner Reflections from Eliyahu"},{"quote":"“A women's power is to want everything and at the same time to be able to reflect everything.” ― Eliyahu Jian, Affirmations and Inner Reflections from Eliyahu"},{"quote":"“Forgiveness is the seed when planted in the heart will expand it and turn it into wisdom and compassion.” ― Eliyahu Jian, The Finding God Workbook: CTW52"},{"quote":"“Revel What you already have; the awakening is to know that Fulfillment is already here.” ― Eliyahu Jian, Affirmations and Inner Reflections from Eliyahu"},{"quote":"“Don't give up on yourself. Find a friend.” ― Eliyahu Jian, The Snail with No Shell"},{"quote":"“What you believe about “You” becomes your reality, be careful what you believe, especially about yourself. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Fly like an Eagle and let your wings take you to some Amazing places. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“The time has come to let go of excuses... You have a purpose in this life let your light shine! ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Dare to be Powerful today! Then fear will fade away... ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Don't settle for good when you can wait for something Fantastic! ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“There is Power from what excites you, are you bringing your passion to your everyday life? ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Take responsibility for failures and accomplishments of the past and present in order to move on to exciting new adventures. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Don't be pressured by anyone, if they value you, they will wait. Remember you are worth the wait. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“What choices are you making today? Your choices are one of the most important assets you have. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Your thoughts are your most powerful asset. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Remove those darkened lenses of abuse and replace with God's lense of forgiveness and be free. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Is the crowd you are hanging around moving you forward or holding you back? Choose your connections carefully... ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Continue searching for the answer and the problem will fade away. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Reach your hand out to life and life will you give you multitudes of Blessings. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Life is in Process… tick, tock… ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Pluck out the poison of unforgiveness and let your heart blossom with love. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Life has many curved roads we will eventually end up on the smooth road of life if we drive long enough. And don’t give up. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Comfort zone, I am out of here... I want to experience the great stuff. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Your 'Belief' has the power to drive your life toward success, sharpen your belief and go forward. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Step out of yourself made boundary and step into your new frontier. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Take one-step forward, breathe, take another step forward, breathe, and before you know it you will be on the top Enjoying the beauty of life. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Trust the curves in life. God will lead you through, the ride is Amazing. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“You are on the right path, keep going forward what you need will find you. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“I am more than what happened to me, I am a child of God who Thrives. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“You are headed toward sunshine, don’t give up. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Relax and enjoy the ride of life, there will be ups and downs however they are meant for a reason breathe in the precious air of life. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Life is a journey of curves, hills and flatlands appreciate all the roads for they are your life. Trust the curves, enjoy the hills and glide through the flatlands it is an amazing ride… ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Every day you are the teacher for someone, what are you teaching, choose to influence everyone around you. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“You have the power to build your dream! ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Take the lid off limiting thoughts and let the juices flow, your unlimited possibilities are awaiting. ~Janiece Rendon Transition Strategist” ― Janiece Rendon, Trust the Curves"},{"quote":"“Since your habits and hygiene will all help you feel great, look great, and improve the quality of your life, isn’t it worth your effort to make them a part of your reality?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“If you were to spend your own time and money to hire a consultant, coach, or trainer, wouldn’t it give you more confidence knowing that they have \"walked the talk\" and have vast experience with what they are teaching?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Becoming an expert not only establishes you as a leader in your field, it will make you a trusted resource that people can rely on for new and innovative ideas. In addition to raising the stakes and helping you increase your income, your expertise will serve to make a powerful first impression, which will truly help you shine and stand apart from the crowd. Having fun and meeting interesting, incredible people along the way is an added bonus!” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“By establishing a strategic online presence through your website, social media, keywords, meta tags, and Google AdWords, the world may discover your expertise and \"beat a path to your door.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Become a thought leader by taking an idea, belief, or process and turning it inside-out and upside-down. Bust beyond the box and shatter a few ceilings to go where no one has gone before. Make your mark by becoming a pioneer in your pursuits.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“To position yourself as an expert, create content, write a book, build a blog, post on social media, and write articles for professional publications and news sites to build your intellectual portfolio of expertise. Repurpose content in a variety of ways.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Put in the time. To position yourself as an expert, practice, apply, experiment, volunteer, and work within your area of knowledge to deepen your own understanding as you build real-life experience.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“To position yourself as an expert, learn everything you can about a subject. Develop your knowledge: read books, attend classes, listen to your market, get training, attend seminars, find a mentor, join a mastermind group of like-minded individuals, watch videos, and study.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“To position yourself as an expert, share your knowledge with others. Deliver presentations and teach others on your topic. Look what TED Talks have done for normal people who simply presented their passion and thereby launched careers, fame, and fortune. Interact with your target market. Maximize use of the Internet and SEO.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“When you have paid the price, earned the right, and done the homework to be called an expert, people perceive you differently.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Punctuality has been called a “homely, but solid virtue.” Although it is not fancy, it is a strong reflection of a person’s character.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Arriving on time for your engagements demonstrates preparation, respect, integrity, and enthusiasm, all of which serve to make a positive impression on the people whom you are meeting, especially when they are depending on you—or paying you!” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“When you have scheduled an appointment, or have made a commitment, you have essentially made a promise. Keep your promises. Being punctual demonstrates your consideration for others and that you can be depended upon.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Be on time! If you have a 15-minute appointment—keep it at fifteen minutes unless there is mutual agreement to continue.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“When beginning a conversation, ask the other person, “Do you have time to speak right now?” If they say no, you can say, “I have some valuable information to share with you. What time would work best for you?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Absolute solution comes from absolute problem, ultimate certainty comes from ultimate uncertainty, total acceptance comes from total rejection, complete perfection comes from complete flaw, ample richness comes from ample poverty, foolproof protection comes from unyielding danger and unlimited liberty comes from unlimited restriction. Each one is coincident of another as dark is coincident of light.To such a degree, never try to escape from them.Rather bravely and wisely engage to sort them out . You know, these wonderful stuffs fetch for its tail all wonderful-reverse-stuffs, making your life tested and dignified.Never give up rather wake-up, have a great shower, eat, dress up and join in the struggle. Neither dishearten yourself nor give ears to others' words, just keep faith on you, believe your own intuition and keep the struggle going...I am damn sure, Success, it must lay its head eventually beneath your noble feet as a flunky of order execution and will crown you as the king. Many Cheers from Lord Robin.” ― Lord Robin"},{"quote":"“Rise up and show off your talents the world needs you. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“The time to unfold your uniqueness in Now! ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Attitude is the key to your future. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Your time has come to do amazing things, get out of the boat. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“You are Amazing! You have everything to be successful inside let your light shine. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Try something different to get different results and before you know your life becomes amazing! ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“We are known by the footprints we leave are you leaving paths to success? ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Beauty will flow through the cracks of pain. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Open the door and step in, Climb the ladder to the top, either way you have to make the first move. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Follow your passion. It is Amazing. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Always have HOPE for that is the key to continue on your journey. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“There are a world of opportunities waiting for you, pick one and go for it! ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Your life is your masterpiece choose the puzzle pieces carefully. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Release people to change at their own pace and the change will take place in peace. ~Janiece Rendon” ― Janiece Rendon, Trust the Curves"},{"quote":"“Do your clothes make you feel happy, beautiful, comfortable in your skin, handsome, confident, or powerful?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“How you accessorize your wardrobe can transform the plainest outfit into a dazzling, unforgettable impression. It can be the mark of your own unique style, an extra splash of fashion, or an expression of your mood.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“You can be dressed to the nines and have it all going on, but if you don’t have shoes to support your look, they can be your undoing. Your shoes should be appropriate, clean, polished, and maintained if you want to make a great impression and fortify your credibility. If your shoes are scuffed, dirty, or worn, clients may wonder what other details you’ve neglected to attend to.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Few places are more important for dressing appropriately than the workplace, where a professional appearance is crucial.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Prepare for Success. Feel the satisfaction and power of having your act together! Get organized beforehand to get better results. Prior Planning Prevents Poor Performance.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“An important part of dressing for success is not only wearing something well but making sure it is appropriate for the occasion or the environment.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Dressing appropriately in one venue may be highly inappropriate in another.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Dressing appropriately in one venue may be highly inappropriate in another. Yet every day we see a lack of modesty and taste, regardless of how uncomfortable it makes others feel.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Experts agree that color can stimulate emotions which evoke different responses. Simply by changing colors, you can change moods, communication, perceptions, energy, and expectations.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Research has shown that different colors represent different character qualities and have a powerful psychological effect. Color portrays different meanings in life and in business. Choose the colors that not only make you look and feel great, but inspire the emotions you hope to evoke.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“The importance of healthy habits and hygiene for making a positive first impression should go without saying; however, I would be remiss if I did not include this topic in the book, because surprisingly, many people just don’t get it.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Are your habits and hygiene hindering your success or making a great first impression on your behalf?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Without a second look, your habits and hygiene reflect a lot about you—your thoughts, values, beliefs, priorities, self-esteem, self-respect, confidence, and every other category covered in this book that influence how people perceive you.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“When you resolve to live a healthier life, you will feel better, look better, and make a better impression on everyone you meet. Only you have the power, ability, and personal choice to instill healthy habits and hygiene into your life.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“I know that trying to begin a new habit may be uncomfortable, inconvenient, or challenging. However, when the goal is to feel terrific, isn’t it worth your consideration?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Poor habits can invalidate your credibility and undermine your success in all areas.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Create your own personal brand to stand apart from the crowd. Package your unique talents, style, personality, and products. Show and tell who you are and what you do—to the world.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Developing your EI will allow you to explore new depths of understanding in yourself and others. It will give you insight as to why people behave as they do and assist you in areas you may wish to improve.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Make the personal choice to instill healthy habits and hygiene into your life. When you resolve to live a healthier life, you will feel better, look better, enjoy improved well-being and make a better impression.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Simply by living life you will gain new experiences that are uniquely your own. Your vantage points along your journey will help you form your perceptions, grow your influence, and ground you in a wisdom which can only be gained from having been there and having done it.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Punctuality Plus. When you have scheduled an appointment, or have made a commitment, you have essentially made a promise. Being punctual demonstrates your consideration for others and that you can be depended upon.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Be and Do what it takes to Have superb results. Nurture a mindset that works for you, rather than against you. Your inner thoughts determine your outer world.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Rather than allowing your failures to define you, learn from your experience to do better next time.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Rather than staying stuck in stress, unhappiness, or grief, use your experience to find gifts in the pain and grow.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“How can you build credibility without grandstanding as you strive to stand apart from the crowd?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“How can you showcase your unique expertise, valuable experience, and strong education without sounding egotistical?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A quality education prepares you to make a living, make better choices, and have more doors open as you build a solid life.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Getting an education is not only a matter of checking the boxes as your life progresses; it is a gift which can enrich every aspect of your world.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Companies that do not have a succession plan in place in which their seasoned professionals are teaching the younger, less experienced generations risk losing far more than talent. The depth of their experience is a valuable commodity and resource.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Take your place among experienced professionals by focusing on ways to learn, grow, and succeed.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Just as your body has self-regulating mechanisms, like perspiring to cool you down and shivering to warm you up, you can regulate your emotions according to the circumstances. You can abstain from over-reacting, and you know how to set boundaries and how to say \"no.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Emotionally intelligent people have an ability to manage stress as it happens and remain calm through chaos.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Emotionally intelligent people think before they speak and exercise discretion.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Emotionally intelligent people know how to light their own fire to sustain their activities to accomplish your goals.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Don't you love the sense of personal power you feel when you've got your act together? When your life is in order, you’re organized, and you have everything you need?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Preparation will not only fortify your confidence to approach life from a position of strength, but it will impress other people as well.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“There are few things more important than being prepared—for an interview, an important meeting, selling your home, a new baby—the list goes on.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Even if what you’re preparing for does not happen, your efforts aren’t for naught. With preparation comes knowledge of each situation, as well as the confidence to handle every new encounter with more grace and ease than the time before.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Dumb luck and flying by the seat of your pants can only get you so far in life.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Living in the age of the Internet and being a part of the information generation, we have unlimited access to an unprecedented wealth of knowledge and learning. We have no excuse to show up to an appointment, a sales call, a date, or an important meeting without learning everything we can to tip the odds in our favor.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Being prepared and sharing your knowledge earns the confidence of those who are interviewing you, depend on your expertise, or seek you out for solutions, answers, or presentations.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Give yourself and others the gift of your brilliance to deliver a more compelling and memorable presentation.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Homework doesn’t end when you receive a diploma. Often, it's just the beginning of your learning.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Doing your homework and being well prepared for appointments is one of the most powerful ways to set yourself apart from your competition to gain and retain new clients.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“If there is someone whom you would really like to impress, learn as much as you can to be informed, enlightened, and aware of them before you meet.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Whether you are staying in someone’s home as a house guest, attending a dinner party, or visiting a sick friend, when you bring a “hostess gift” or a thoughtful token, you are providing a gesture of kindness which will extend far beyond your visit.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Discover an interest, a passion, a preference or need your client has, and take the time to give them some small item related to it. By making the extra effort to learn about the person and their business, you become very appealing and much more memorable.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“It is no longer a matter of IF you have a personal brand--it is a question of “How is it working for you?” Does it best express your intentions, your uniqueness, and your service offering? Is it helping or hindering your progress and success in business?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“What is YOUR personal brand? How are you packaging your unique talents, style, personality and/or products to represent who you are, what you do, and how you show yourself to the world?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Which outfits do you get the most compliments on when you are wearing them? What colors make you feel healthy, vibrant, and alive?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“The word “brand” has now taken an individualized and highly personalized shift toward how you are perceived in the minds of others.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“For many people and companies, the only place they are seen by others \"in person\" is on the Internet. Having a stand-out, consistent brand is imperative.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Is YOUR brand consistent and congruent with your desired outcomes?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Since nothing stays the same, the great news is that, at any moment, you have the ability and power to move the needle in the direction of your dreams and create a brand that best represents you.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“What helps people identify your Super Powers? Instead of hiring a personal PR firm to identify and promote your personal brand, ask yourself what strengths you want to be remembered by.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“To help get your creative juices flowing, you might look online at lists of the \"best taglines ever.\" Their branding ideas are genius and may be just the catalyst you need to activate your awesome!” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Take a searching inventory of your speech, habits, behaviors, appearance, hobbies, preferences, talents, and products. The key is what makes you distinct and unlike others.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Redesign, renew, and recharge your brand.” Decide what value you bring to others and give it.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“The times, they are a-changing! What was once defined by tradition, respect, and custom has evolved into a relaxed and casual society. What is acceptable and normal today would never have been permitted in the past.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Is your appearance representing you well and helping you achieve the results you desire or could you use a style makeover?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Self-confident people are mindful about spending their time, energy, and interests on things that truly matter.” ― Susan C. Young"},{"quote":"“Emotionally intelligent people trust their instincts and can identify how certain thoughts, feelings, people, and situations make them feel.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Emotionally intelligent people hold themselves accountable for their behavior, failures, decisions, and successes.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Be mindful of the words in your mind and in your mouth. Choose to use an affirming and positive vocabulary because your actions and outcomes will follow suit.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Surround yourself with positive people who ignite your energy and spirit.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Believe in your power to make happiness a choice—do so every day, until it becomes a lifelong habit.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A positive attitude feels a heck of a lot better than a negative one.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A positive attitude will stimulate creative thinking and constructive problem-solving.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A positive attitude will elevate your energy and invigorate your tasks.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A positive attitude will help fortify your courage to build unshakable confidence and self-esteem.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A positive attitude will help fortify your courage to build unshakable confidence and healthy self-esteem.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A positive attitude will help you edge out cynicism and pessimism to restore hope and optimism.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“When adversity hits, reframe the challenge and find lessons learned; acknowledge gifts that have come from the pain.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Stretch your imagination to a new dimension with hope and flexibility—opening your world to new possibilities.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Don’t participate or allow yourself to be dragged into other people’s dramas, complaints, or gossip.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Become a lifelong learner. Read books, watch videos, listen to audio, and seek lessons for learning how to live your best life now.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Take a moral inventory of ways you may be self-sabotaging and then take proactive steps to change them.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Strive to see the best in others, situations, and experiences.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Remember that your attitude towards life determines life’s attitude toward you. At any moment, you can choose to change everything for the better.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Exercise and get moving to pump up your endorphins and elevate your mood. Take an adult recess.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Wake up early, do your best, practice self-care, and finish strong.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“The Art of First Impressions for Positive Impact is based on the premise that when you become self-aware and learn how to shine bright as your best self, you can transform your relationships in life and in business.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Absolutely everything associated with your success is relationship based and emotionally connected. Developing your emotional intelligence is one of the wisest action you can take for personal and professional transformation.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Developing your emotional intelligence will allow you to explore new depths of understanding in yourself and others.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Emotional intelligence will give you insight as to why people behave as they do and assist you in areas which you may wish to improve.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“All the elements of greater emotional awareness can weave together to ensure you make a more positive impact.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Emotional intelligence marks one’s ability to perceive, understand, control, and evaluate his or her emotions.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Haven’t you known people who seem to have a “sixth sense” super-power when it comes to connecting, communicating, and understanding others? These emotionally intelligent people always know the right things to say to make us feel that we matter.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Emotionally intelligent people have the capacity to understand and express their own emotions—you are in touch with your strengths and weaknesses and realize where you might like to make improvements”.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Emotionally intelligent people can focus their emotions to improve performance and productivity.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Would you like to feel a calm confidence when you walk into a room full of strangers, knowing that you can start new a conversation with anyone?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Many people go through life complaining, whining, and obsessing so much about what they don’t have that they are doing exactly what it takes to block it.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Learn to leverage the Law of Cause and Effect to your advantage in positive ways!” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“More people continue to be and do exactly the things in life that prevent them from getting what they want or from waking up excited about their day.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Since your mindset can make you or break you, how is it going? Is it representing you well or does it need a complete overhaul?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“The Law of Cause and Effect is as active in your life as the Law of Gravity. It teaches us that for every action there is a reaction.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“If you do nothing, you’ll have nothing. If you do something spectacular, you will have something spectacular.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Do you yearn for loving, loyal relationships? Be that for others” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Communication skills, quotes by susan c young, relationship quotes, how to make a great first impression, preparation quotes, motivational speaker, susan young, build confidence, mindset quotes, attitude quotes” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“If you want to enjoy confidence, engagement, positive feedback, connection, and reward in your relationships, start being and doing what it takes to make it happen.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Create and nurture a mindset that works for you rather than against you.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Strive to be optimistic rather than pessimistic— forgiving rather than a grudge holder.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Strive to be a possibility thinker rather than an impossibility thinker.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Strive to be happy rather than downhearted or miserable—hopeful rather than resigned and doubtful.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Strive to be pleased and accepting rather than angry and resistant.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Strive to be daring and brave rather than reluctant or afraid.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Strive to be a proactive participant rather than a passive procrastinator.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Strive to be active rather than lethargic—determined rather than wavering or lazy.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“When you make a deliberate effort to keep your thoughts positive, and authentically feel that way, more positive outcomes are inevitable.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Mindset and attitude are so tightly intertwined they almost mean the same thing!” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“When you wake each day, it is your choice if you are going to use your attitude to your advantage or allow it to work against you.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“If you want to fly high and go amazing places, your attitude is crucial.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Put yourself in the driver seat by designing the best attitude possible to help you get where you need and want to go.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Throughout my life, I have been blessed with a positive and resilient attitude. I grew up with an alcoholic father and he tested my disposition in more ways than you might imagine. Knowing I couldn't depend on him for positive reinforcement, I clung to my positive attitude like a life preserver to give me the strength for positivity and self-reliance. Otherwise, I would have sunk into the depths of low self-esteem and worthlessness. A positive attitude was my saving grace and it became a habit by choice, day-in and day-out.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“At times, maintaining a positive attitude and outlook takes great risk, courage, toughness, and flexibility. It is not easy to stay positive in a cynical and negative world.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Remain vigilant and try diligently not to succumb to the soul-sucking, mind-numbing, ill-mannered attitudes that seem so prevalent in the world today.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“I have known many people who have been incredibly successful in life. It was not necessarily because they had immense talent, brilliance, an expensive education, or exemplary skills. It was because they had an extraordinary attitude to take on life with love, passion, conviction, consistency, and hard work. What they all had in common was getting their minds right and becoming positive thinkers—which activated their potential to achieve remarkable things and build strong relationships.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Developing a positive attitude is one of the most transformational things you can do to shift your mindset, improve your disposition, manifest good things, and attract quality people into your life.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“The benefits you will enjoy with a positive attitude have a multiplier effect and exponentially impact your personal well-being.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A positive attitude will not only make you more fun to be around, but it will bring more happiness and joy both into your life and the lives of those around you.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Just because you don't know how to do something now does not mean you can't learn how to do it later.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“If you are lacking confidence in something, just keep trying and don’t give up.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“If you want to be successful, how you show up to life matters.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“To say your mindset is critical to your success is a gross understatement—it is the underpinning!” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Your mindset brings together your attitude, perceptions, experience, interpretations, opinions, beliefs, values, and understanding to determine how you think, act, walk, talk, behave, and engage.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Steer clear of negativity and set boundaries so that when people bring it on, you can engage your force-field to deflect their distracting energy.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“As you jump new hurdles, you gain greater confidence. Confidence can be achieved like any other practiced skill.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Just because you may not feel confident about doing something now does not mean you will not master it later with ease.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Building confidence is an ongoing process and something that can be accomplished over time.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Practice positive and affirming self-talk.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Set goals to create a clear sense of purpose and direction.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Dress confidently in clothes that make you feel great about yourself. When you look better you feel better.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“What steps can you take to prepare before meeting others to ensure that when you do show up, you are bringing your very best to the table?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Wouldn’t you like to arrive to any event or situation with a sense of confidence and ease that things are as they need to be?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Get ready to take on the world from a position of personal power, strength, and intention!” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Your first impressions will often occur within a limited window of opportunity—and if you blow it— the opportunity may be lost forever.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Prime yourself for success and demonstrate to others that you are diligent, reliable, and trustworthy.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Care enough to take deliberate steps and get ready through thoughtful discipline, research, organization, and effort. It will impress others and give you the winner’s edge to live and give your best.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Begin by asking yourself if you are currently showing up to your life, your business, and your relationships in a way that is cultivating an extraordinary life.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“For some, putting in the time or work to be prepared and live deliberately is natural. For others? It’s work. However, as in the words of Thomas Jefferson, \"If you want something you have never had, you must be willing to do something you have never done.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Are you ready to explore what it takes to move beyond where you are to where you want to be? You came to the right place.” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“Nurture a balanced perspective and don’t “sweat the small stuff.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Identify confident people whom you admire and respect and notice what they do differently to project such confidence. Learn by observing role models.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Confidence is not a goal or a final ending point where you arrive and then stop once you reach it. Rather, it is the satisfaction and reward you achieve by stretching to, and beyond, the best of your abilities.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Building self-confidence is like building a muscle. Your confidence grows in response to your intensity of usage and the level of performance you require from it. If you don’t use it, you may lose it. Stretch, flex, life, and build!” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Self-confident people are mindful about spending their time, energy, and interests on things that truly matter.\\” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Use your body language and posture to project confidence. Shift your physiology into a more powerful pose or position and your mindset will follow.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Think and act positively by focusing on the positives in yourself, other people, and situations.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Self-confident people take the initiative to move forward in the direction of their dreams.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“One would think that if people truly wanted to live incredible lives, they would do everything in their power to create a mindset which helped them get there. Right?” ― Susan C. Young, The Art of Preparation: 8 Ways to Plan with Purpose & Intention for Positive Impact"},{"quote":"“A wonderful place to start is to seek role models who exemplify this way of being and try their style on for size.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Grace is an attitude of generosity toward our fellow humans. We are not easily offended and do not look to judge and label others. With a spirit of graciousness, we are amiable, benevolent, and charitable.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Dignity impacts the quality of your external world in your relationships, communications, and interactions.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Dignity is a quiet strength which reflects your deep honor and self-respect. It is a gracious pride without narcissistic projection and portrays a calm awareness and generosity of spirit regardless of the environment or circumstances.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“If your self-talk leans toward the negative, the continual bashing will become debilitating” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Dignity impacts everything in your life. It affects the quality of your internal world for how you see, feel, and think about yourself.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Dignity impacts how you are perceived and received when making a first impression.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Charisma and charm are endearing qualities which go hand in hand to make others feel “lighter, happier, and a little in love” when they are around you.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“People with the gift of charm exude a delightful demeanor—an attractive likability that enwraps you in their warmth.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When they are authentically engaged, their positive impressions create memorable moments and leave a lasting impact. Physical beauty becomes irrelevant because their exuberance and engagement bring out the beauty in you.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“People who exude genuine charm & charisma seem to possess a heightened sensitivity to the feelings of others—delivering gentle manners, gracious compliments, and sincere interest.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“They emanate an essence of caring, love, and compassion towards the people they know, and generously extend their aura to the new people they encounter.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Their engaging manner is grounded in consideration as they seek to get along well with others. People who exhibit charisma and charm are also said to be alluring, bewitching, captivating, magnetic, fascinating, enchanting, and seductive.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Charisma (presence, poise, magnetism) and charm (enchantment, attraction, fascination) are behaviors which can be learned and practiced.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“There are differing opinions as to whether charisma and charm are innate qualities which we are born with or learned personality styles. I believe it is a combination of both. Young children demonstrate a propensity for this enthusiasm. However, smart adults realize that they can get further in life when they develop these special traits.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“These people do exist and are a pleasure to know. Their keen communication skills are attentive to what you want, what you are thinking, saying, or not saying. They want to hear how you are and what you’ve been up to.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“The key is to keep charisma and charm positive and underpinned with sincere and good intentions.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“While it may seem to be a mysterious, ineffable quality—charisma is enhanced and enriched by a person’s attitude and confidence, their aims and optimism, expressive body language, and natural effervescence.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“What do confidence and command look like when you see them? Moving one step past a healthy self-esteem, they project an air of authority, respect, and deliberate intention.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Confidence is silent, cool, self-assurance.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Developing a commanding presence is essential for leadership and a powerful impact.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“There can be a fine line between being confident and cocky.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Their confidence gives those they lead the assurance that their words and their actions are reliable.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“We tend to listen to the people who believe in their own words as opposed to those who don’t. When we feel their conviction, they earn our buy-in.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“In our natural world, it is the strongest of the species that claim their space, seek out new territories, explore their surroundings, and learn how to survive and thrive. It is those same qualities that enable us to apply confidence and command to transcend the mediocre and achieve outstanding results.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When you feel low self-confidence, it is usually the result of the negative thoughts your inner critic whispers in the darkness of your mind.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When your inner critic undermines your confidence, inner conflict, anxiety, and agitation take over. It tells you that you are not good enough, smart enough, handsome enough, worthy enough, or basically just plain NOT enough. It takes a toll on your self-confidence, doesn’t it?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Notice when negativity spins in your head and disrupt it immediately before it has a chance to take hold and stick.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Self-confident people Inspire confidence in others; they would much rather build people up than tear them down.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Confidence is silent, humble self-assurance. Moving one step past a healthy self-esteem, confidence projects an air of authority, trust, and respect—a commanding, respected presence.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“I can . . . I can't. How do you speak to yourself? Do you ever feel as though you have an angel on one shoulder and a devil on the other? And they continually argue over your self-worth, competence, and personal value? Which one usually wins the debate?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Do you see dignity & grace as a state of emotional and spiritual being or a physical projection of courage and class? Perhaps they describe both.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“The radiance of dignity and grace creates a profound elegance which exists whether anyone is watching or not.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Likened to “still waters run deep,” a dignified person is able to call upon their wisdom and experience to discern a situation and expertly navigate it with grace.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Grounded by healthy self-esteem and personal self-worth, this admirable character quality can inspire awe and reverence.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Dignity is an inherent value and human virtue which represents the best of mankind.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Dignity is a gracious pride without narcissistic projection. It portrays a calm confidence and awareness regardless of the environment or circumstances.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“In spite of the circumstance, a person who abides in dignity and grace will use the lessons learned as ballast for their ship as they sail through stormy waters—taking the wisdom gained from life and using it to anchor their confidence.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Gracious pride is a powerful motivator and an exceptional quality. It drives a person to strive for excellence, keep promises, not give up, be more resilient, maintain optimism, and hold their head high while enduring challenge and change.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Gracious pride is a wonderful quality when it is used for good; it brings out the best in you and encourages the best in others.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Dignity is pride’s barometer.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“With awareness and practice, even the most awkward people can learn how to be both fluid and purposeful in their bearing.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“The voice of the inner critic is mean, unforgiving, punishing, and downright hurtful. When you allow it to run roughshod over your happiness and emotional well-being, it can wreak havoc on your peace of mind and leave you feeling anxious, fearful, and depleted.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Demoralizing self-talk leads to a self-destructive mindset, making everything in life more difficult. Not only that, how you feel about yourself oozes out of your pores and makes a bad impression on others.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“We all can give in to our inner critic. I don’t know about you, but I would never allow anyone to speak to me the way I speak to myself! I wouldn’t be their friend!” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“If you wouldn’t want to hang out with someone who was constantly bashing you with a barrage of belittling insults, why would you allow them to live in your head?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Notice what your inner critic is saying, and issue a cease and desist! Regain control. Resist, and refuse to listen.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Become your own best friend—smile and say “I love you” to yourself occasionally.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Take deliberate steps to retrain your brain and turn your inner critic into an enthusiastic, devoted fan.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Focusing your energy on the things you don’t like about yourself is self-sabotage and defeating. When you re-direct all that energy into a more positive direction, you will feel the shift instantly to improve your self-esteem and attitude.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“It is hard to earn the respect of others when you do not respect yourself. Others may find it difficult to enjoy your company if you do not enjoy your own.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Popularity does not equal respect. It is not only kids who will do what they think they must to fit in and be popular—adults do it too.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Healthy self-esteem rests upon a strong foundation of core values and an inclination to act and speak in alignment with those values.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Living in integrity with one’s principles that are held in high regard engenders respect—both from others and self.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“It is human nature for self-doubt to occasionally creep in and take up residence. It happens to even the most successful people among us.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“We all go through times of self-doubt, times when we may question our abilities and hope we can live up to the expectations of others.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“What we often forget is that most everyone else has dealt with the same struggles and uncertainties. You get to pick your response when this doubt creeps in. Will you allow it to undermine your confidence, or instead, choose to look at it objectively?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“With an objective eye, take an inventory of your successes and enlist the honest feedback of a trusted and respected mentor or peer. Chances are they see you in a better light than you see yourself!” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“28. “Remind yourself of the many victories you’ve achieved and build healthier self-esteem and perceptions on those.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Be mindful to love and appreciate yourself and become your own champion. This healthy and loving relationship will be felt when people meet you.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Love is the universal language that transcends countries, borders, barriers, and differences.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“A high self-esteem can quickly deteriorate into egotism, arrogance, and an over-confidence that can backfire and turn people off.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Your healthy self-esteem is one of the most significant and powerful drivers in your life. It drives your perceptions, attitudes, opinions, relationships, communications, and your decisions.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When you feel great about you, personal qualities radiate that make you more attractive and compelling to others.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“I simply needed to excavate passion lost by being resilient, resolving the blockages, and healing. As soon as I did, the passion, and joy, burst forth.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Think about the things in life that elicit passion in you and make you happy.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Do you have a dream or desire that is burning a hole in your soul? Something that lights your fire and brings you simple pleasure?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Love is one of our most profound emotions and enduring qualities for living a life that matters.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“This feeling of warm personal attachment and deep affection is what connects, unifies, and binds our humanity.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Approaching others with a loving heart enables you to be more caring, compassionate, and empathetic. What’s not to love about that?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Do you genuinely love people? Or at least make an effort to like them? Your first impressions will be made easier and more successful when you start with your heart.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Love can extend far beyond the people whom we know and it makes us a part of something much greater than ourselves.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Love is not only one of the greatest blessings in your personal life, but when it is extended professionally, the possibilities are endless.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When you graciously accept something from someone else, you are giving to them in return. By accepting their gift, you're allowing them to act upon what is in their heart.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Begin asking how you may be of service and you will soon discover that the true gift is in your giving.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When in doubt, give it out. Regardless of what is happening in your life, there is always someone else worse off that needs your help.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Helping another person will instantly shift your energy. As you go from being self-absorbed to focusing on others, miracles seem to happen. And incredible impressions are made.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Doesn’t it feel great when someone does something nice for you? Especially when you’re not expecting it? The irony is that they are getting as much joy by giving as you are by receiving.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“It's simple. You enrich your life when you enrich the lives of others.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“15. “We all want to be happy and feel valued. We want love, connection, respect, confidence, health, vitality, passion, kindness, and success. When you generously provide these emotions for others, you activate the law of attraction to magnetize the same experiences for you.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“We all want to be happy and feel valued. We want love, connection, respect, confidence, health, vitality, passion, kindness, and success. When you generously provide these emotions for others, you activate the law of attraction to magnetize the same experiences for you.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“For others to be generous it requires that a person accept their generosity for the cycle to be completed.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When you come to life from a heart of service, you may be surprised by the blessings you will receive in return.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“If you’re always taking, you will inevitably experience resistance and struggle. Without realizing it, you may be creating a firewall that is blocking you from receiving exactly the things you most desire.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“If you can establish yourself in the community as a giver, those people with whom you associate yourself will extend your branding far beyond you.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Speakers, coaches, consultants, thought-leaders, experts, and authors who dedicate their professional lives for the love of humanity and the betterment of society are making a positive difference in the lives of millions. These messengers of hope make our entire world a better place through their love and generosity.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Being healthy, balanced, and positive is key to making a positive first impression. How you feel about yourself sets the tone for how other people feel about you too.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Healthy self-esteem is a commanding and powerful influence, so isn’t it worth diving in deeper to ensure that you do everything possible to make your sense of self healthy, beneficial, and whole?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“While developing a healthy self-esteem is a lifetime learning process, you can take daily steps to enjoy a confident sense of well-being beginning tody.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When you have a healthy self-esteem, qualities such as likeability, confidence, trustworthiness, compassion, sense of humor, empathy, and optimism all serve to make you more interesting and successful. But unfortunately, we sometimes get in our own way . . .” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Through change and challenge, if our personal foundations are built with quality virtues of character and integrity, we are more resilient, healthy, and ultimately more impressive.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Throughout the history of mankind, the virtues embraced by humanity have remained true, unwavering, and consistent.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“While many may claim that these virtues are old-fashioned, they are essential materials for building a solid and worthwhile foundation for your life that will never go out of style.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Our modern-day society is often so consumed with external appearances that living a virtuous life may sound boring and dull. However, the love and beauty that lies deep within the human spirit resonates with plain and simple goodness.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When you take the high road to living a virtuous life, you are fortified by knowing that regardless of what life throws your way or what storms may rage, you are grounded in goodness. In this, you secure not only your own integrity, but you secure it in the eyes others.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“While having a strong character foundation may not sell newspapers, increase TV ratings, or make a person famous, it's essential for building a life that is meaningful and matters.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Have you ever known a person who was highly intelligent, yet their lack of character destroyed your impression of them? Even though they may have been accomplished, articulate, and knowledgeable, their words became impotent and irrelevant.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Making money and being prosperous is a wonderful place to be, but not at the expense of your ethics, integrity, and reputation. It is simply not worth it. It nixes any chance of creating trusted working relationships.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Desire. Enthusiasm. Purpose. Pleasure. Delight. Peace. Power. However you define passion, it is at the heart of your motivation.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Feeling passion fuels your spirit and feeds your joy.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Passion is a catalyst for action and provides you with the emotional stamina to stick with it, regardless of the obstacles.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Every day should have threads of passionate pursuits within it.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Think of the times in your life when you have been deeply passionate about something. Whether it is for your family, a cause, a person, an adventure, a hobby, a career, a love for music, or even going to the beach—your passion for it helps you tap into your unique personal power to live and love your life out loud.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“What turns you on, tunes you in, and lights your fire?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When passion is lit, the fire permeates your being with the positive expectation that all is well and everything will turn out great.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“To be truly satisfied that your life is well-lived, the object of your passion is something you feel you must be, do, or have. What lights your fire?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Passion is not just about the object of your focus or desires—it is the compelling emotion, fulfillment, and intense enthusiasm that it engenders.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Are you impressed when you meet people who are filled with passion and conviction? Their energy is contagious and can make us all want “some of what they’re having!” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When a person exudes passion, it is evident that they love what they are doing. Their passion projects an aura of confidence and decisiveness.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Sharing your passion with others will not only enlighten them to your dedication and commitment, it can enable you to garner their participation, collaboration, cooperation, and endorsement.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When we are deeply passionate about something, the obstacles or challenges are diminished by sheer will and desire.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When you want something badly enough, it does not matter whether it is going to be easy. The passion will push you forward.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When people are not passionate about their goals, everything is more of a struggle.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Passion is the fire that gets us moving and keeps us motivated regardless of what roadblocks impede the way.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When your passion is aligned with your purpose, you are unstoppable! It is in that zone of high octane congruence that you are turned on and \"cooking with gas.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Passion gives you direction. It serves as an inner compass that links you to action.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When you choose a career that is aligned with your passion, the work becomes irrelevant because anticipation and fulfillment can outweigh everything.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When employees lack passion, it is nearly impossible to deliver excellent customer service. Doesn’t it make you less inclined to want to do business with them as well?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When an employee, a team, or a company is passionate about their products and services, I am more inclined to bring them my business. Aren’t you?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“It can't be taught to all, but people who deliver exceptional work, merely by relaying their passion through what they say and do in the workplace, are priceless.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Advice to my younger self:1 Start where you are with what you have2 Try not to hurt other people3 Take more chances4 If you fail, keep trying” ― Germany Kent"},{"quote":"“Embrace who you are and your divine purpose. Identify the barriers in your life, and develop discipline, courage and the strength to permanently move beyond them, and keep moving forward.” ― Germany Kent"},{"quote":"“Seven Ways To Get Ahead in Business:1. Be forward thinking 2. Be inventive, and daring3. Do the right thing4. Be honest and straight forward5. Be willing to change, to learn, to grow6. Work hard and be yourself7. Lead by example” ― Germany Kent"},{"quote":"“There is no shortcut for hard work that leads to effectiveness. You must stay disciplined because most of the work is behind the scenes.” ― Germany Kent"},{"quote":"“Let your light shine as an inspiration to humanity and BE THE REASON someone believes in the goodness of people.” ― Germany Kent"},{"quote":"“More often than not, an inspirational or motivational speaker is someone who makes money from telling us that we can do all of the things that we can do … and pretty much all of the things that we cannot do.” ― Mokokoma Mokhonoana"},{"quote":"“A life lived outside of one's giftedness is a complete and utter travesty. It deprives the world of the beauty we each bring to our respective space(s). It leaves us all less fulfilled and enlightened.” ― Shirley Houston, Beauty, Poetry & Flow: Birthed in Travail"},{"quote":"“Sometimes we meet folks who appear rather plain, yet when they speak from a heart of service, love, compassion, and wisdom, they instantly become respected favorites.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Authenticity is the litmus test for the honesty, transparency, and trust which are necessary for healthy relationships.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Authenticity respects the ebb and flow between positive and negative. The people who really know you will understand that you are not always going to be in a happy place and an occasional bad mood is acceptable.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“By authentically sharing when things aren’t right you allow the people you care about to offer the support you may need.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Living in alignment with your true self enables you to cultivate transparency and unshakable authenticity.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Admittedly, there will be times when you must interact on a superficial level and adjust your behavior to fit in, go along and get along.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Interestingly, being yourself allows others to be themselves. Even with crazy imperfections, being a bona fide genuine person is the best any of us can be—messy flaws and all!” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Authentic people are so comfortable in their own skins they make us more comfortable in our own.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“She is so secure in her beautifully imperfect self that she would welcome you with open arms, no judgment, and complete acceptance.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Do you generally feel uncomfortable around people whom you perceive to be perfect? Is there really such a thing as the perfect person? Of course not! Our flaws are often what differentiates us from each other, and no person is perfect.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“I am a recovering perfectionist, and like all in recovery, I do better some days than others!” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Authenticity isn’t just about saying “this is who I am”—it is also about being flexible enough to recognize and appreciate the uniqueness in others—honoring the mutual respect for being authentic and true.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Why did I think that the mask was a better portrayal than my authentic self? We can get hidden under layers of illusion, can’t we?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“As a young girl, I allowed my self-esteem to be determined by others’ opinions, and I devoted incredible energy tuning into how everyone else felt.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“As a lifetime people pleaser, I remember trying to mold myself into the person I thought other people wanted me to be—all for the sake of being liked and accepted. It caused more pain than gain.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Do you really want people to like you for something that you’re not? It takes a lot of energy to pretend to be someone else for the sake of pleasing others.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Integrity is a most valued human quality.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Integrity, once tarnished, or broken, is hard to recover.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“Think of the people whom you love, like, trust, and admire. Isn’t their integrity the golden thread which elevates them to a higher standard in your eyes and in your heart?” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“1. “Being able to depend on a person’s integrity lays a solid foundation for a relationship built on trust, both in business and in life.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“7. “When a foundation is built following sound structural principles, with solid, high-quality materials, anything that is layered on top is more secure, durable, and resilient. Your integrity works the same way.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“When a foundation is built following sound structural principles, with solid, high-quality materials, anything that is layered on top is more secure, durable, and resilient. Your integrity works the same way.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“As with construction, your personal integrity is the firm foundation upon which you can build a strong character, rewarding life, and healthy relationships.” ― Susan C. Young, The Art of Being: 8 Ways to Optimize Your Presence & Essence for Positive Impact"},{"quote":"“If you are on social media, and you are not learning, not laughing, not being inspired or not networking, then you are using it wrong.” ― Germany Kent"},{"quote":"“No one else knows exactly what the future holds for you, no one else knows what obstacles you've overcome to be where you are, so don't expect others to feel as passionate about your dreams as you do.” ― Germany Kent"},{"quote":"“Don't give up when dark times come. The more storms you face in life, the stronger you'll be. Hold on. Your greater is coming.” ― Germany Kent"},{"quote":"“With God, you are stronger than your struggles and more fierce than your fears. God provides comfort and strength to those who trust in Him. Be encouraged, keep standing, and know that everything's going to be alright.” ― Germany Kent"},{"quote":"“You're going to make it;You're going to be at peace;You're going to create, and love, and laugh, and live;You're going to do great things.” ― Germany Kent"},{"quote":"“Your Monday morning thoughts set the tone for your whole week. See yourself getting stronger, and living a fulfilling, happier & healthier life.” ― Germany Kent"},{"quote":"“Hit the reset button. Whatever happened yesterday, forget about it. Get a new perspective. Today is a new day. Fresh start, begins now.” ― Germany Kent"},{"quote":"“It is more important to go slow and gain the lessons you need along the journey then to rush the process and arrive at your destination empty.” ― Germany Kent"},{"quote":"“Be around people that make you want to be a better person, who make you feel good, make you laugh, and remind you what's important in life.” ― Germany Kent"},{"quote":"“Freedom of Speech doesn't justify online bullying. Words have power, be careful how you use them.” ― Germany Kent"},{"quote":"“Preparation time is necessary for your growth. Trust and believe everything you're going through is preparing you for some request you put out into the Universe.” ― Germany Kent"},{"quote":"“Is your life story the truth? Yes, the chronological events are true. Is it the whole truth? No, you see and judge it through your conditioned eyes and mind - not of all involved - nor do you see the entire overview. Is it nothing but the truth? No, you select, share, delete, distort, subtract, assume and add what you want, need and choose to.” ― Rasheed Ogunlaru"},{"quote":"“Music is the fastest motivator in the world.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Your words control your life, your progress, your results, even your mental and physical health. You cannot talk like a failure and expect to be successful.” ― Germany Kent"},{"quote":"“Be yourself....and make the world adjust!” ― Germany Kent"},{"quote":"“Though no one can backtrack and create a brand new start, Everyone is capable of taking their life in a brand new direction.” ― Germany Kent"},{"quote":"“So much can change from one day to the next, but the one thing that always remains the same is God. Stay focused on Him. In God We Trust.” ― Germany Kent"},{"quote":"“Whether you choose to move on from your struggles and enjoy life or waddle in your misery, life will continue.” ― Germany Kent"},{"quote":"“To everyone battling a difficulty or under attack right now, smile, keep your head up, keep moving and stay positive, you'll get through it.” ― Germany Kent"},{"quote":"“Focus on your work. Do what you're great at. Don't compare yourself to others and or waste time criticizing the lives and work of others. Do what matters most to you and make a difference doing that.” ― Germany Kent"},{"quote":"“Start today creating a vision for yourself, your life, and your career. Bounce back from adversity and create what you want, rebuild and rebrand. Tell yourself it's possible along the way, have patience, and maintain peace with yourself during the process.” ― Germany Kent"},{"quote":"“Think before you click. If people do not know you personally and if they cannot see you as you type, what you post online can be taken out of context if you are not careful in the way your message is delivered.” ― Germany Kent"},{"quote":"“Every great dream has no defined parameters, out of fear we set the limitations.” ― Wayne Chirisa"},{"quote":"“A great sense of commitment builds a hardworking spirit.” ― Wayne Chirisa"},{"quote":"“A mind that is determined to succeed can never fail to achieve.” ― Harsh Malik"},{"quote":"“The true Entrepreneurship doesn't means to be your own boss, rather it is the thirst to follow your heart and work with the team of visionaries!” ― Ujjwal Chugh, How to Crack the SSB - Services Selection Board"},{"quote":"“Change begins with you. It only takes a moment to make a difference in the lives of others.” ― Bobby F. Kimbrough, Jr."},{"quote":"“Im 5 ft 1 ½. That bonus ½ is just as important because every little bit matters” ― Janna Cachola"},{"quote":"“When you are up in life your friends get to know who you are. When you are down in life you get to know who your friends are.#minoradjustments101” ― Michael L. Williams Jr., I'm a Believer: I Am What I Am"},{"quote":"“Be the solution!” ― Eugene Fields, Jr."},{"quote":"“Once a person has declared \"failure\", they cease to look for the alternate open door. When in reality it was just inches away and wide open.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“As for your failures - stop calling them failures. Refer to them as \"experiences\". That's all they really are - just experiences.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“What God wants for us is always what's best for us - we just need to trust Him.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“When we are blinded by our frustration and devastation we become oblivious to the life preserver floating inches away from us. If we take a minute to think positive, utilize our faith, and become proactive, we are able to think rationally and clearly. We then will recognize the life preserver which will keep us afloat and help us get to our destination.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Staying true to who you are is essential to anyone's success.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Who doesn't enjoy a little gardening? As we plant the seeds and remove the weeds we reap a wonderful harvest of blessings. What are the weeds? Anyone or anything that sucks the nutrients from the seeds we have planted. The seeds are our goals, desires, good thoughts and feelings. good works and deeds anything that uplifts us. If we don't keep up on our weeding then our garden will die.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Forget about what you might have lost but instead focus on what you have room to gain.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“The Lord knows all - His timing and reasoning is perfect. If we really trust Him, then we no longer see our failures as a bad thing. We will see them as an answer to our prayers even if we don't understand how in the moment.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Live each day as if it could be the last day that you spend with your husband or wife.” ― Lindsey Rietzsch, How To Date Your Spouse: A Couple's Guide to Falling and Staying in Love"},{"quote":"“The world has enough deceit, decay, and despair; be different.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“I am a firm believer that when a person makes mistakes or fails to see the bigger picture, God will remove opportunities from before them.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Don't assume that God will bless you with what you desire just because He knows your thoughts.You must ask for these blessings and act.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“As a society, let's all strive to make \"old fashioned\" the \"new fashion\". Husbands make it clear to your wives that you are on a mission to become her knight in shining armor.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“As spouses, we play a big role in the development of each other's self-confidence, self-esteem, and self-worth. An entire personality can be destroyed and a marriage ripped apart over the course of just months. It's important that husbands and wives take this subject seriously and learn to build each other up through the simple concepts of dating. It's critical that the older we get, the younger we feel. As the years pass, our attitudes towards each other and our relationships should become more positive and our lives more meaningful.” ― Lindsey Rietzsch, How To Date Your Spouse: A Couple's Guide to Falling and Staying in Love"},{"quote":"“All too often we fail to see the good in a difficult situation. Our minds are wired in such a funny way that we tend to believe just because a door closed it must be a bad thing.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“In order for us to grow we have to get our feet wet. If God put all the answers in front of us, we would never learn. We need to dig a little deeper, reach a little further, think a little harder, run a little faster, and surprisingly when we utilize our capabilities and push our limits, we begin to grow in leaps and bounds.” ― Lindsey Rietzsch"},{"quote":"“When you find a way to incorporate your goals and dreams with what you enjoy most, then you have found success!” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“It's not about what you accomplish - it's about what you take away from your experiences and how you handle them.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Sometimes when we get so caught up in our dreams we get tunnel vision. It becomes about \"me, me, me,\" and we fail to see those around us who need our help. When this happens we can expect to experience obstacles or as I like to call them, \"gentle reminders\" that we are not the center of the universe. When we are not using our talents and strengths to bless others, how can we expect the Lord to bless us?” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“(Answers to life) - You don't have to have it all figured out by a certain age or time in your life. It will come in bits and pieces along the way.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Marriage is the most sacred union in which much respect is given in society to those who treat it as such.” ― Lindsey Rietzsch, How To Date Your Spouse: A Couple's Guide to Falling and Staying in Love"},{"quote":"“Marriage can and should be the greatest thing that happens to you in this life, along with having children. We need to make the most of it and work to make it that great experience we dreamed about when we were young.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“The way you date(treat) your spouse, truly has an impact inside and outside of your marriage.” ― Lindsey Rietzsch, How To Date Your Spouse: A Couple's Guide to Falling and Staying in Love"},{"quote":"“Ask any successfully married couple what keeps their relationship alive and they will tell you, \"interest.\" It's as simple as that.” ― Lindsey Rietzsch, How To Date Your Spouse: A Couple's Guide to Falling and Staying in Love"},{"quote":"“If you want something bad enough, then do something about it!” ― Lindsey Rietzsch, How To Date Your Spouse: A Couple's Guide to Falling and Staying in Love"},{"quote":"“The more interest you show in your spouse, the more interest your spouse will show in you.” ― Lindsey Rietzsch, How To Date Your Spouse: A Couple's Guide to Falling and Staying in Love"},{"quote":"“In this changing world around us we can't help but change. Change is what makes our relationships so interesting! without it there wouldn't be anything new happening in our lives. Your job as an equal in your relationship is to look for change in your spouse and embrace it. When you show a devoted interest in every talent, hobby, desire, passion or goal that your spouse tosses on the table, you are telling your spouse that he/she is important to you. The favor will be returned tenfold. Life will become more interesting!” ― Lindsey Rietzsch, How To Date Your Spouse: A Couple's Guide to Falling and Staying in Love"},{"quote":"“Forget about trying to \"fix\" your spouse's flaws. Instead, focus your attention on aspects and characteristics that you enjoy most.” ― Lindsey Rietzsch, How To Date Your Spouse: A Couple's Guide to Falling and Staying in Love"},{"quote":"“When we are at peace within our marriage, the effects can be astounding! We will raise happier children, become better employees, and overall find the joy in life.” ― Lindsey Rietzsch, How To Date Your Spouse: A Couple's Guide to Falling and Staying in Love"},{"quote":"“Something important I have learned is patience, and turning each failure into a learning experience. ..Instead of calling them \"failures\" I call them \"lessons\". Instead of saying, \"I failed at that,\" I say, \"I learned from that.\" Each failure has taught me something incredibly valuable and by recognizing this I can see the hand of God in my life in situations where most people would feel abandoned by Him.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Sometimes we are tested with a great idea or opportunity just to see if we will act upon it, however the timing may not be right. We are being prepared for something else down the road... When we understand that all things happen for our benefit and we trust in the Lord, then we can accept what we have termed as \"failures\" knowing that in the end it will all work out and we will be happy.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Now, I don't smile because I have a perfect life or even because I'm having a perfect day - I smile because that's how I choose to deal with whatever life throws my way.” ― Lindsey Rietzsch, The Happy Lady"},{"quote":"“A closed door really is an open door in disguise.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Think about people in your own life who you have envied for one reason or another. It may surprise you to know that they do not see themselves the way that you do. Maybe they are all smiles on the outside but have personal struggles and trials that you would never guess from first glance.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Having a positive attitude gives you power. This isn't the same kind of power that dictators and warlords seek after, but rather a spiritual power. It's a power that comes to us from God.” ― Lindsey Rietzsch, The Happy Lady"},{"quote":"“What kind of legacy will you leave behind? What will your children and your children's children say about you? How will you be remembered? Will your life and decisions have inspired others to do better? Life is too short to postpone it - choose to be positive today.” ― Lindsey Rietzsch, The Happy Lady"},{"quote":"“If you have friends and family who love you unconditionally - you truly have everything!” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“If we fail to learn from our trials and errors then we truly fail.” ― Lindsey Rietzsch"},{"quote":"“Though I am a lot of things, most importantly I am human.” ― Lindsey Rietzsch, The Happy Lady"},{"quote":"“Having a positive attitude gives you the power to uplift, the power to create change, the power to motivate, the power to inspire, the power to influence, the power to cultivate happiness, and the list goes on.” ― Lindsey Rietzsch, The Happy Lady"},{"quote":"“Boredom is the Devil's delight.” ― Lindsey Rietzsch, The Happy Lady"},{"quote":"“Boredom is a positive attitude's enemy.” ― Lindsey Rietzsch, The Happy Lady"},{"quote":"“Hope is what keeps us hanging on when we feel our rope wearing out. A positive attitude is often the natural result of maintaining that hope.” ― Lindsey Rietzsch, The Happy Lady"},{"quote":"“Do we need to wait until the next life to experience true happiness? Of course not; we can experience it now. By making that choice to be happy and optimistic, we can have a little bit of Heaven on Earth.” ― Lindsey Rietzsch, The Happy Lady"},{"quote":"“There is good all around us, but we get so used to it that we forget to celebrate it. The bad and unfortunate circumstances in our lives do not deserve all of our attention and energy. Remember to look for the good and to give that your full time and attention. It makes all the difference.” ― Lindsey Rietzsch, The Happy Lady"},{"quote":"“To fail at trying is worse than to fail after trying. If we never try, then we never learn.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Putting 100% effort into \"trying\" will always make you successful. With that in mind it's important to remember that the effort part is never easy.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“If you want to know whether or not you have had a successful life, think about what people would say about you at your own funeral.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“If we let all the negative roadblocks influence us then it's only a matter of time before we end up detoured, lost, or possibly stranded on the side of the highway. Our positive attitude keeps our battery powered and our gas tank full, so that we can make it in one piece to our destination.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“The things you say, the things you don't say, the things you do, or the things you don't do are always sending a loud message to those around you. What kind of a message are you sending? Is it a true reflection of who you are?” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“If you don't have the courage to confront, you don't have the right to complain.Don't wait until anger gives you the courage!” ― Debra Fox, Finding Your Moxie: Myths and Lies Successful Women Kick to the Curb"},{"quote":"“It's vital to our survival to be positive.” ― Lindsey Rietzsch, The Happy Lady"},{"quote":"“If we never experienced the the valuable lessons from failure, then we would never truly appreciate the pure joy of our success.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“If you don't believe in yourself, who will?” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Confidence comes from within. You teach people how to perceive you, by your own example of how you perceive yourself. If you believe in yourself that confidence shines through and others will believe in you too.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“I would rather be known as someone who tried and failed, than someone who never tried at all.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“You don't have to be successful on a grand scale like winning a talent competition or writing a New York Times bestseller - if you have enough small things that you can be successful at then eventually they outshine all your failures.” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“When its no longer just about you and the sake of succeeding just to succeed, you will see miracles happen!” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“To quit is to fail - as long as you are still in the game you are succeeding!” ― Lindsey Rietzsch, Successful Failures: Recognizing the Divine Role That Opposition Plays in Life's Quest for Success"},{"quote":"“Happiness is achieved when you stop waiting for your life to begin and start making the most of the moment you are in.” ― Germany Kent"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“If you're not reaching back to help anyone then you're not building a legacy.” ― Germany Kent"},{"quote":"“As you become more present in your own life, you will begin to enlighten others by your example.” ― Germany Kent"},{"quote":"“Power up your intelligence. Hit that creativity button.” ― Germany Kent"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“Be positive. Stay happy and don't let the negativity of the world get you down.” ― Germany Kent"},{"quote":"“Once you believe that you can do something, there is not a single person in the universe who can convince you otherwise.” ― Germany Kent"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“Heartfelt communicators make such a difference in the lives of others through their authentic depth and sincere expression.” ― Miya Yamanouchi, Embrace Your Sexual Self: A Practical Guide for Women"},{"quote":"“A mentor is a person, an expert in a specific area of endeavour who trains, guides and observes a less experienced person to also become an expert through support, advice, and involvement in character building opportunities.” ― Israelmore Ayivor, Michelangelo | Beethoven | Shakespeare: 15 Things Common to Great Achievers"},{"quote":"“Book sense makes sense because someone has gone through it before and able to share it with you. Your job is to listen and discern.” ― Germany Kent"},{"quote":"“You would not be experiencing great change unless you were ready for transformation. Embrace the new you that's emerging.” ― LeeZa Donatella, Beyond the Veil of Illusion: The Awakening"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“The more positive you are the more people want to be around you and the less positive you are...well, just reverse it!” ― Germany Kent"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“Don’t waste your precious time in worrying about someone taking your place. You know God has already planned something for you. Focus on your job and you will reach the place you deserve!” ― Syed Mustafa Faraz Ahmad"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"},{"quote":"“~In motivating people, YOU've got to engage their minds and their hearts. I motivate people, I hope, by example - and perhaps by excitement, by having productive ideas to make others feel involved~” ― Rupert Murdoch"},{"quote":"“A leader does not only discover what people can do better. He teaches, guides and mentor them to do it exceptionally well. When a seed comes into contact with a leader, fruits are produced.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Funny how in a material world full of pundits and economists obsessed with assets and liabilities -personally, economically and globally - few speak about the greatest of all these…YOU.” ― Rasheed Ogunlaru"},{"quote":"“Destiny has answered it call!” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Rahman"},{"quote":"“We don't know what we can achieve because no instruction manual accompanies our birth” ― Dr. Asoka Jinadasa"},{"quote":"“Information is the most valuable commodity on the surface of the earth.” ― Adedayo Olabamiji"},{"quote":"“Don’t waste your energy & time on things you cannot change, instead pray & change your luck.” ― Syed Mustafa Faraz Ahmad"},{"quote":"“In most cases, those who want power probably shouldn't have it, those who enjoy it probably do so for the wrong reasons, and those who want most to hold on to it don't understand that it's only temporary.” ― John C. Maxwell, Becoming a Person of Influence: How to Positively Impact the Lives of Others"},{"quote":"“Recognize, manage and master your beliefs. They aren’t genetic. They are choices. Choose ones that serve you.” ― Christopher Babson"},{"quote":"“Your life today is, for the most part, a manifestation of the stories you told yourself in the past.” ― Christopher Babson, Breakout Presentations: \"WOW!\" People in Business and Life"},{"quote":"“Think, dream and expect great things. For would you rather be correct in your perception? Or would you rather be exceptional in your life?” ― Christopher Babson, Breakout Presentations: \"WOW!\" People in Business and Life"},{"quote":"“Your life is not a result of your potential, skills or desires, but of your consistent expectations and actions, which largely flow from your values and beliefs.” ― Christopher Babson"},{"quote":"“If you don’t know exactly where you are going (and why),that is exactly where you will end up.” ― Christopher Babson"},{"quote":"“Be careful what you look for and expect in life, because you will either find it or create it.” ― Christopher Babson"},{"quote":"“I didn't born to sit in the corner to cry on my luck , i was born to make the impossible possible..لم أولد لأجلس في الزاوية وأبكي على حظي ، لقد ولدت لأجعل من المستحيل ممكنا” ― Hicham LM Kamelionaire"},{"quote":"“The outcome is not up to you. The outlook is.” ― Germany Kent"},{"quote":"“When you focus on revenge, you're uploading only negativity to your system. You should focus on moving forward and enjoy the little things in life. For we know, that innocent smile of yours is a big obstacle in the eyes of the haters.” ― Fasela Oosterwolde"},{"quote":"“If you don't know exactly what you want, that is exactly what you will get.” ― Christopher Babson"},{"quote":"“Do we follow the road life’s placed before us? Or do we dare step up and forge an exceptional path. A path fraught with struggle and sacrifice, Yet one whose outcome places us in destiny’s arms.” ― Christopher Babson, Breakout Presentations: \"WOW!\" People in Business and Life"},{"quote":"“Leaders lead themselves first and foremost. Only then can they act as example and inspiration to others.” ― Christopher Babson, Breakout Presentations: \"WOW!\" People in Business and Life"},{"quote":"“Leadership reveals itself in the big moments, but is forged in the small. It is the exponential and compounding product of our many incremental behaviors and actions; all of which arise out of our choices in values, beliefs & emotions. Choices all. Not a one is thrust upon us.” ― Christopher Babson, Breakout Presentations: \"WOW!\" People in Business and Life"},{"quote":"“It is not the size of a person in the fight, but the size of the fight in a person is what determines victory.” ― Ifeanyi Enoch Onuoha"},{"quote":"“Growth or stagnation? There is no in-between. Life always seeks more of itself and death picks up the slack.” ― Christopher Babson"},{"quote":"“Inspirations are priceless & limitless.” ― Jay Danzie"},{"quote":"“It really sucks to come in second in your own life. It sucks even more to think that this is okay.” ― Robin Korth, Soul on the Run"},{"quote":"“YOU ARE WHO AND WHAT YOU DECIDE YOU ARE—NOTHING MORE, NOTHING LESS.” ― Christopher Babson"},{"quote":"“The leader acknowledges and eradicates the weeds in the garden, but keeps vision on the beauty they are creating and not on the weeds they are destroying” ― Christopher Babson, Breakout Presentations: \"WOW!\" People in Business and Life"},{"quote":"“Life is made up of Moments. Moments create Days, days create Months, months create Years, years create LIFE. Lose the Moment and you lose Life.” ― RVM"},{"quote":"“be at your best when things are at their worst.” ― Elhachemi Sabi"},{"quote":"“Dream and act HUGE my friends; for to do less is to deny who you are. And live with BOLD conviction – as you move forcefully into the certainty of your great success!” ― Christopher Babson"},{"quote":"“Motivations take you there. Tell yourself you are powerful enough to make it, and it will surprise you that.. that power will start manifesting itself.” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“I am a glass of Positivity; If you drink it,you will always find positives in you!” ― PRIYANSHU JOSHI"},{"quote":"“Follow ur mind not the rest of the world.اتبع عقلك وليس بقية العالم” ― Hicham LM Kamelionaire"}]
