[{"quote":"“Courage is the most important of all the virtues because without courage, you can't practice any other virtue consistently.” ― Maya Angelou"},{"quote":"“Keep GoingYour hardest times often lead to the greatest moments of your life. Keep going. Tough situations build strong people in the end.” ― Roy T. Bennett, The Light in the Heart"},{"quote":"“Never lose hope. Storms make people stronger and never last forever.” ― Roy T. Bennett, The Light in the Heart"},{"quote":"“Do not fear failure but rather fear not trying.” ― Roy T. Bennett, The Light in the Heart"},{"quote":"“The best way out is always through.” ― Robert Frost"},{"quote":"“When the going gets tough, put one foot in front of the other and just keep going. Don’t give up.” ― Roy T. Bennett, The Light in the Heart"},{"quote":"“Did you hear about the rose that grew from a crack in the concrete? Proving nature's laws wrong, it learned to walk without having feet. Funny, it seems to by keeping it's dreams; it learned to breathe fresh air. Long live the rose that grew from concrete when no one else even cared.” ― Tupac Shakur, The Rose That Grew From Concrete"},{"quote":"“Nothing in this world can take the place of persistence. Talent will not; nothing is more common than unsuccessful men with talent. Genius will not; unrewarded genius is almost a proverb. Education will not; the world is full of educated derelicts. Persistence and determination alone are omnipotent. The slogan 'Press On!' has solved and always will solve the problems of the human race.” ― Calvin Coolidge"},{"quote":"“Brave doesn't mean you're not scared. It means you go on even though you're scared.” ― Angie Thomas, The Hate U Give"},{"quote":"“You never know what's around the corner. It could be everything. Or it could be nothing. You keep putting one foot in front of the other, and then one day you look back and you've climbed a mountain.” ― Tom Hiddleston"},{"quote":"“Keep a little fire burning; however small, however hidden.” ― Cormac McCarthy, The Road"},{"quote":"“The three great essentials to achieve anything worthwhile are, first, hard work; second, stick-to-itiveness; third, common sense.” ― Thomas A. Edison"},{"quote":"“He was going to break my legs,” she said, her chin held high, the barest quaver in her voice. “Would you have come for me then, Kaz? When I couldn’t scale a wall or walk a tightrope? When I wasn’t the Wraith anymore?”Dirtyhands would not. The boy who could get them through this, get their money, keep them alive, would do her the courtesy of putting her out of her misery, then cut his losses and move on.“I would come for you,” he said, and when he saw the wary look she shot him, he said it again. “I would come for you. And if I couldn’t walk, I’d crawl to you, and no matter how broken we were, we’d fight our way out together—knives drawn, pistols blazing. Because that’s what we do. We never stop fighting.” ― Leigh Bardugo, Crooked Kingdom"},{"quote":"“It doesn’t matter how many times you get knocked down. All that matters is you get up one more time than you were knocked down.” ― Roy T. Bennett"},{"quote":"“The one who falls and gets up is stronger than the one who never tried. Do not fear failure but rather fear not trying.” ― Roy T. Bennett, The Light in the Heart"},{"quote":"“Persistence. Perfection. Patience. Power. Prioritize your passion. It keeps you sane.” ― Criss Jami, Killosophy"},{"quote":"“First forget inspiration. Habit is more dependable. Habit will sustain you whether you're inspired or not. Habit will help you finish and polish your stories. Inspiration won't. Habit is persistence in practice.” ― Octavia Butler, Bloodchild and Other Stories"},{"quote":"“Writers remember everything...especially the hurts. Strip a writer to the buff, point to the scars, and he'll tell you the story of each small one. From the big ones you get novels. A little talent is a nice thing to have if you want to be a writer, but the only real requirement is the ability to remember the story of every scar.Art consists of the persistence of memory.” ― Stephen King, Misery"},{"quote":"“If you have an important point to make, don't try to be subtle or clever. Use a pile driver. Hit the point once. Then come back and hit it again. Then hit it a third time - a tremendous whack.” ― Winston S. Churchill"},{"quote":"“One mistake does not have to rule a person's entire life.” ― Joyce Meyer, Any Minute"},{"quote":"“The harder you fall, the heavier your heart; the heavier your heart, the stronger you climb; the stronger you climb, the higher your pedestal.” ― Criss Jami, Killosophy"},{"quote":"“Character consists of what you do on the third and fourth tries.” ― James A. Michener"},{"quote":"“You must keep sending work out; you must never let a manuscript do nothing but eat its head off in a drawer. You send that work out again and again, while you're working on another one. If you have talent, you will receive some measure of success - but only if you persist.” ― Isaac Asimov"},{"quote":"“Unless commitment is made, there are only promises and hopes; but no plans.” ― Peter F. Drucker"},{"quote":"“Knowing trees, I understand the meaning of patience. Knowing grass, I can appreciate persistence.” ― Hal Borland"},{"quote":"“Don't ever give up. Don't ever give in. Don't ever stop trying. Don't ever sell out. And if you find yourself succumbing to one of the above for a brief moment, pick yourself up, brush yourself off, whisper a prayer, and start where you left off.But never, ever, ever give up.” ― Richelle E. Goodrich, Eena, The Tempter's Snare"},{"quote":"“The sky is not my limit...I am.” ― T.F. Hodge, From Within I Rise: Spiritual Triumph over Death and Conscious Encounters With the Divine Presence"},{"quote":"“The only things you learn are the things you tame” ― Antoine de Saint-Exupéry, The Little Prince"},{"quote":"“Unless God has raised you up for this very thing, you will be worn out by the opposition of men and devils. But if God be for you, who can be against you? Are all of them together stronger than God? O be not weary of well doing!” ― John Wesley"},{"quote":"“It is better to take many small steps in the right direction than to make a great leap forward only to stumble backward.” ― Louis Sachar"},{"quote":"“Change is hardest at the beginning, messiest in the middle and best at the end.” ― Robin Sharma, The Leader Who Had No Title: A Modern Fable on Real Success in Business and in Life"},{"quote":"“If you're waiting until you feel talented enough to make it, you'll never make it.” ― Criss Jami, Healology"},{"quote":"“When I face the desolate impossibility of writing five hundred pages, a sick sense of failure falls on me, and I know I can never do it. Then gradually, I write one page and then another. One day's work is all I can permit myself to contemplate.” ― John Steinbeck, Travels with Charley: In Search of America"},{"quote":"“No matter how much falls on us, we keep plowing ahead. That's the only way to keep the roads clear.” ― Greg Kincaid"},{"quote":"“We are made to persist.that's how we find out who we are.” ― Tobias Wolff"},{"quote":"“Whether you like it or not, you are committed to the human endeavor. I cannot ally myself with such a purely negative goal as avoidance of suffering. Suffering is a chance you take by the fact of being alive.” ― William S. Burroughs, Letters to Allen Ginsberg 1953-1957"},{"quote":"“...When you die, the energy that kept you alive filters into the people you loved. Did you know that? It's like a fire you've tended all your life, and the sparks are all scattered into the wind.... That's why we survive as long as we do, because the people who loved us keep us going.” ― Kevin Brockmeier, The View from the Seventh Layer"},{"quote":"“Do not sit still; start moving now. In the beginning, you may not go in the direction you want, but as long as you are moving, you are creating alternatives and possibilities.” ― Rodolfo Costa, Advice My Parents Gave Me: and Other Lessons I Learned from My Mistakes"},{"quote":"“If you wish to be out front, then act as if you were behind.” ― Lao-Tsze"},{"quote":"“Do it badly; do it slowly; do it fearfully; do it any way you have to, but do it.” ― Steve Chandler, Reinventing Yourself: How to Become the Person You've Always Wanted to Be"},{"quote":"“Everything passes, but nothing entirely goes away.” ― Jenny Diski"},{"quote":"“When I have tried and failed, I shall have failed.” ― Sophocles, Antigone"},{"quote":"“In my experience, nothing worthwhile has ever really been all that easy. But it certainly has been worthwhile regardless how difficult it seemed. ” ― Robert Fanney"},{"quote":"“How to win in life:1 work hard 2 complain less 3 listen more 4 try, learn, grow5 don't let people tell you it cant be done6 make no excuses” ― Germany Kent"},{"quote":"“I wrote a book. It sucked. I wrote nine more books. They sucked, too. Meanwhile, I read every single thing I could find on publishing and writing, went to conferences, joined professional organizations, hooked up with fellow writers in critique groups, and didn’t give up. Then I wrote one more book.” ― Beth Revis"},{"quote":"“The difference between perseverance and obstinacy is, that one often comes from a strong will, and the other from a strong won't.” ― Henry Ward Beecher"},{"quote":"“Clear-sightedness, persistence, and transcendence can be excellent antidotes for ultimate peace of mind and buoyancy in life, and sometimes valuable cures against social and administrative bashing. (“Sisyphus on the hill”)” ― Erik Pevernagie"},{"quote":"“They key of persistence opens all door closed by resistence ” ― John Di Lemme"},{"quote":"“I’m learning persistence and the closing of doors, the way the seasons come and go as I keep walking on these roads, back and forth, to find myself in new time zones, new arms with new phrases and new goals. And it hurts to become, hurts to find out about the poverty and gaps, the widow and the leavers. It hurts to accept that it hurts and it hurts to learn how easy it is for people to not need other people. Or how easy it is to need other people but that you can never build a home in someone’s arms because they will let go one day and you must build your own.” ― Charlotte Eriksson, Another Vagabond Lost To Love: Berlin Stories on Leaving & Arriving"},{"quote":"“We love being mentally strong, but we hate situations that allow us to put our mental strength to good use.” ― Mokokoma Mokhonoana"},{"quote":"“All I could think about as I stood there was that sometimes life gave you a tragedy that burned everything you knew to the ground and changed you completely. But somehow, if you really wanted to, you could learn how to hold your breath as you made your way through the smoke left in its wake and you could keep going. And sometimes, sometimes, you could grow something beautiful from the ashes that were left behind. If you were lucky.” ― Mariana Zapata, Wait for It"},{"quote":"“Life has moments that feel as if the sun has blackened to tar and the entire world turned to ice. It feels as if Hades and his vile demons have risen from the depths of Tartarus solely for the purpose of banding to personally torture you, and that their genuine intent of mental, emotional, and spiritual anguish is tearing you to shreds. Your heart weighs as heavily as leaden legs which you would drag yourself forward with if not for the quicksand that pulls you down inch by inch, paralyzing your will and threatening oblivion. And all the while fire and brimstone pour from the sky, pelting only you. Truly, that is what it feels like. But that feeling is a trial that won't last forever. Never give up.” ― Richelle E. Goodrich, Smile Anyway: Quotes, Verse, & Grumblings for Every Day of the Year"},{"quote":"“Intelligence entails a strong mind, but genius entails a heart of a lion in tune with a strong mind.” ― Criss Jami, Diotima, Battery, Electric Personality"},{"quote":"“Listen, Stephen King used to write in the washroom of his trailer after his kids went to sleep. Harlan Ellison wrote in the stall of a bathroom of his barracks during boot camp. Elmore Leonard got up at 5 AM every morning to write before work.Every time my alarm goes off at 5 AM and I don’t want to get up, or I would rather sit down after work and play a videogame, I think about those guys. Take care of your family. They need you and love you. Make time for them. Then stop screwing around and finish your damn book.” ― Bernard Schaffer, Whitechapel: The Final Stand of Sherlock Holmes"},{"quote":"“Life isn't as magical here, and you're not the only one who feels like you don't belong, or that it's better somewhere else. But there ARE things worth living for. And the best part is you never know what's going to happen next.” ― O.R. Melling, The Summer King"},{"quote":"“Cat, I'll let you in on a little secret. We don't all love our jobs every day. And doing something you have passion for doesn't make the work part of it any easier...It just makes you less likely to quit.” ― Kate Jacobs, The Friday Night Knitting Club"},{"quote":"“Persistence is the key to solving most mysteries.” ― Christopher Pike, Black Blood"},{"quote":"“He believed in himself, believed in his quixotic ambition, letting the failures of the previous day disappear as each new day dawned. Yesterday was not today. The past did not predict the future if he could learn from his mistakes.” ― Daniel Wallace, The Kings and Queens of Roam"},{"quote":"“Change is hard at first,Messy in the middle and gorgeous at the end.” ― Robin S. Sharma, The Monk Who Sold His Ferrari: A Fable About Fulfilling Your Dreams and Reaching Your Destiny"},{"quote":"“PRODIGY IS, AT ITS essence, adaptability and persistent, positive obsession. Without persistence, what remains is an enthusiasm of the moment. Without adaptability, what remains may be channeled into destructive fanaticism. Without positive obsession, there is nothing at all.” ― Octavia E. Butler, Parable of the Sower"},{"quote":"“The devil's happy when the critics run you off.” ― Criss Jami, Venus in Arms"},{"quote":"“There is no such thing as helplessness. It's just another word for giving up.” ― Jefferson Smith, Strange Places"},{"quote":"“Success doesn't come to you; you go to it.” ― T. Scott McLeod"},{"quote":"“The crazy creatives are the creatives who never go completely mad. They aren't so easily disheartened by the seemingly endless amounts of scrutiny that creative individuals tend to receive because they, like insanity, are the ones who feed off of opposition and negative feedback and manage to continue along with a healthy ambition. It is the crazy that teaches us to use our gifts wisely and own all the attackers.” ― Criss Jami, Diotima, Battery, Electric Personality"},{"quote":"“Creativity is paradoxical. To create, a person must have knowledge but forget the knowledge, must see unexpected connections in things but not have a mental disorder, must work hard but spend time doing nothing as information incubates, must create many ideas yet most of them are useless, must look at the same thing as everyone else, yet see something different, must desire success but embrace failure, must be persistent but not stubborn, and must listen to experts but know how to disregard them.\"[Twelve Things You Were Not Taught in School About Creative Thinking (The Creativity Post, December 6, 2011)]” ― Michael Michalko"},{"quote":"“You can'tstop dreamingjust becausethe night neverseems toend.” ― Curtis Tyrone Jones"},{"quote":"“The real test of love is loving those who we feel are the hardest ones to love.” ― Criss Jami, Killosophy"},{"quote":"“A mans life is interesting primarily when he has failed. I well know. For its a sign that he tried to surpass himself.” ― Georges Clemenceau"},{"quote":"“It may take little time to get where you want to be, but if you pause and think for a moment, you will notice that you are no longer where you were. Do not stop—keep going.” ― Rodolfo Costa, Advice My Parents Gave Me: and Other Lessons I Learned from My Mistakes"},{"quote":"“If the fire in your heart is strong enough, it will burn away any obstacles that come your way.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“Your hardest times often lead to the greatest moments of your life. Keep going. Tough situations build strong people in the end.” ― Roy Bennett"},{"quote":"“When your only regret is if anyone thinks you regret anything - that is the definition of conviction.” ― Criss Jami, Diotima, Battery, Electric Personality"},{"quote":"“One bulb at a time. There was no other way to do it. No shortcuts--simply loving the slow process of planting. Loving the work as it unfolded. Loving an achievement that grew slowly and bloomed for only three weeks each year.” ― Jaroldeen Asplund Edwards, The Daffodill Principle"},{"quote":"“You meet dozens of people who tell you you can't do it. Surround yourself with the people who believe you will do it. Seek out and spend time with those rare people who tell you, no BS, why you haven't done it yet, what it takes to do it, and how they could help you do it. Note how this advice works whether 'it' is robbing a bank, opening a gallery, or writing a bestseller. \"It\" is up to you. But you can't do it alone.” ― Heather Grace Stewart, Three Spaces"},{"quote":"“Let the man who has to make his fortune in life remember this maxim. Attacking is his only secret. Dare, and the world always yields: or, if it beat you sometimes, dare again, and it will succumb.” ― William Makepeace Thackeray, Barry Lyndon"},{"quote":"“The rewrites are a struggle right now. Sometimes I wish writing a book could just be easy for me at last. But when I think about it practically, I am glad it's a struggle. I am (as usual) attempting to write a book that's too hard for me. I'm telling a story I'm not smart enough to tell. The risk of failure is huge. But I prefer it this way. I'm forced to learn, forced to smarten myself up, forced to wrestle. And if it works, then I'll have written something that is better than I am.” ― Shannon Hale"},{"quote":"“Really, there was only one sensible thing to do. Stay the course. Pray it through, day by day, minute by minute. The Lord had an answer and it would surely come. (p. 203)” ― Janice Hanna, Love Finds You in Poetry, Texas"},{"quote":"“The practice of forgiveness is very much like the practice of meditation. You have to do it often and persist at it in order to be any good.” ― Katerina Stoykova Klemer"},{"quote":"“A friend of mine, the most innocuous dreamer who ever lived, once set a forest on fire to see, as he said, if it would catch as easily as people said. The first ten times the experiment was a failure; but on the eleventh it succeeded all too well.” ― Charles Baudelaire, Paris Spleen"},{"quote":"“A hundred failures would not matter, when one single success could change the destiny of the world.” ― Arthur C. Clarke, 2001: A Space Odyssey"},{"quote":"“Common man's patience will bring him more happiness than common man's power.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Sometimes life requires more of you than you have to give & demands you plunge into the reinvention of yourself if you truly wanna live.” ― Curtis Tyrone Jones"},{"quote":"“There are tomorrows on their way worth the struggles of today. Never give up.” ― Richelle E. Goodrich, Slaying Dragons: Quotes, Poetry, & a Few Short Stories for Every Day of the Year"},{"quote":"“No age of life is inglorious. Youth has its merits, but living to a ripe old age is the true statement of value. Aging is the road that we take to discern our character. Fame and fortune can elude us, but character is immortal. We must encounter a sufficient variety of experiences including both failures and accomplishments in order to gain nobility of character.” ― Kilroy J. Oldster, Dead Toad Scrolls"},{"quote":"“My priority is not about grades. I seek yearn for knowledge, skills and wisdom.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Why, Mr. Anderson?, Why, why?. Why do you do it? Why, why get up?. Why keep fighting?. Do you believe you're fighting...for something?.For more than your survival?. Can you tell me what it is?. Do you even know?; Is it freedom?, Or truth?. Perhaps peace?. Could it be for love?Illusions, Mr. Anderson. Vagaries of perception. Temporary constructs of a feeble human intellect trying desperately to justify an existence that is without meaning or purpose. And all of them as artificial as the Matrix itself, although... only a human mind could invent something as insipid as love. You must be able to see it, Mr. Anderson. You must know it by now, You can't win. It's pointless to keep fighting. Why, Mr. Anderson?. Why?, Why do you persist?. Agent Smith ( Matrix Revolutions Movie, 2003 ).” ― William Irwin, More Matrix and Philosophy: Revolutions and Reloaded Decoded"},{"quote":"“Trees endure the hot sun and rainstorms by sending their roots down deeper. The adversity they face is eventually the source of great stability. The harshness of the elements surrounding them causes them to seek another source of life. They will one day come to the place that even the greatest of windstorms cannot affect their ability to produce fruit.” ― John Bevere, The Bait Of Satan: Living Free from the Deadly Trap of Offense"},{"quote":"“My father says persistence is a polite way of being annoying.” ― Anthony Marra, A Constellation of Vital Phenomena"},{"quote":"“Since when is failure more appealing? Never give up.” ― Richelle E. Goodrich, Smile Anyway: Quotes, Verse, & Grumblings for Every Day of the Year"},{"quote":"“Inspiring qualities make some people to feel a little uneasy.” ― Oscar Auliq-Ice"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“Waiting is a form of passive persistence.” ― Ogwo David Emenike"},{"quote":"“Discover a purpose that gives you passion. Develop a plan that makes you persistent. Design a preparation and motivates you to optimize your potentials. Do it because you love it!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“The Motto of Champions: If you are hurt, you can suck it up and press on. If injured, you can rebound and return bigger and better...and continue to inspire!” ― T.F. Hodge, From Within I Rise: Spiritual Triumph over Death and Conscious Encounters With the Divine Presence"},{"quote":"“This path was not that of my conscious choosing. But after persistent subconscious confrontation, I have finally embraced what is, 'souly' for me...and I am thankful, when called upon, to be able to share and give to those who seek their own way of the path.” ― T.F. Hodge, From Within I Rise: Spiritual Triumph over Death and Conscious Encounters With the Divine Presence"},{"quote":"“So long as the man with ambition is a failure, the world will tell him to let go of his ideal; but when his ambition is realized, the world will praise him for the persistence and the determination that he manifested during his dark hours, and everybody will point to his life as an example for coming generations. This is invariably the rule. Therefore pay no attention to what the world says when you are down. Be determined to get up, to reach the highest goal you have in view, and you will.” ― Christian D. Larson"},{"quote":"“When teachers doubt your potential, show them how wrong they truly are.” ― Ace Antonio Hall"},{"quote":"“To persist with a goal, you must treasure the dream more than the costs of sacrifice to attain it.” ― Richelle E. Goodrich, Smile Anyway: Quotes, Verse, & Grumblings for Every Day of the Year"},{"quote":"“As if the dead really do persist, even in a bottle of wine.” ― Thomas Pynchon, The Crying of Lot 49"},{"quote":"“As long as there’s breath in You - PERSIST!” ― Bernard Kelvin Clive, 52 Seconds: Simplified Motivation - Words to Inspire"},{"quote":"“When your efforts run in the face of conventional wisdom and accepted mastery, persistence can look like madness. If you succeed in the end, this extreme originality reformulates into a new level of mastery, sometimes even genius; if you fail in the end, you remain a madman in the eyes of others, and maybe even yourself. When you are in the midst of the journey…there’s really no way of knowing which one you are.” (p.129)” ― Hilary Austen, Artistry Unleashed: A Guide to Pursuing Great Performance in Work and Life"},{"quote":"“Fight ever on: this earthly stuff If used God’s way will be enough. Face to the firing line o friendFight out life’s battle to the end. One soldier, when the fight was red,Threw down his broken sword and fled.Another snatched it, won the day, With what his comrade flung away.” ― Edwin Markham"},{"quote":"“Talent is nothing without persistence.” ― Dean Crawford"},{"quote":"“Persistence and determination are always rewarded.” ― Christine Rice"},{"quote":"“What do you mean? What do you demand of your captain? Are you then so easily turned from your design? Did you not call this a glorious expedition? And wherefore was it glorious? Not because the way was smooth and placid as a southern sea, but because it was full of dangers and terror; because at every new incident your fortitude was to be called forth and your courage exhibited; because danger and death surrounded it, and these you were to brave and overcome. For this was it a glorious, for this was it an honourable undertaking. You were hereafter to be hailed as the benefactors of your species; your names adored as belonging to brave men who encountered death for honour and the benefit of mankind. And now, behold, with the first imagination of danger, or, if you will, the first mighty and terrific trial of your courage, you shrink away, and are content to be handed down as men who had not strength enough to endure cold and peril; and so, poor souls, they were chilly and returned to their warm firesides. Why that requires not this preparation; ye need not have come thus far, and dragged your captain to the shame of a defeat, merely to prove yourselves cowards. Oh! be men, or be more than men. Be steady to your purposes and firm as a rock. This ice is not made of such stuff as your hearts may be; it is mutable and cannot withstand you if you say that it shall not. Do not return to your families with the stigma of disgrace marked on your brows. Return as heroes who have fought and conquered, and who know not what it is to turn their backs on the foe.” ― Mary Shelley"},{"quote":"“Patience and persistence are the keys... The keys to unlock doors of success... With these two virtues, you grow in reasoning and experience.” ― Ogwo David Emenike"},{"quote":"“Slight persistent effort can move you successfully forward in anything you do.” ― Kelli Wilson, The Clutter Breakthrough: Your Five-Step Solution to Freedom from Clutter Forever"},{"quote":"“Even the best inborn potentialities for achievement do not render unnecessary patient and persistent practice.” ― Ralph Alfred Habas, The Art of Self-Control"},{"quote":"“You can use the stumbling blocks to build your success.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Holding on, holding out and holding fast when the going is tough constitutes a winning mindset.” ― Ogwo David Emenike, You Are a Star"},{"quote":"“You have to conquer every obstacle, before you can reach the top of the mountain.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“I took off my sweatshirt and dropped it on the grass and set off around the track. As soon as I started running, the world changed. The bodies spread out across the green of the football field were parts of a scene remembered, not one real at this moment. The secret of effort is to keep on, I told myself. Not for the world would I have stopped then, and yet nothing- not even if I had been turned handsome as a reward for finishing- could have made up for the curious pain of the effort.” ― Harold Brodkey"},{"quote":"“Strive through your adversities with a tenacious mindset and a sincere heart and there shall surely be a great end when you get to the end unrelentingly. You shall surely leave a noble mark when you endure to the end and you shall surely smile in the end and ponder over how the journey to the end was. Note; there is no sweet fruit that is not the product of the dirty soil. No matter what, keep moving on!” ― Ernest Agyemang Yeboah"},{"quote":"“Persistence contagious.” ― Toba Beta, My Ancestor Was an Ancient Astronaut"},{"quote":"“Moja putanja spiralnog je oblika i život je postupno odmata. Sudjelujem, svakodnevno gubim ponešto slobode, umaram glasnice, ali uspjet ću već zbog toga što nisam motiviran koristoljubljem.” ― Jasna Horvat, Auron"},{"quote":"“A distaste for the new is not always fear of the unknown, but sometimes ambition. Some people don't like the new way simply because they never got a chance to master the old way.” ― Criss Jami, Killosophy"},{"quote":"“Never give up just because you failed initially” ― Sunday Adelaja"},{"quote":"“Smile baby girl, the world is full of uncertain miles.” ― Goitsemang Mvula"},{"quote":"“The slogans “hang on” and “press on” have solved and will continue to solve the problems of humanity.” ― Ogwo David Emenike"},{"quote":"“I confess, I have setbacks like anyone. But they don’t cause distress or coalesce in a mess for I’ve learned to step back, to reflect and assess where I’m at and enact a simple plan of attack — to press forward, progress; not digress, not give up nor express my despair but address what I can, my mistakes and my faults, with a head-on assault. For I’m blessed with my faith and belief and a chest that encases a heart that does not know the meaning of “quit\" or “give up\" or “there there” or “oh well”, “never-mind” or “bad luck” or “just try something else”, no. Me and myself, my reflection and I, we are not of that ilk, we aren’t ones to comply. We aren’t ones to conform or accept that the norm is a one-size-fits-all way to simply exist for we strive to be different, incredible, unique. Not irrelevant, invisible, insignificant or meek. We strive to resist and we fight to excel, so setbacks to us are a thing to be quashed, to be quelled, to be squished, to be left in our wake as we go on our way, as we sail right on by to impossible ends, to what few dare to try. This is why – this is why – as my reflection attests, there is no time to rest. The struggle is unending … but I will give it my best.” ― Shaun Hick"},{"quote":"“To grow, sometimes you must pour yourself into a new container.” ― Linsey Mills, Your Business Venture: The Prep. The Pitch. The Funding."},{"quote":"“How can we believe in reconciliation in the face of such quietly violent disregard? However, persist we must.” ― Michelle Good, Truth Telling: Seven Conversations about Indigenous Life in Canada"},{"quote":"“The winning is in the fighting.” ― Julie Anne Long, My Season of Scandal"},{"quote":"“Sonic! Wait! I have to tell you something!\"(Amy’s persistent and caring side shines through in this quote.)” ― Amy Rose"},{"quote":"“Sonic! Wait! I have to tell you something!” ― Amy Rose"},{"quote":"“I'll never give up! I’ll always be here for you!” ― Amy Rose"},{"quote":"“I’m going to make it! No matter what!” ― Amy Rose"},{"quote":"“The Great Wall of China hadn’t arisen overnight.” ― Daniel Thorman, The Zodiac Quest: A LitRPG Adventure"},{"quote":"“If at first you don’t succeed... try something different.” ― Daniel Thorman, The Zodiac Quest: A LitRPG Adventure"},{"quote":"“When boxed in, become steam. When dropped, become a wave. Always become.” ― Linsey Mills, Teach Your Child About Money Through Play: 110+ Games/Activities, Tips, and Resources to Teach Kids Financial Literacy at an Early Age"},{"quote":"“You don’t have to feel positive to keep a positive outlook.” ― Linsey Mills, Teach Your Child About Money Through Play: 110+ Games/Activities, Tips, and Resources to Teach Kids Financial Literacy at an Early Age"},{"quote":"“You deserve a life that excites you—go out and build it.” ― Linsey Mills, Your Business Venture: The Prep. The Pitch. The Funding."},{"quote":"“Money flows where discipline grows—nurture your habits, and wealth will follow.” ― Linsey Mills, Currency of Conversations: The Talk You've Been Waiting For About Money"},{"quote":"“Even the faintest flame remembers the spark that dared to ignite it.” ― Monika Ajay Kaul"},{"quote":"“Nothing in this world can take the place of persistence. Talent will not: nothing is more common than unsuccessful men with talent. Genius will not; unrewarded genius is almost a proverb. Education will not: the world is full of educated derelicts. Persistence and determination alone are omnipotent.” ― Calvin Coolidge"},{"quote":"“Sometimes, success doesn’t come quickly—it arrives after a long road, walked with patience, persistence, and quiet belief.” ― Ayoub Imilouane, Tales of Habib the Hoaxter: Sometimes Hoaxed, Always Good for a Laugh"},{"quote":"“The longest roads often lead to the greatest victories.” ― Ayoub Imilouane, Tales of Habib the Hoaxter: Sometimes Hoaxed, Always Good for a Laugh"},{"quote":"“Even the tongue and the teeth cannot cohabit without fighting” ― Adebayo Ayobami"},{"quote":"“These days, I choose to face life head-on—and I have become a comet. I arc across the sky of my life and the hard times are the friction that shaves off the worn and tired bits. The more I travel head-on, the more I am shaped, and the things that no longer work or are unnecessary drop away. It’s a good way to travel. I believe eventually I will wear away all resistance, until all that’s left of me is light.” ― Richard Wagamese , Embers: One Ojibway's Meditations"},{"quote":"“The search for truth should never cease, especially when someone perceives he or she has found it.” ― Wilson Bryan Key, The Age of Manipulation: The Con in Confidence, The Sin in Sincere"},{"quote":"“Failure isn’t just about persistence—it’s about being brave enough to try in the first place.” ― Ken Breniman, Subversive Acts of Humanity : A Survival Guide for Choosing Evolution over Self-Destruction"},{"quote":"“The wind doesn’t ask permission to move mountains. It whispers, persists, and returns—until even stone begins to shift.” ― Lawrence Nault"},{"quote":"“Hope is not naive. It’s not a passive dream. It’s a stubborn act of choosing the future again and again, even in the face of collapse.” ― Lawrence Nault"},{"quote":"“The river doesn’t rush to be heard, yet it carves stone. That’s the kind of patience we need now.” ― Lawrence Nault"},{"quote":"“There was nothing, really, that could stop life from continuing on, except for its opposite, and even then, it went on for everyone else.” ― Ilana Masad, Beings"},{"quote":"“We need to see the future to make it present.” ― Yuvraj Rathore"},{"quote":"“We need to see the future to make it present.” ― Yuvraj Singh Rathore"},{"quote":"“Science is the patient pursuit of truth, revealing the secrets of the universe one discovery at a time. Curiosity fuels inquiry, and persistence turns questions into knowledge. Every experiment, no matter how small, contributes to the vast mosaic of human understanding.” ― Shivanshu K. Srivastava"},{"quote":"“Creativity flourishes when curiosity meets discipline. Ideas alone are not enough; they must be nurtured, practiced, and refined. The greatest innovations emerge from persistent effort and a willingness to fail and learn.” ― Shivanshu K. Srivastava"},{"quote":"“We know most oftenthe only way to the other sideis through.And soI persist.Persist persist.Persist persist persist.And that is my habit.To persist.Can be good for forward movement.Doesn't make it easy to let go.” ― Shellen Lubin"},{"quote":"“Edward breathed in the sweet fragrance of the dogwood blossoms. The delicious air came into his lungs and passed into his blood, coursing through his veins with euphoric energy that he’d never experienced. He felt as strong as a hundred men as they passed out of the dogwood coppice and began the ascent up the hill. Their pace was leisurely. Edward could have run all the way to the top if he wanted, but no urge to do so imposed itself on him. For the first time in his life, Edward felt peace, down to the marrow of his bones.” ― Steven Decker, One More Life to Live"},{"quote":"“Unlike most boys, who considered their lousy luck the way the world worked, accepting it as a sheep accepts a shearing, Edward resented his fate, feeling he’d been singled out for punishment by some unforgiving force of evil.” ― Steven Decker, One More Life to Live"},{"quote":"“Give your manifestations no choice but to come to fruition. They have to because you said so. Keep affirming, visualizing, scripting, saturating, etc. Keep going and do not give up. Never give up!” ― Robin S. Baker"},{"quote":"“Home is not defined by walls; it's the unwavering sense of love and protection we carry within us, wherever we may go.” ― Ionut Alin Hoisan, Soul Journey: A Path of Resilience and Passion"},{"quote":"“In the greatest hell--in the fiercest freeze--the search for truthfocuses,the struggle for changeempowers,the quest for understanding and connectionopens our hearts,the creative venturedances within and without,and we find a way.We will find a way.” ― Shellen Lubin"},{"quote":"“If you can’t accomplish your goal with patient persistence, it probably can’t be accomplished by any means. Anger is never needed, and is most often counterproductive, since it is the result of railing against reality.” ― George Hammond"},{"quote":"“When you’re in the middle of chaos, it’s hard to see what is being built. Sometimes the evidence is all we have. I learned to allow whatever marks the world made to speak their space, and I drew around them what I could.” ― Robin Brown, Glitter Saints: The Cosmic Art of Forgiveness, a Memoir"},{"quote":"“one may sit for several hours at a stretch with one's legs crossed in the same position, if one knows that there's nothing to prevent one's changing one's position; but if a man knows that he must remain sitting so with crossed legs, then cramps come on, the legs begin to twitch and to strain towards the spot to which one would like to draw them” ― Leo Tolstoy, Anna Karenina"},{"quote":"“Sometimes the solution we were looking for is right next to us and it is far simpler than we thought. But we make it more complex than it really is. Sometimes, we are so focused on looking so far away for a solution, that we ignore the appropriate solution that is right in front of us. If you have a goal and you encounter obstacles or walls, You don’t need to break every wall that comes your way!! Sometimes you can just walk around the wall. Some people wanting to keep banging their head against the wall, not knowing there is a way around it. Or maybe there is a door in the wall or maybe there is a way to climb. Be persistent, but be informed. Keep pushing on towards your goal but adapt if things aren’t working and look for the simplest solution (By simple I don’t mean illegal). You can tackle complex problems but remember, not every complex problem requires a complex solution.” ― Anubhav Srivastava, UnLearn: A Practical Guide to Business and Life"},{"quote":"“If you have a goal and you encounter obstacles or walls, You don’t need to break every wall that comes your way!! Sometimes you can just walk around the wall. Some people wanting to keep banging their head against the wall, not knowing there is a way around it, or maybe there is a door in the wall or maybe there is a way to climb. Be persistent, but be informed. Keep pushing on towards your goal but adapt if things aren’t working and look for the simplest solution. You can tackle complex problems but remember, not every complex problem requires a complex solution.” ― Anubhav Srivastava, UnLearn: A Practical Guide to Business and Life"},{"quote":"“If you have a goal and you encounter obstacles or walls, You don’t need to break every wall that comes your way!! Sometimes you can just walk around the wall.Some people want to keep banging their head against the wall, not knowing there is a way around it, or maybe there is a door in the wall or maybe there is a way to climb.Be persistent, but be informed. Keep pushing on towards your goal but adapt if things aren’t working and look for the simplest solution.You can tackle complex problems but remember, not every complex problem requires a complex solution.” ― Anubhav Srivastava, UnLearn: A Practical Guide to Business and Life"},{"quote":"“A great example in nature of finding simple solutions but being persistent is that of a River flowing through the land.Now imagine a River. It does not matter how slowly it move. It will always find a way. And it does so by changing according to the situation. What happens when it encounters an obstacle? It adapts. It changes direction. If there is a small hole in the obstacle the water will flow through that hole. If there is a wall, the water will keep rising up until it starts overflowing. Now, if it has absolutely no option at all, it will even cut through stone over a process lasting millions of years. So, it can work “super hard” when it needs to but it knows when to spend its energy and where to spend its energy.But adapting does not mean conforming. What is the difference between stagnant water and river water? The river adapts temporarily and keeps pushing on. Stagnant water conforms completely and gives up. River water adapts to the situation only to finds it way. Stagnant water accepts the situation as its final fate. That is why River Water fuels civilizations and stagnant water just stinks.” ― Anubhav Srivastava, UnLearn: A Practical Guide to Business and Life"},{"quote":"“When your pen runs out of ink, you can stop writing - or you can buy a new pen.” ― Nitzan Hamburg"},{"quote":"“The smallest steps can lead to the greatest journeys.” ― Shivanshu K. Srivastava"},{"quote":"“Don’t let your excuses be bigger than your dreams. Every step forward is a step closer to the life you’are capable of living.” ― Manuel Corazzari"},{"quote":"“Searching for a fruitful tree is better than sitting in a fruitless garden.” ― Shaikh Mahmud bin Ilyas"},{"quote":"“Do not lose sight of the original purpose and mission. It is easy to be sidetracked along the way. Patient persistence is required for all pioneering work because you are the one digging and shoveling the ground for the first time to open a new road towards the future.” ― Master Del Pe, Inner Powers"},{"quote":"“When you are actively manifesting your own joy, it pays to be intentional and persistent, to chase it with dogged stubbornness, to insist on the cultivation of your desired experiences with all that you have.” ― Jeanette LeBlanc"},{"quote":"“When you hit an obstacle do not mourn it. Because it provides growth opportunities.” ― Masayoshi Son"},{"quote":"“OSS, Donovan's own creation, with the stamp of him on it, with the spirit of him in it, became a vivid and compelling force in many critical moments and places of war.He's a great guy, and he did an extraordinary job, and I think I know what gave him the patience, the courage, and the energy to carry on over all obstacles. He loves his country more than any man I know.But, my God, sometimes he can make you want to knock his teeth out, too.” ― Donald Downes, The Scarlet Thread: Adventures in Wartime Espionage"},{"quote":"“Years in making are years of mocking.” ― Abhijit Naskar, Rowdy Scientist: Handbook of Humanitarian Science"},{"quote":"“A journey of a thousand miles begins with a single step, but the direction defines the destination.” ― Shivanshu K. Srivastava"},{"quote":"“We are not our ideals, we are our manifestations.” ― Gabriel Dibble"},{"quote":"“Culturally we have been taught that the prolonged struggle of a mouse or a man in an impossible situation is noble. Sisyphus pushes his rock up the hill only to have it roll back down. Lacking the data to prove that persistent behaviors are always adaptive, I lean toward the opposite view—that the rodents’ mood systems’ immobility response is probably healthier than prolonged struggle. It certainly helps them survive longer under these conditions.” ― Jonathan Rottenberg, The Depths: The Evolutionary Origins of the Depression Epidemic"},{"quote":"“When you meet any form of resistance, pursue your dreams with persistence.” ― Gift Gugu Mona, Exploring the Explosive Power of Big Dreams"},{"quote":"“Every missed shot teaches you where to aim next. Success isn’t about avoiding failure—it’s about mastering the rebound.” ― Gabriel Dibble"},{"quote":"“Ever learning; ever humbled.” ― Gabriel Dibble"},{"quote":"“Hope is not always an organic emotion. Sometimes we have to consciously find it and consciously summon it. And, yes, there are big challenges right now. Maybe those challenges are insurmountable. Maybe we will be, because of social media, incapable of restoring our capacity to have a national dialogue. Maybe because of the culture that we live in right now, we will no longer be able to have conversations across disagreement. Maybe because of unchecked wealth and corporate power, we won’t be able to conquer climate change. The list goes on. Maybe. But we would be the first generation of Americans to give up on this country, and we would be the first generation of Americans who were unable to find the path forward. And I just don’t believe that we are. And I certainly believe that we don’t have to be.” ― Sarah McBride"},{"quote":"“Persistence is more important than perfection for success.” ― Debasish Mridha"},{"quote":"“The river does not rage against the rocks in its path; it simply flows around them, shaping its own course with patience and persistence. Strength is not always about resistance—it is often about adaptability.” ― Shivanshu K. Srivastava"},{"quote":"“After reaching an easy path, the walking stick should not be discarded, for there might come difficult paths again ahead.” ― Sanu Sharma, फरक [Pharak]"},{"quote":"“When I talk about persistence,it isn't about persistence of equal measure every day.It's about not giving up on whatever is important to you,and, especially, not giving up on yourself.” ― Shellen Lubin"},{"quote":"“I've written about persistenceand perseveranceand yetfor those of us with patchwork lives(projects, earnings, caretaking, home-tending,playing, friending, loving, celebrating,hurting, grieving, healing, assessing, re-grouping)persistence and perseverancehas to be allowedin patches,not what from the outside might be viewed as'normal'(for whatever worth normal has,the top of that overused bell curve).So let me clarify.When I talk about persistence,it isn't about persistence of equal measure every day.It's about not giving up on whatever is important to you,and, especially, not giving up on yourself.Some chapters of your life may allow many facets of your being,others just cannotand the feeling of failure that can arouseis of no value.Sometimes all you can do is ask yourself:What must I do this week? today? next hour?to continue the process as healthily as possible?to accomplish the most?It may be deep immersion in one,or it may be an odd mix.And tomorrow may be different.And an unexpected gift may come and change everything.And a Mack truck may hit and change everything.Our answers to those questions may not look similarbut what I hope is similaris the acceptanceof what must be.Persist in your own patches.Make your own quilt.” ― Shellen Lubin"},{"quote":"“Sometimes the answer to what is holding us back is lying deep within our own struggles. Sometimes the only thing preventing us from pursuing our dreams is ourselves.” ― Stacy Thowe, Soap Opera Digest: The Story of a Woman. A Dream. And an Endless Love"},{"quote":"“The path to greatness is paved with persistence, not perfection.” ― Aloo Denish Obiero"},{"quote":"“Without some optimal level of grit and persistence, few new businesses would ever have seen the light of day, and few New Year's resolutions would ever be kept.” ― Gad Saad, The Saad Truth about Happiness: 8 Secrets for Leading the Good Life"},{"quote":"“To be successful in our quest for happiness, we need to tackle life with the grit, determination, and persistence necessary to achieve meaningful goals, whilst possessing a protective armor against possible, even likely, failures. Successful individuals are almost always \"anti-fragile\" when it comes to failure. Theylean from their failures but are not broken by them.” ― Gad Saad, The Saad Truth about Happiness: 8 Secrets for Leading the Good Life"},{"quote":"“Rivers carve their paths with the gentle persistence of time.” ― Aloo Denish Obiero"},{"quote":"“You can never force nature. You just let it come so sure! When it's ready To spread its wings steady And dry them waiting the sun Not aware it'll be so much fun to go towards the sky. Then simply watch it fly...” ― Ana Claudia Antunes, Flat Feet: An Autobiography of a Cosmic Dancer"},{"quote":"“If the cowards who wage war Were to fight on the front lines No more discord would be on earth And no more innocent people would die -Ana Claudia (Scheurer) Antunes- great-granddaughter of a soldier killed in the First World War” ― Ana Claudia Antunes, Flat Feet: An Autobiography of a Cosmic Dancer"},{"quote":"“Having the capacity to see beyond your current circumstances, always pushes you forward and always forces you not to give in and not to give up” ― David Sikhosana"},{"quote":"“Much of the entrepreneurship journey is not primarily about cashflows, profits, balance sheets; but mostly about sacrifice, hardwork, persistence, consistency and patience” ― David Sikhosana"},{"quote":"“Naskar is made by Naskar alone, not an industry or benefactor - or more importantly, by family wealth. I had a roof over my head, food on the table, and clothes on my back - that was more than enough.I started writing with literally zero dollar in my pocket. Let me tell you how it began, because for some reason, I completely forgot a crucial event of my life when I wrote my memoir Love, God & Neurons.I once met an American tourist at a local train in Calcutta. The first thing he asked me was, had I lived in the States? I said, no. Then how come you have an American accent - he asked. Watching movies - I said. We got chatting and he told me about a book he had recently published, a memoir. I believe, this was the cosmic event that planted the thought of writing my own books in my head - I had already started my self-education in Neurology and Psychology, and I was all determined to publish research papers on my ideas, but not books. Meeting the person somehow subconsciously shifted my focus from research papers to books.So the journey began. And for the first few years, I made no real money from my books. Occasionally some of my books would climb the bestsellers list on amazon, like my very first book did, and that would keep the bills paid for several months. Then the invitations for talks started coming, but they too were not paid in the beginning. The organizers made all the travel arrangements, and I gave the talks for free. It's ironic and super confusing really - I remember flying business class, but I didn't have enough money to even afford a one way flight ticket, because I had already used up my royalties on other expenses.Today I can pick and choose which speaking invitations to accept, but back then I didn't have that luxury - I was grateful for any speaking gig and interview request I received, paid or not. One time, I gave an interview to this moderately popular journalist for her personal youtube channel, only to find out, she never released the video publicly - she posted an interview with a dog owner instead - whose dog videos had gained quite a following on social media. You could say, this was the first time I realized first hand, what white privilege was.Anyway, the point is this.Did I doubt myself? Often. Did I consider quitting? Occasionally. But did I actually quit? Never. And because I didn't quit, the world received a vast never-before seen multicultural humanitarian legacy, that you know me for today.There is no such thing as overnight success. If you have a dream, you gotta work at it day in, day out - night after night - spoiling sleep, ruining rest, forgetting fun. Persist, persist, and persist, that's the only secret - there is no other. Remember this - the size of your pocket does not determine your destiny, the size of your dedication does.” ― Abhijit Naskar, Bulletproof Backbone: Injustice Not Allowed on My Watch"},{"quote":"“The size of your pocket does not determine your destiny, the size of your dedication does.” ― Abhijit Naskar, Bulletproof Backbone: Injustice Not Allowed on My Watch"},{"quote":"“Persist, persist, and persist, that's the only secret - there is no other.” ― Abhijit Naskar, Bulletproof Backbone: Injustice Not Allowed on My Watch"},{"quote":"“Courage is the most important of all the virtues because without courage, you can't practice any other virtue consistently.”― Maya Angelou” ― Maya Angelou"},{"quote":"“If wait long enough, someone will eventually sell you the end product of what would have been the reality of your dream.” ― Erwin D. Maramat"},{"quote":"“Endurance, determination, persistence, and perseverance are important postures for the journey of progressive, positive change. Enter each day with key the attitudes of purpose, perspective, and thanksgiving. No matter what challenges come your way, assume these important postures and key attitudes as you see and seize the opportunities in every challenge.” ― Sandra C. Bibb"},{"quote":"“Endurance, determination, persistence, and perseverance are important postures for the journey of progressive, positive change. Enter each day with the key attitudes of purpose, perspective, and thanksgiving. No matter what challenges come your way, assume these important postures and key attitudes as you see and seize the opportunities in every challenge.” ― Sandra C. Bibb"},{"quote":"“The keys to unlock valuable doors are themselves expensive in either time, money, or energy. Pay the price: once you have them, they're yours forever.” ― Garry Fitchett"},{"quote":"“The path to greatness is paved with Purpose, Persistence, and Patience.” ― Aloo Denish Obiero"},{"quote":"“Dreams don't ever get old because they never lived.” ― Goitsemang Mvula"},{"quote":"“If you never go through the grief, you’ll never arrive at the growth.” ― Curtis Tyrone Jones"},{"quote":"“Sometimes the only way to it is through it and if you never go through the grief you’ll never arrive at the growth.” ― Curtis Tyrone Jones"},{"quote":"“Stand on what you've built.” ― Maria Brito, How Creativity Rules the World: The Art and Business of Turning Your Ideas into Gold"},{"quote":"“He told me, “Seymour, | love you, and I’m sorry you didn’t make Junior Sleuths, but failure is a part of life. And now that we know there’s a test, we can prepare. If you work your tail off, you can achieve it. Work hard. Do your best. Then don’t worry about the rest.” | knew this was good advice because it rhymed.” ― LAURA TRUMP, The Never-Give-Up Pup"},{"quote":"“Being a challenge to your challenges leads to success.” ― Luckson T Mabade"},{"quote":"“When a chance comes knocking, seize it, grasp it firmly, and take off with it swiftly like a speeding bullet.” ― Luckson T Mabade"},{"quote":"“The heart of a giant is never bound by the size of the man.” ― Craig D. Lounsbrough"},{"quote":"“Only one tree remained standing in a field cleared of trees. Yet that never deterred it from being a tree.” ― Craig D. Lounsbrough"},{"quote":"“It is important to dream, but then, but then,it is also important to do, to make,to attempt, to fail, to learn, to grow,to create, to devise, to fail again, to learn more,to persist, go on, hold on, keep holding on,against all odds, defying logic,and then, and only thenyou may just work a vision into being.” ― Shellen Lubin"},{"quote":"“O foot tired in climes so mysterious,Don't go down the otherside for nothing.” ― Jack Kerouac, Scattered Poems"},{"quote":"“Success is not a destination, but a journey. It's not measured by the amount of wealth or recognition you accumulate, but by the obstacles you overcome and the lessons you learn. To be successful, embrace failure as an opportunity to grow, stay focused on your goals, and never give up on your dreams.” ― hani hakkam"},{"quote":"“Some people won’t understand your wins until you show them your wounds.” ― Curtis Tyrone Jones"},{"quote":"“Martin concluded that man was born to suffer either from the turmoil of existence or the boredom of lethargy.” ― Voltaire, Candide"},{"quote":"“Just because a lot of people are saying the same thing loudly over and over, doesn't mean it's true.” ― George Saunders, The Very Persistent Gappers of Frip"},{"quote":"“...Persistence is only admirable when it isn't based in ignorance, otherwise it's called whining.” ― Penny Reid, Kissing Galileo"},{"quote":"“The sharpest doubled-edged sword has 'conviction' on one side and 'patience' on the other.” ― Garry Fitchett"},{"quote":"“Failure is the fulcrum of success.” ― Abhijit Naskar, Aşk Mafia: Armor of The World"},{"quote":"“Thought takes you only so far,Heart takes you all the way.Thought fails where logic fails,Heart keeps beating, way or no way.” ― Abhijit Naskar, Aşk Mafia: Armor of The World"},{"quote":"“When I say, ‘I’m on a fucking mission’, what I mean is that—No matter how you haters ride me, I’m gonna get on top and I’m never gonna stop until I impregnate the world with my ideas!” ― Curtis Tyrone Jones"},{"quote":"“Dreams come true not because you are rich in money, but because you are rich in persistence.” ― Abhijit Naskar, Vande Vasudhaivam: 100 Sonnets for Our Planetary Pueblo"},{"quote":"“You had three books, now you have four. This is how libraries are built, book by book, until they are burned again. Other books will arrive from across the sea for this is not the first burning. The library has burned before, it will burn again and be rebuilt. Book by book” ― Keith Miller"},{"quote":"“Persistence gives the power to a river.” ― Jayita Bhattacharjee"},{"quote":"“Persistence gives power to a river.” ― Jayita Bhattacharjee"},{"quote":"“Stevenson and Stigler – psychologists who studied Japanese and Chinese education in the early 1990s – recount an experiment they attempted to carry out on persistence in Japanese and American children. Their intention was to give students from each country a maths problem that was unsolvable in order to see how long they would keep attempting it for. However, Stevenson and Stigler weren't able to complete their study, because the Japanese teachers convinced them to drop it after trying it out with a few children. They'd found that the children refused to give up, and had carried on attempting to solve the problem for far longer than it was fair to let them try for.” ― Lucy Crehan, Cleverlands: The secrets behind the success of the world's education superpowers"},{"quote":"“Other studies have shown that not only do East Asians persist longer in the face of challenge, they are also more likely to see it out. Not only that, they are actually spurred on to work harder in the face of failure – the opposite reaction to typical Western students.” ― Lucy Crehan, Cleverlands: The secrets behind the success of the world's education superpowers"},{"quote":"“Dedicated pursuit and quality of pursuit determines quality of achievement.” ― Adeleke Aishat- Tashia"},{"quote":"“One special gift that is often overlooked is the spirit of persistence.” ― Nkwachukwu Ogbuagu"},{"quote":"“Success may not have been ‘around the corner,’ but the fact that I persisted until I was is success.” ― Craig D. Lounsbrough"},{"quote":"“Obstacles are commonplace; anyone striving for success will inevitably face them; however, if you remain steadfast, you will ultimately be triumphant.” ― Adeleke Aishat - Tashia"},{"quote":"“Greatest motivation is self-motivation.” ― Abhijit Naskar, Insan Himalayanoğlu: It's Time to Defect"},{"quote":"“Not perfection, but progress and persistence, is what life all about.” ― Vikrmn: CA Vikram Verma, Rep By Rep"},{"quote":"“3 P’s of bodybuilding: Persistence, Perseverance and Practice.” ― Vikrmn: CA Vikram Verma, Rep By Rep"},{"quote":"“The act of determining is distinct from persistence; the first term means the struggle for the right cause, and the other one describes the continuation, the view of the point or course of action, wrong or right. The consensus based on any dispute is wisdom and boldness. One has to realize the facts and be ready to accept defeat or victory rather than senseless conflict.” ― Ehsan Sehgal"},{"quote":"“ARDUOUS EASE - A HAIKURiver's kind caress,Rocks yield to its persistence, Work with ease, sheer force.” ― Amogh Swamy, On My Way To Infinity: A Seeker's Poetic Pilgrimage"},{"quote":"“Hardship of today is tomorrow's sweetness.” ― Abhijit Naskar, Rowdy Scientist: Handbook of Humanitarian Science"},{"quote":"“The soul's immortality is inferred from its likeness to its unchanging, stable, and simple objects—objects of pure thought and understanding.” ― Ærɪstɒtəl"},{"quote":"“Without persistence or resistance we can never push forward, Reach out our goals toward, defy the laws of gravity or dance!” ― Ana Claudia Antunes, Flat Feet: An Autobiography of a Cosmic Dancer"},{"quote":"“Ethical consistency, then, is a matter of persisting, of persevering beyond one's normal perseverance, even when one is no longer sure of one's direction, when one no longer feels excited about the investment one has made, when the outlines of the event are no longer obvious, and when one can no longer be sure that the truth the event names is not, in actuality, a simulacrum. The injunction to keep going demands the subject's self-sacrificing devotion to its goal even when the cost of this devotion is its own well-being, and even when it feels besieged by forces of corruption, exhaustion, and distraction. The moment the subject betrays its fidelity, it is no longer a subject, but reverts to being a mortal \"someone\" who rates her \"situation\" to be more important than truth.” ― Mari Ruti, The Singularity of Being: Lacan and the Immortal Within"},{"quote":"“Awareness is not a state you force. There is little effort involved, though persistence is key. It’s something you actively allow to happen. It is a presence with, and acceptance of, what is happening in the eternal now.” ― Rick Rubin, The Creative Act: A Way of Being"},{"quote":"“I need the gratitude--not to be happy--the joy and sweetness will come when they do--but to regain the strengthfor the struggle to keep workingto make it better.” ― Shellen Lubin"},{"quote":"“There is power in continuing to workto striveto serveto loveto do goodto clean up from badto restto questionto try to find balanceeven when the purpose is unclear,even when the value is murky,even when you can't see the path forwardand there's no end in sight.There is power in effort.There is power in persistence.There is power inContinuing on.” ― Shellen Lubin"},{"quote":"“Adversity reveals the genius of a general; good fortune conceals it.” ― Horatius"},{"quote":"“Leaves have fallen onto the snow like punctuation marks. They've held on for so long, but winter gets to us all in the end.” ― Alexandra Benedict, The Christmas Murder Game"},{"quote":"“If your passion is keeping you in poverty, don’t quit your passionate mindset! Quit your poverty mindset!” ― Curtis Tyrone Jones"},{"quote":"“Stubbornness is persistence or insistence without intelligence.” ― Augusto Branco"},{"quote":"“When things go wrong, as they sometimes will, When the road you're trudging seems all uphill, When the funds are low and the debts are high, And you want to smile, but you have to sigh, When care is pressing you down a bit, Rest if you must, but don't you quit. Life is queer with its twists and turns, As every one of us sometimes learns, And many a fellow turns about When he might have won had he stuck it out. Don't give up though the pace seems slow — You may succeed with another blow. Often the goal is nearer than It seems to a faint and faltering man; Often the struggler has given up When he might have captured the victor's cup; And he learned too late when the night came down, How close he was to the golden crown. Success is failure turned inside out — The silver tint in the clouds of doubt, And you never can tell how close you are, It might be near when it seems afar; So stick to the fight when you're hardest hit — It's when things seem worst that you must not quit.” ― John Greenleaf Whittier"},{"quote":"“The teams are always uneven, storms against humanity, but humanity's persistence wins in the end” ― Fredrik Backman, The Winners"},{"quote":"“The taste of success is so much sweeter when the tasteless have been so nasty to you!” ― Curtis Tyrone Jones"},{"quote":"“The fourth challenge we face is to unite around powerful action programs to eradicate the last vestiges of racial injustice. We will be greatly misled if we feel that the problem will work itself out. Structures of evil do not crumble by passive waiting. If history teaches anything, it is that evil is recalcitrant and determined, and never voluntarily relinquishes its hold short of an almost fanatical resistance. Evil must be attacked by a counteracting persistence, by the day-to-day assault of the battering rams of justice.” ― Martin Luther King Jr., Where Do We Go from Here: Chaos or Community?"},{"quote":"“Perseverance is the key that unlocks the door to success. When you keep pushing forward through challenges, you will eventually reach your goals.” ― Enamul Haque, The Ultimate Modern Guide to Artificial Intelligence"},{"quote":"“Patience, persistence, and perseverance have one thing in common; the positive power of passion” ― Dr. Lucas D. Shallua"},{"quote":"“Why did his heart always insist on believing that there was a light in all this darkness? Where did he keep getting new hope from, after he had been disappointed countless times?” ― Cornelia Funke, Inkdeath"},{"quote":"“I'm convinced that about half of what separates the successful entrepreneurs from the non-successful ones is pure perseverance. It is so hard. You put so much of your life into this thing. There are such rough moments in time that I think most people give up. I don't blame them. It's really tough and it consumes your life. If you've got a family and you're in the early days of a company, I can't imagine how one could do it. I'm sure it's been done, but it's rough. It's pretty much an 18-hour day job, seven days a week for a while. Unless you have a lot of passion about this, you're not going to survive.” ― Steve Jobs"},{"quote":"“It takes persistence determination to fulfil one's dream.” ― Lailah.akita@gm"},{"quote":"“So much had happened that would have caused lesser men to give up. As Ulloa wrote, theirs had been a mission marked by a \"series of labors and hardships, by which the health and vigor of all were in some measure impaired.\" But they never had, and the fact that they had kept on until they achieved these results spoke volumes about their character. La Condamine and the others may have been deeply flawed human beings---often vain, fractious, and petty---but they had proven themselves to be men of resolve and courage, Enlightenment scientists through and through.” ― Robert Whitaker"},{"quote":"“Transformation is an ongoing process… A process that requires clarity of purpose, persistence, passion and perseverance… A process that requires that I see myself and the world through God’s Word…. A process that will keep me on purpose, persistent and passionate…as long as I do not try to take control of the process...” ― Sandra C Bibb"},{"quote":"“When things go wrong, as they sometimes will, When the road you're trudging seems all uphill, When the funds are low and the debts are high, And you want to smile, but you have to sigh, When care is pressing you down a bit, Rest if you must, but don't you quit. Life is queer with its twists and turns, As every one of us sometimes learns, And many a fellow turns about When he might have won had he stuck it out. Don't give up though the pace seems slow — You may succeed with another blow. Often the goal is nearer than It seems to a faint and faltering man; Often the struggler has given up When he might have captured the victor's cup; And he learned too late when the night came down, How close he was to the golden crown. Success is failure turned inside out — The silver tint in the clouds of doubt, And you never can tell how close you are, It might be near when it seems afar; So stick to the fight when you're hardest hit — It's when things seem worst that you must not quit.” ― John Greenleaf Whittier"},{"quote":"“Being transformed requires daily practice, purpose, persistence and perseverance… During my ongoing observation of my inner thoughts, interactions with others, actions and behaviors, I have noticed progressive transformation. I am so very grateful!” ― Sandra C Bibb"},{"quote":"“There have been times when fear crippled all my senses. I let the tears run, but did not withhold my footsteps.” ― Abhijit Naskar, Esperanza Impossible: 100 Sonnets of Ethics, Engineering & Existence"},{"quote":"“Persistence and variety. These are the two primary ways to develop great ideas or to solve important problems.Keep leaning your head against a topic for a long time. Certainly for weeks, possibly for years. And along the way, try many lines of attack. Continue to generate options, explore paths, and propose silly ideas. Copy and paste concepts from widely different disciplines and see if it gets you anywhere. All the while, continue to refine the best solution you’ve found thus far.What looks like genius may simply be the byproduct of persistence and variety.” ― James Clear"},{"quote":"“Patience and persistence. Only the determined succeed.” ― Jeff Keene II"},{"quote":"“When it comes to wanting to make a difference in the world, I find that it can also be useful to break down those gigantic, all-or-nothing goals into their component parts. This way, you are less likely to get overwhelmed or exhausted, or crash into feelings of futility.None of this is defeat. What becomes defeating is when great becomes the enemy of good—when we get so caught up in the hugeness of everything that we stall out before we’ve even started, when the problems appear so big that we give up on taking the smaller steps, managing what is actually in our control.” ― Michelle Obama, The Light We Carry: Overcoming in Uncertain Times"},{"quote":"“Ambition in Motion (The Sonnet)Come hell or high water,Never let caution cripple your feet.Better to fall hard and learn a lesson,Than speculate forever with couched feet.Everything I've achieved is by trial and error,There was no handbook to aid my mission.Maps to known paths are available plenty,But there is no map to uncharted destination.You are the handbook to your ambition,Not your background or family treasures.If you persist long enough, at some point,Your persistence will outrun your failures.Better fail than frozen - failure is the foundation.Failure is the first sign of ambition in motion.” ― Abhijit Naskar, Yarasistan: My Wounds, My Crown"},{"quote":"“-PERSISTENCE- She wasn't successful yesterday, So instead of giving up, She decided to give it another try” ― Charmaine J. Forde"},{"quote":"“Persistence used to be his goal; perhaps, he once believed, if he endured more days, eventually life would come together, either ultimately or through a single event. Books and art and politics said to keep going. But while persistence was other men’s answer, their conflicts were not his. How could a man totally trust history’s advice when today, the sparrow breaks its old route and flies over that jacaranda tree and not the usual? Persistence was not Andrei’s answer. He needed deviation.” ― Karl Kristian Flores, A Happy Ghost"},{"quote":"“Ye’ve got ta’ let me go sooner or later, . . . and then ye’re gonna get sich a kickin’!” ― Terry Pratchett, A Hat Full of Sky"},{"quote":"“They told me I can’t… They ignited my determination..” ― Sally El-Akkad"},{"quote":"“To think that my destination is uncertain, Makes me strive, as success is not certain,Prevents me from giving up, as failure is also not certain,And fills my heart with hope, A hope that will get me to my destination, as uncertain as it may seem.” ― Deepa Remesh"},{"quote":"“We have to find a way to think--think things through--think beyond--go wide--go deep--together.One to One and All to All we mustConnectAffectCompromiseFind a way forwardtogether--or I truly believewe've lost all hope.” ― Shellen Lubin"},{"quote":"“We may lose battlesbut we are strongerand the only thing that can defeat us ultimatelyis our willingness to accept defeat.We cannot accept defeat.I do not accept defeat.” ― Shellen Lubin"},{"quote":"“There’s a quote of Dr. King’s that I use from time to time, which I rephrase: “To be bold, to be creative, to never give up, and never to hate—for hate is too big a burden to bear. I have decided to love.” ― John Lewis, Carry On: Reflections for a New Generation"},{"quote":"“Nothing in the world can take the place of persistence. Talent will not; nothing is more common than unsuccessful individuals with talent. Genius will not; unrewarded genius is almost a proverb. Education will not; the world is full of educated derelicts. Persistence and determination alone are omnipotent.” ― Ray Kroc, Grinding It Out: The Making of McDonald's"},{"quote":"“Learning a difficult skill takes time. But remember, the harder the skill is to learn, the more fulfilling it is when you reach the finish line.” ― Mark Joseph Aduana"},{"quote":"“Sol Bloom, chief of the Midway, emerged from the fair a rich young man. He invested heavily in a company that bought perishable foods and shipped them in the latest refrigerated cars to far-off cities. It was a fine, forward-looking business. But the Pullman strike halted all train traffic through Chicago, and the perishable foods rotted in their traincars. He was ruined. He was still young, however, and still Bloom. He used his remaining funds to buy two expensive suits, on the theory that whatever he did next, he had to look convincing. “But one thing was quite clear. . . .” he wrote. “[B]eing broke didn’t disturb me in the least. I had started with nothing, and if I now found myself with nothing, I was at least even. Actually, I was much better than even: I had had a wonderful time.”Bloom went on to become a congressman and one of the crafters of the charter that founded the United Nations.” ― Erik Larson, The Devil in the White City: Murder, Magic, and Madness at the Fair That Changed America"},{"quote":"“Tools evidence the limitations of our bare hands. But they also evidence the creativity of a determined mind.” ― Craig D. Lounsbrough"},{"quote":"“Fighting for something you believe in isn't easy. If you hit a sore spot, people are going to swipe at you, gripe at you, try to undermine you, infuriate you, try to shut you up and put you back in your box. I was starting to learn that was a sign you were asking the right questions, picking the right scabs. And though it's easy to lose yourself along the way, and start focusing on all the people who don't want things to change--for whatever broken, messed-up reasons of their own--you can easily find your way back. By listening to the people giving you a hand up. To the people who have your back. To the people who don't think you're a raving lunatic. Let them be your mirror--not the haters. Let them give you the strength to get the job done.” ― Holly Bourne, What's a Girl Gotta Do?"},{"quote":"“Treat every opportunity as though it were the last you would ever get” ― Fela Bank-Olemoh"},{"quote":"“Making popcorn is a reminder of the very valuable fact that very similar people who are given the very same opportunity in the very same environment at the very same time will not succeed or mature at the very same time, if they will manage to succeed or mature.” ― Mokokoma Mokhonoana"},{"quote":"“Why insist on chasing the shadow of something lost, when you could make something new and even greater” ― Shelley Parker-Chan, She Who Became the Sun"},{"quote":"“Great performers share a way of thinking, a set of attitudes and attributes like optimism, confidence, persistence, and strong will. They all want to push themselves to see how great they can become. These attributes and attitudes cause champions to work harder and smarter than other people as they prepare for competition. They help them stay focused under pressure and to produce their best performances when the stakes are highest.” ― Bob Rotella, How Champions Think: In Sports and in Life"},{"quote":"“You got this, even when it feels more like it, has you. Switch your ‘here goes nothing’, back to ‘here goes everything’. Turn down the noise, turn up your soul…and roll.” ― Broms The Poet, Feast"},{"quote":"“They have optimism and confidence. Because they are optimistic and confident, they react to setbacks not by getting discouraged and giving up, but with persistence. Their attitude is, “I’m not playing well right now, but when I put it all together [or our team puts it all together], I’ll really be something. I can beat anybody.” Because they persist, they get better. Because they get better, they experience success. And that success reinforces their optimism, their confidence, and their respect for their own talent. That’s the virtuous circle.” ― Bob Rotella, How Champions Think: In Sports and in Life"},{"quote":"“Learned effectiveness flows from the character traits we’ve been talking about—optimism, confidence, respect for your own talent, persistence, and commitment.” ― Bob Rotella, How Champions Think: In Sports and in Life"},{"quote":"“Gently push back, at least for one round. Cooperative people are programmed to say yes to the first reasonable proposal someone makes. To improve, you need to practice pushing back a little. A simple question that works well is: “Can you do better than that?” If the other side says no and you feel you can sustain the process for another round, ask for help understanding why that is the best they can do. If their answer makes no sense, share your confusion. You will get farther with a little polite persistence than you will by quick surrender.” ― G. Richard Shell, Bargaining for Advantage: Negotiation Strategies for Reasonable People"},{"quote":"“WHAT IS LOSTDon't cry, my childWhat is lost is never goneHold onto your dreams” ― Trisha North, Wordsmith"},{"quote":"“Persistence…born of the will and determination to keep on moving towards any given objective; even in the face of adversity…comes with the greatest rewards.” ― Michael ONeill, Road Work: Images And Insights Of A Modern Day Explorer"},{"quote":"“That is to say that at the heart of existence is that double negation, “one can not, not.” ― Verena Andermatt Conley, Hélène Cixous: Writing the Feminine"},{"quote":"“When we practice suffering we are reinforcing neural pathways associated with discomfort and behavioral persistence.” ― Simon Marshall, The Brave Athlete: Calm the F*ck Down and Rise to the Occasion"},{"quote":"“Stones in the road? I save every single one, and one day I'll build a castle.” ― Fernando Pessoa"},{"quote":"“Vegetables are defined, by the comfort they crave, Humans are defined, by the obstacles they brave.” ― Abhijit Naskar, Mücadele Muhabbet: Gospel of An Unarmed Soldier"},{"quote":"“If the situation persists, We should be able to make any necessary adjustments to ourselves” ― Senthil Kumar Mukkandi"},{"quote":"“The fastest way to get to easy is through hard.” ― Lois McMaster Bujold, Komarr"},{"quote":"“I visualized traveling the world, doing great things, and living in a home where I would be surrounded by beauty and love. Even after my parents moved away, and I was bounced around from one relative’s home to another, I decorated my makeshift rooms as best I could because I knew instinctively that I needed dignity in my life.There was no one pushing me to live a better life, or to dream; it was something I wanted for myself, and that desire fueled my seeking spirit. Through the losses and neglect of my childhood, the turmoil of my first marriage, and the battles to extricate myself from that and start over, I never gave up.There were never any limitations to my imagination. Visualization served me well—in my mind’s eye, I always saw a better life. Imagination, visualizing, and dreaming.big, combined with hard work, determination, and faith, are what got me where I wanted to go, and they can do the same for you.If you ever find your resolve melting away, tell yourself, “This time I’ll do it! This time I’ll win!” As long as you keep moving forward, despite any disappointments and setbacks, you will be on the path to victory.” ― Tina Turner, Happiness Becomes You: A Guide to Changing Your Life for Good"},{"quote":"“Honor He Wrote Sonnet 47Be the cactus, a proof of unsubmission,And blossom amidst the fiercest environment.In a world primed with the probability of hate,Be love impossible and lift all lost in lament.Aspire to expire for a cause uncausable,And your heart will shine with light untamable.When all go berserk for sect as bozos on booze,Be the sectless sapiens and stand indivisible.When all are possessed with the libido of liberty,Be the first one standing, responsible 'n righteous.In a world founded on unfounded assumptions,Be the first ink of understanding unpresumptuous.Blockheads and blockhearts have only blocked amity.It's time to unblock, unfold and undivide our psyche.” ― Abhijit Naskar, Honor He Wrote: 100 Sonnets For Humans Not Vegetables"},{"quote":"“Gently push back, at least for one round. Cooperative people are programmed to say yes to the first reasonable proposal someone makes. To improve, you need to practice pushing back a little. A simple question that works well is: “Can you do better than that?” ― G. Richard Shell, Bargaining for Advantage: Negotiation Strategies for Reasonable People"},{"quote":"“Persistence is one of the most important traits to have. Irrespective of failures or successes, you must keep marching forward if you want to reach your goal.” ― Tapan Singhel"},{"quote":"“To tie a knot at the end of your rope means that you have a rope as well as the ability to tie a knot. And while that’s not necessarily great news, imagine what things would be like without a rope or ability.” ― Craig D. Lounsbrough"},{"quote":"“Like a child building a new toy with a heap of Lego blocks, I reassembled the useful pieces from the debris of my old life with patience, persistence and a strong belief that a better life was possible.” ― Ranjani Rao, Rewriting My Happily Ever After - A Memoir of Divorce and Discovery"},{"quote":"“Sometimes your passion takes work and you shouldn't give up on it just because it isn't easy...[Owen Michaels, as quoted by daughter Bailey]” ― Laura Dave, The Last Thing He Told Me"},{"quote":"“The giant tree you see today was once a small seed that held its ground.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Your possibilities are limited only by your imagination.” ― Abhijit Naskar, Generation Corazon: Nationalism is Terrorism"},{"quote":"“Watching my grandfather work taught me that not everything was fluid. There were certain things that you hit from different angles, but you never gave up on. You did the work that was needed, wherever that work took you. [Hannah Hall]” ― Laura Dave, The Last Thing He Told Me"},{"quote":"“Standing up is the easiest part, but standing up, again, is the part where it needs all of your strength, courage, love, discipline, motivation, determination, persistence, it requires every bit of your soul to stand again, and again, and again.” ― Sarvesh Jain"},{"quote":"“When someone sees you headed in a direction, and that person throws a brick into the road, that is the precise moment to forge onward, with greater velocity, toward your destination.” ― Cicely Tyson, Just as I Am"},{"quote":"“You want to understand humans? That is what makes us—and art—what we are. That choice to keep getting back up and trying again in the face of suffering and injustice and despair.” ― Shveta Thakrar, Star Daughter"},{"quote":"“Today's struggle is tomorrow's strength, today's setback is tomorrow's comeback.” ― Amit Kalantri, Wealth of Words"},{"quote":"“If everything you wanted was possible in one shot, you would never get a chance to cherish the real victory filled with your relentless perseverance and unbreakable commitment.” ― Hiral Nagda"},{"quote":"“Cultivate an attitude of persistence that will allow you to become stronger.” ― Dawn C. Crouch, Ballet Helps Everything!: Ten Reasons Why"},{"quote":"“You can succeed in the pursuit of your dreams by your own persistence enthusiastic effort.” ― Lailah Gifty Akita"},{"quote":"“With persistence effort, you can succeed in the pursuit of your dreams.” ― Lailah GiftyAkita"},{"quote":"“Fight with anybody who comes in a way of achieving your dream. Don't back down. Never back down.” ― Sarvesh Jain"},{"quote":"“A broken candle still lights, a broken crayon still colors.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Life is tough, but you are tougher.” ― Amit Kalantri, Wealth of Words"},{"quote":"“When you fail, know that your past is anonymous to the world, so you might as well go about life as if you’ve had a good day.” ― Karl Kristian Flores, The Goodbye Song"},{"quote":"“Until GOD puts you through the \"University of Adversity\"---you don't learn to trust GOD. In the STORM is where you find out what you are made out of....and how GOD is ABLE TO BRING YOU THROUGH your Trials and your Storms. Your Storm is Nothing More than a STEPPING STONE TO YOUR DESTINY. Straight through the Storm is your Best Course to Take. PERSISTENCE IS ESSENTIAL TO GET YOU TO YOUR PRIZE...KEEP YOUR EYES ON YOUR PRIZE!” ― John Hagee, Storm Proof: 100 Days of Triumph Over Trouble &#x1f4d6; Devotional &#x1f64f; by John Hagee"},{"quote":"“Endure to end, this is spirit of purposeful persistence.” ― Lailah Gifty Akita"},{"quote":"“Do what you can with what you have where you are, and God will do the rest.” ― T.F. Tenney, The Main Thing...Is to Keep the Main Thing the Main Thing"},{"quote":"“Self confidence is a super power. Once you start to believe in yourself, magic starts happening.” ― Oscar Auliq-Ice"},{"quote":"“The Key To Find What You Want,Is To Keep Seeking.” ― Mike Ssendikwanawa"},{"quote":"“In one day, God can deliver from an addiction that has held a person captive for years. In one day, God can bring back a prodigal child who has run away and been gone for decades. In one day, God can provide more than someone has accumulated in a lifetime. But if we are going to experience a miracle one day, we need to pray every day. Too many people pray like they are playing the lottery. Prayer is more like an investment account. Every deposit accumulates compound interest. And one day, if we keep making deposits every day, it will pay dividends beyond our wildest imagination.” ― Mark Batterson, Draw the Circle: The 40 Day Prayer Challenge"},{"quote":"“...it's the prayers you pray when you feel like you want to quit praying that can bring the biggest breakthroughs.” ― Mark Batterson, Draw the Circle: The 40 Day Prayer Challenge"},{"quote":"“If you do not get discouraged, you can reach your destination with persistence determination.” ― Lailah Gifty Akita"},{"quote":"“Persevere against all odds & struggles. They are nothing but a toughened pathway to your glorious shiny destiny.” ― Hiral Nagda"},{"quote":"“A harvest doesn't grow overnight. All seeds planted have a season to produce results. Plant, water, sunshine, love and repeat.” ― Corletia Banks, Sorry, This Book is All Out of Words!"},{"quote":"“If you are tired of doing the work.You are tired of winning.” ― Janna Cachola"},{"quote":"“You aren't able to manifest what you are not doing or becoming.” ― Janna Cachola"},{"quote":"“She tried to put that together with the burbling roar of the crowd, the overlapping music, the lake and the sky; it was too big. She tried to take it in anyway, feeling the world balloon inside her, oceans of clouds in her chest, this town, these people, this friend, the Alps—the future—all too much. She clutched his arm hard. We will keep going, she said to him in her head—to everyone she knew or had ever known, all those people so tangled inside her, living or dead, we will keep going, she reassured them all, but mostly herself, if she could; we will keep going, we will keep going, because there is no such thing as fate. Because we never really come to the end.” ― Kim Stanley Robinson, The Ministry for the Future"},{"quote":"“Treat every opportunity as though it were the last you would ever get.” ― Fela Bank-Olemoh"},{"quote":"“Let the globe, if nothing else, say this is true:That even as we grieved, we grewThat even as we hurt, we hopedThat even as we tired, we tried” ― Amanda Gorman, The Hill We Climb: An Inaugural Poem for the Country"},{"quote":"“There's a fine line between heroic persistence and foolish stubbornness. Sometimes the best kind of grit is gritting our teeth and turning around” ― Adam Grant, Think again: the power of knowing what you don’t know"},{"quote":"“Every sunrise gives us the opportunity to begin again with the morning lights of love, with the power of persistence and with the magic of gratitude.” ― Debasish Mridha"},{"quote":"“Stubbornly persist, and you will find that the limits of your stubbornness go well beyond the stubbornness of your limits.” ― Robert Brault"},{"quote":"“إنّ عذاب النفس بثباتها أمام المصاعب والمتاعب لهو أشرف من تقهقرها إلى حيث الأمن والطمأنينة. فإن صُرعنا نموت كالشهداء، وإن تغلبنا نعيش كالأبطال” ― جبران خليل جبران, الأجنحة المتكسرة"},{"quote":"“No matter what conditions look like around you—keep on believing, keep on persisting—keep on going—keep on growing. Just like wildflowers grow wherever they choose, no matter the conditions—be and be becoming all that you were created to be and become.” ― Sandra C Bibb"},{"quote":"“Le monde est trop grand pour mes pieds mais je poursuivrai.” ― Laurent Gaudé, Eldorado"},{"quote":"“Jaynes (1976) suggested that task persistence is a uniquely human strength. With some exceptions, most animals do not persist at any given task longer than 20 minutes before moving on to the next task.” ― Christopher Peterson, Character Strengths and Virtues: A Handbook and Classification"},{"quote":"“Remember if it was easy you'd already have done it.” ― Lindsay Miles, Less Stuff: Simple Zero-Waste Steps To A Joyful And Clutter-Free Life"},{"quote":"“The moment you realize there is incredible beauty in not knowing.” ― Azra Gregor"},{"quote":"“The path to success is usually paved with the bricks of failure.” ― Molly M. Cantrell-Kraig"},{"quote":"“If you keep standing on the verge of greatness, you'll eventually get the opportunity to leap into it.” ― Curtis Tyrone Jones, Giants At Play: Finding Wisdom, Courage, And Acceptance To Encounter Your Destiny"},{"quote":"“والمرء لا تعذبه الاضطهادات إذا كان عادلاً، ولا تفنيه المظالم إذا كان بجانب الحقّ، فسقراطُ شرب السم مبتسمًا، وبُولُس رجم فارحًا” ― جبران خليل جبران"},{"quote":"“Real treasure is not about what we found. Rather, it’s about the fact that we finally found it.” ― Craig D. Lounsbrough"},{"quote":"“You must always turn a negative into a positive. Your power lies within. Your ability to come back after a set back is as strong as you allow it to be.” ― Liz Faublas"},{"quote":"“Without persistent effort, enthusiasm is vain hope.” ― Lailah Gifty Akita"},{"quote":"“A dream come true through much activity.” ― Lailah Gifty Akita"},{"quote":"“Genes don't carry dreams, not hereditarily that is, determination does.” ― Abhijit Naskar, Martyr Meets World: To Solve The Hard Problem of Inhumanity"},{"quote":"“There is no miracle, only persistence.” ― Abhijit Naskar, Martyr Meets World: To Solve The Hard Problem of Inhumanity"},{"quote":"“Of course, perseverance does not guarantee success, but success is often unattainable without it.” ― Christopher Peterson, Character Strengths and Virtues: A Handbook and Classification"},{"quote":"“Several studies have found that people are less likely to persist on difficult or unsolvable problems if they have already exerted self-control on a prior task, such as attempting to control their thoughts or emotions or resisting the temptation to eat chocolates and cookies. Some recent evidence suggests that the capacity for self-control is enhanced by positive emotions, and there is evidence that people in good moods persist longer (and perform better) at solving tasks.” ― Christopher Peterson, Character Strengths and Virtues: A Handbook and Classification"},{"quote":"“It's not enough to just know the goal. We have to do the work!” ― Lindsay Miles, Less Stuff: Simple Zero-Waste Steps To A Joyful And Clutter-Free Life"},{"quote":"“Passion, Practice & Persistence will Produce Perfect Performance” ― Sijin Bt"},{"quote":"“The physical is subordinate to the imaginary. Sight capitulates to a fervent dream. The present can't resist the persistence of an imagined future.” ― Abiodun Fijabi"},{"quote":"“If you don't plant anything do not expect a harvest.” ― Germany Kent"},{"quote":"“And when you are fighting for your dreams and the world is beating the life out of you; many times you might be tempted to try to take a shortcut. Asking yourself: \"Isn't there an easier way?” ― Dr. Lucas D. Shallua, Average to Abundant: How Ordinary People Build Sustainable Wealth and Enjoy the Process"},{"quote":"“I find it helpful to see the world as a slot machine that doesn’t ask you to put money in. All it asks is your time, focus, and energy to pull the handle over and over. A normal slot machine that requires money will bankrupt any player in the long run. But the machine that has rare yet certain payoffs, and asks for no money upfront, is a guaranteed winner if you have what it takes to keep yanking until you get lucky. In that environment, you can fail 99 percent of the time, while knowing success is guaranteed. All you need to do is stay in the game long enough.” ― Scott Adams, How to Fail at Almost Everything and Still Win Big: Kind of the Story of My Life"},{"quote":"“Your now isn't your always.” ― Molly M. Cantrell-Kraig, Circuit Train Your Brain: Daily Habits That Develop Resilience"},{"quote":"“My greatest fear is failing to fear. If I fear failure, I will never learn anything.” ― Tirzah Libert"},{"quote":"“I don't have a college degree, I don't come from money or from an academic family, I didn't have any resourceful acquaintance to speak of, yet today I am at the forefront of humankind's struggle for inclusion, justice and equality. All I had was a vision and an unending persistence. Each failure made me even more stubborn towards my vision - each failure gave me an inexplicable bliss that carried me further.” ― Abhijit Naskar, Sleepless for Society"},{"quote":"“Success is not the result of making one good choice, of taking one step. Real success requires step, after step, after step, after step. It requires choice after choice, it demands life-long education and passion and commitment and persistence and hunger and patience.” ― Jesmyn Ward, Navigate Your Stars"},{"quote":"“Losing is only permanent if you stop trying.” ― Marieke Nijkamp, The Oracle Code"},{"quote":"“An end is only an end because we haven’t taken the time to find the door in the wall.” ― Craig D. Lounsbrough"},{"quote":"“Often you have to start over many times before you find the right path.” ― Jiu Er, We Were Made For Each Other!"},{"quote":"“Hope crushed is never hope killed.” ― Craig D. Lounsbrough, The Eighth Page: A Christmas Journey"},{"quote":"“Whatever menaced, harassed, warned, I passed impetuous by. Still bright on clouds of suffering dim Shines that soft, solemn joy.” ― Charlotte Brontë, Jane Eyre"},{"quote":"“It was almost over. He was almost there. He had never, not once in his life, felt this powerful.” ― Patrick Ness, More Than This"},{"quote":"“Stability is a part of working to improve yourself by focusing on the positive and remaining persistent.” ― Ari Gunzburg, The Little Book of Greatness: A Parable About Unlocking Your Destiny"},{"quote":"“It is that magical, frightening moment, that we need to pinpoint. Recognize it and then move past it. That moment, when everything inside, when everyone around you, says to quit, to give up, you can’t do this, that’s the moment you must stand up, you must dig deep within yourself, and make it happen.” ― Ari Gunzburg, The Little Book of Greatness: A Parable About Unlocking Your Destiny"},{"quote":"“They say if you don't bend, you break. I say it's better to break for a purpose than to bend for nothing.” ― Abhijit Naskar, Time to End Democracy: The Meritocratic Manifesto"},{"quote":"“Wake up, start walking and stop not till the world is lifted.” ― Abhijit Naskar, Time to End Democracy: The Meritocratic Manifesto"},{"quote":"“Persistence and consistency are like nail and finger. Always point forward even when the hand/arm is tired.” ― Goitsemang Mvula"},{"quote":"“We the experts in cognitive and behavioral sciences can predict human behavior but not human potential. What this means is that, though we can tell how a person is likely to feel, think and behave in a certain situation, we still cannot tell what a person is capable of. Hence the possibilities that a person holds in their neurons are immeasurable.” ― Abhijit Naskar, Good Scientist: When Science and Service Combine"},{"quote":"“A veteran of failure is harder, robust, and more durable than a billion-pound diamond rock.” ― Anas Hamshari, Businessman With An Affliction"},{"quote":"“Most folks greet confusion with surrender. Most people, when they don’t know what to do, do nothing. The average person meets an obstacle and tells himself, \"This is not for me,\" or \"I amnot the kind of person who does things like this.\" Average people respond to confusion in an average way. They stop. But people who achieve extraordinary results think differently. They understand something very significant about confusion.Confusion precedes learning. The anxious thoughts that seem so puzzling or discouraging are actually your very gateway to understanding. Only by persistently doing battle with the things you cannot yet do or that which you do not yet understand can you ever hope to achieve what average people never accomplish.A sign of a person’s maturity is his ability to live with — even in — confusion. The average person meets the edge of confusion and turns away. He runs from confusion at its beginning, at its first appearance. He will not live with or even near confusion and seeks an easier path.The mature person—the high achiever — will understand that life’s grand prizes are guarded by confusion. The mature person senses the victory that exists beyond confusion and says, \"I cannot do this... yet. I am not good at this yet, but I will work and learn and become better until I am competent, then excellent, then great! I will struggle and persist through confusion until I break through to the understanding or greater skill required for victory.\"It's a thought process. It opens up new possibilities for almost everything. The whole concept of \"confusion before learning\" means that confusion guards the answers we seek. You've got to be willing to enter into and do battle with the confusion in order to reach the victory on the other side... to take your life in a new and incredible direction.” ― Andy Andrews, The Noticer Returns: Sometimes You Find Perspective, and Sometimes Perspective Finds You"},{"quote":"“When you have exhausted all possibilities, remember this, you haven't.” ― Thomas Edison"},{"quote":"“If water makes a hole in rock, with a single steady drop, then we can move worlds with persistence.” ― Ari Gunzburg, The Little Book of Greatness: A Parable About Unlocking Your Destiny"},{"quote":"“「持續」並非未來，只不過是「過去的結果」。當你想要「持續下去」而去思考未來時，在精神上就會造成負擔。不過，倘若想著「我只要做今天一天就好！」，那可就輕鬆了。總之，就只做今天。現在，我要盡全力做。” ― 樺沢 紫苑, ムダにならない勉強法"},{"quote":"“過去和未來都只是單純的意識問題，既然沒有時光機，人類就只能活在「現在」而已。然而，大多數人都會回首「過去」或思忖「未來」，導致不安、情緒低落、失去幹勁，無法持續下去。” ― 樺沢 紫苑, ムダにならない勉強法"},{"quote":"“Ever since I started my work of world building I haven't taken a single day of rest - absolute, uncorrupted devotion to the cause, that's the only road to success.” ― Abhijit Naskar, Time to End Democracy: The Meritocratic Manifesto"},{"quote":"“Move ahead with an emboldened chest and let all obstructions turn to dust as they collide with your gargantuan determination.” ― Abhijit Naskar, Time to End Democracy: The Meritocratic Manifesto"},{"quote":"“Everybody falls - make your fall spectacular and rise like a god, so that watching you even the voiceless regain their voice and the weak regain their strength.” ― Abhijit Naskar, Time to End Democracy: The Meritocratic Manifesto"},{"quote":"“Cometh The Day by Stewart StaffordAll his life, he'd just been a pawnAnd each day, another false dawnThen the vagaries of the stateBecame his to dictateAnd his enemies never looked so forlorn.© Stewart Stafford, 2020. All rights reserved.” ― Stewart Stafford"},{"quote":"“I don't ask you to live by my words, I ask you to die for your purpose.” ― Abhijit Naskar, Time to End Democracy: The Meritocratic Manifesto"},{"quote":"“Go back?\" he though. \"No good at all! Go sideways? Impossible! Go forward? Only thing to do!\" So up he got, and trotted along [...]” ― J.R.R. Tolkien, The Hobbit"},{"quote":"“When beset with doubt in troubled times, and those about you will understand if you come unglued, stay the ground, and face the challenge. For when you stand alone to confront life's highest mountains, the next shall be easier to climb.” ― R.J. Intindola"},{"quote":"“Passion is like fire. For a fire to happen, three things are essential: a combustible material, high temperatures, and fuel.” ― Dele Ayo Bankole"},{"quote":"“And it irritated me beyond all measure that a thought so enormous and ludicrous should return when my logic had dismissed it.” ― Clark Ashton Smith"},{"quote":"“Remind yourself that successful salespeople love their product and their company, and they love to sell and prospect. If you don’t have that kind of love on most days and most of every day, then it is time to make a change. Or better yet, re-sign on the dotted line and start over. Doing the same things over and over again and expecting a magic carpet ride across the world is pitiful thinking and the kind of reasoning that will keep you poor with a capital “P”.” ― Chris J. Gregas"},{"quote":"“Be reminded that dreaming and hoping is not the same as scheming and working. Working for the sake of it will not insure you of success but purposeful, meaningful work will help you move the needle towards what you want for you and your family. When is the last time you “sweat” in the process? When is the last time you worked a few hours more than all those in your company? When is “hustle” more to be desired than pacing yourself?” ― Chris J. Gregas"},{"quote":"“Sometimes you have to swim through a bit of darkness if you’re ever going to surface in the light.” ― Sara Ella, Coral"},{"quote":"“Brick walls are not there to keep us out, they are there to show us how much we want something.” ― Randy Pausch, The Last Lecture"},{"quote":"“Be broken, but also, be brave. Your enemies are counting on you to break. The world around is counting on you to breakthrough.” ― Jamie McIntosh"},{"quote":"“Joy is a flower that pain grows best.” ― Karl Kristian Flores, Can I Tell You Something?"},{"quote":"“Well, Nicky, I hate to point out the obvious, but here's this tiny bird that's been trying to get through a huge bulletproof glass wall. A totally impossible situation. You tell me it's been here every day pecking away persistently for ten minutes. Well, today the glass came down.” ― Kevin Kwan, Crazy Rich Asians"},{"quote":"“With will one can do wonders.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Psychiatrists say unrealistic expectations lead to depression, but why else are we alive if not to dream? Every expectation is unrealistic until it is made a spectacular reality through inspiration, hard work, and persistence.” ― Stewart Stafford"},{"quote":"“If you truly can dedicate your life to one single mission, no matter the nature of the mission, then sooner or later the mission itself will pave its own way for you to keep on walking - so, close your eyes, visualize your mission and take the leap of faith.” ― Abhijit Naskar, Aşkanjali: The Sufi Sermon"},{"quote":"“Those Who Call You Mad (The Sonnet)Those who call you mad will one day worship you,For no great achievement is possible without madness.Those who laugh at you will one day learn from you,For working through the laugh is a criteria for greatness.Those who know not you exist will one day seek your guidance,For your endless sacrifice will make you a beacon.Those who find you absurd will one day bow in veneration,For the absurd ideas take us to the most breathtaking destination.Those who look down on you will one day look up to you,For your sacrifice will place you on a pedestal of glory.Those who are deaf to you will one day cross limits for you,For your voice will echo in the hearts as a purifying symphony.Those who see you inconsequential will one day pay you homage.Breathe your mission, live your mission and your acts will forge fate's foliage.” ― Abhijit Naskar, Mad About Humans: World Maker's Almanac"},{"quote":"“Be the standard of quality in this world where excellence is void and unexpected.” ― Louise Philippe Dulay"},{"quote":"“Those who call you mad will one day worship you,For no great achievement is possible without madness.” ― Abhijit Naskar, Mad About Humans: World Maker's Almanac"},{"quote":"“The only sacred power is persistency of purpose.” ― Lailah Gifty Akita"},{"quote":"“Keep knocking! The door can be opened only with persistent knocks!” ― Lailah Gifty Akita"},{"quote":"“Quitting is not a problem; not knowing when or why to quit and being a quitter is the problem.” ― Kayambila Mpulamasaka"},{"quote":"“Passion, Patience, and Persistence are the ingredients to be an entrepreneur.” ― Jawo"},{"quote":"“Build a door if opportunity is yet to knock.” ― Princess Dr. Mercy Uwakwe"},{"quote":"“Staying in peace when living in the world requires a daily practice of persistence and faith in the Word of God. A built in compass of where I should go and what I should do.” ― Sandra C. Bibb"},{"quote":"“The most useful form of patience is persistence.Patience implies waiting for things to improve on their own.Persistence implies keeping your head down and continuing to work when things take longer than you expect.” ― James Clear"},{"quote":"“So when your mind tells you to quite or give up, you tell it to SHUT UP. Then you go about your healthy business. Believe me, it will listen after awhile of being persistent.” ― Harken Headers, Health & Not Screwing It Up"},{"quote":"“We should walk through the valley of the shadow of death, not just pitch a tent and camp there.” ― Stan Gardner, M.D."},{"quote":"“A beating heart takes a heart's beating.” ― Karl Kristian Flores, Can I Tell You Something?"},{"quote":"“Whatever you do, do it with your whole being. Become one with that act. Forget thirst, hunger, sleep, sex, and give your whole existence to one idea - an idea to which you can boldly and unhesitantly point and say \"this idea is me\". You and your idea must become one, for that idea to become a reality.” ― Abhijit Naskar, Mad About Humans: World Maker's Almanac"},{"quote":"“Fall down but never back down.” ― Abhijit Naskar, When Call The People: My World My Responsibility"},{"quote":"“No fall can incapacitate the sacrificial fervor.” ― Abhijit Naskar, When Call The People: My World My Responsibility"},{"quote":"“Determination plus Persistence equals Achievement” ― Stanley T. Crawford, Determine Persist Achieve"},{"quote":"“Don't give upThe difference between HEREand THERE is the letter Tand the T stands for TIME” ― Obimuyiwa Gabriel"},{"quote":"“persistence beats stupidity” ― Rod Pennington, Better Choices"},{"quote":"“Our motto must be, \"Non-Resistant Persistence.” ― Marnie Swedberg, Flow Through Vessel: How to Master the Habit of Letting God Flow Through You"},{"quote":"“Be hopeful even in the bleakest of situations, GOD will soon reward your faith.” ― TemitOpe Ibrahim"},{"quote":"“Possible lies in persistence.” ― Lailah Gifty Akita"},{"quote":"“You'll jigsaw [the broken pieces of yourself] together however you can, caulk in the odd bits with willpower wherever they don't quite fit, ignore the occasional sounds of grinding and cracking. As long as nothing important breaks, right? You'll get by. You have to.” ― N.K. Jemisin, The Fifth Season"},{"quote":"“Sometimes the universe uses ridicule as a tool to turn you into a titan and tighten up all your loose screws.” ― Curtis Tyrone Jones"},{"quote":"“Failure embraces everyone, but only experts know, how to slip her the tongue.” ― Curtis Tyrone Jones"},{"quote":"“Persist. Even when you’re heavy with emotion, pick yourself up bringing the axe of your actions down, repeatedly chopping at the day until you bring the sun low with success.” ― Curtis Tyrone Jones"},{"quote":"“To challenge myself to great things is to patiently and persistently expend myself in enduring all of the little things that make up every great thing.” ― Craig D. Lounsbrough"},{"quote":"“Just keep going. Everybody gets better if they keep at it.” ― Ted Williams"},{"quote":"“Other studies have also found unusual levels of persistence in even very young Asian children. For example, the cross-cultural psychologist Priscilla Blinco gave Japanese and American first graders an unsolvable puzzle to work on in solitude, without the help of other children or a teacher, and compared how long they tried before giving up. The Japanese children spent an average of 13.93 minutes on the puzzle before calling it quits, whereas the American kids spent only 9.47 minutes. Fewer than 27 percent of the American students persisted as long as the average Japanese student — and only 10 percent of the Japanese students gave up as quickly as the average American. Blinco attributes these results to the Japanese quality of persistence.” ― Susan Cain, Quiet: The Power of Introverts in a World That Can't Stop Talking"},{"quote":"“If she reached deep inside herself, what would she find? Not the Force, of course. But there was something there-an iron core. Determination. Tenacity. Stubborn persistence. She'd gotten herself out of that First Order interrogation chair, after all. She just had to live through one moment, and then the next, and then the next. She just had to keep going-until she had a better hand.” ― Delilah S. Dawson, Black Spire"},{"quote":"“Don't doubt yourself, that's what haters are meant for, they wait for you to make mistakes; So why doubt your abilities, Take that steps and make your haters wait for ever” ― Adenekan Mayowa"},{"quote":"“Svaki svoj neuspjeh nagradite novom upornošću. Nikada ne odustajte od sebe i posla koji volite. I kada vam kažu da to ništa ne valja, vi se i dalje držite svog 'plana', sve dok u to vjerujete, i uživate u tome.” ― Stanka Gjurić, Istina o sreći"},{"quote":"“Even though cultural changes cannot be measured on a day-to-day basis, changes that accrue over decades must be pursued daily.” ― Lynn Domina, Understanding A Raisin in the Sun: A Student Casebook to Issues, Sources, and Historical Documents"},{"quote":"“Nearly completed in each instance, the wind blew the robin’s nest out of the aspen tree four times in a row. And I greatly admired the fact that in the face of such frustrating misfortune the robin’s rebuilt their nest those four times, when we as humans probably wouldn’t have done it but once or twice. Or maybe less.” ― Craig D. Lounsbrough"},{"quote":"“Let not the seasons, nor the sun nor the stars nor the moon, or planets make a timetable for your life.” ― Frank A. Carlyle"},{"quote":"“I had to work extremely hard to maintain perspectives during my emotional lows, but in the process I was forced to cultivate grit, persistence, patience.” ― Monjyoti Bhattacharyya, A Relentless Pursuit of the Truth - A philosophical guide to living a life of fulfillment and meaning"},{"quote":"“Intelligence is like the solar output, it is not always constant, but continuous it can be. - On Intelligence” ― Lamine Pearlheart, Walking the Soul"},{"quote":"“You can't make anyone do anything, but you can knock on doors until the right one opens.” ― Jolene Stockman, Total Blueprint for World Domination - Illustrated"},{"quote":"“If there is anything I’ve learned the last year it is the importance of being clear on what you want. I spent the better part of last year just figuring out what I actually want with my life. What I want to have around me, how I want to spend my days, the people I want in my life, what I want to create, why it’s important to me and most importantly who I need to be in order to create that life for myself. Who do I need to be to have that career I’m dreaming of? When you can see the highest version of yourself crystal clear you will wake up each day striving to walk in new ways. You see that future YOU as a role model and you are filled with energy to grow and level up and take that place. If you want a change, you really do need to let go of how you have done things in the past. It’s the most exciting feeling, stepping into that future vision of myself, a little bit every day.” ― Charlotte Eriksson"},{"quote":"“The only place that a defeat becomes a defeat is when I make it so in my mind.” ― Craig D. Lounsbrough"},{"quote":"“What are you here to do?What are you uniquely good at?Add do that the importance of doing it persistently, being dogged.There are massive returns to doggedness.” ― Daniel Pink"},{"quote":"“Nhìn một cách nào đó, tri thức và trí thức đích thực ở đâu cũng vậy, - luôn hiện hữu theo mẫu tồn tại của dòng nước. Khi không may mắn được là thác lũ thét gào, thì nó vẫn cứ trôi chảy dẻo dai theo các hình dạng khác nhau băng qua mọi chướng ngại vô minh để đi về phía trước.” ― Nguyễn Như Huy"},{"quote":"“Just as Geppetto persisted in his false wish to make his created toy into a real boy, even so you must persist with Pinocchio’s nose and courage in the belly of the fish, until the fairy of the universe waves her wand, enchants your dreams and gives genuine life to your every wish.” ― Curtis Tyrone Jones, Guru In The Glass: A Mysterious Encounter While Dying To Live The Unlived Life"},{"quote":"“The natural consequence of diligence and persistence is competence and success.” ― Vincent Okay Nwachukwu, Weighty 'n' Worthy African Proverbs - Volume 1"},{"quote":"“Persistent endeavour is the grace to keep you going towards the pursuit of your goals against the great odds.” ― Lailah Gifty Akita"},{"quote":"“Persistence prayers prevails.” ― Lailah Gifty Akita"},{"quote":"“Going to gym for 5 minutes might not transform your body, but it does reaffirm your identity.” ― James Clear"},{"quote":"“I have a goal: learn to play guitar in five months and be ready for the New Slits gig. I feel like a contestant on the reality-TV showFaking It. Take a bored Hastings housewife and turn her into a punk-rock guitarist in five months.[...]I ignore the pain of the wire cutting into the pads of my fingers. I don’t watch TV, read newspapers, meet anyone for coffee or lunch or do anything that will take a second away from my playing. I just do the minimum I have to do domestically and that’s it. Everything else stops. I take the guitar with me wherever I go, it’s always in the back of the car; if my daughter’s at a tennis lesson, I sit in the car, push the front seat back and practice whilst I wait for her.” ― Viv Albertine, Clothes, Clothes, Clothes. Music, Music, Music. Boys, Boys, Boys"},{"quote":"“Countless great ideas are at this moment gathering dust in files and boxes simply because their owners didn't stick with them.” ― Sam Harrison, Creative Zing! Spark Your Creativity & Powerfully Present Your ideas Spark Your Creati"},{"quote":"“What matters is that no matter how many times we fail ourselves, we keep striving to do the things that keep us healthy and allow us to be happy.” ― Jessica Marie Baumgartner, Walk Your Path: A Magical Awakening"},{"quote":"“Setting a goal that may look a bit unreasonable at first feeds me with the needed energy and motivation to be persistent until I reach it.” ― Marcel Nickler, Running the Sahara: A diary from the desert and beyond"},{"quote":"“Like the phoenix, we rise; like the eagle, we soar.” ― Princess Dr. Mercy Uwakwe"},{"quote":"“Failure isn’t absolute.” ― Brigid Kemmerer, A Curse So Dark and Lonely"},{"quote":"“What is often called exceptional ability is nothing more than persistent endeavor.” ― Pauli Murray"},{"quote":"“Because we can keep on. Others, they try keeping on, they just...” she mimed an explosion. “It’s too much for them. They come to pieces. Not us. Hunters, they are different. We can’t stop. Not for bad sleep or parachute dreams or people who say we should want peace and babies instead. It’s a world full of mad wolves, and we hunt them til we die.” 61%” ― Kate Quinn, The Huntress"},{"quote":"“But then we get exhausted and we wonder if we can accomplish any of the things we hope for, without destroying ourselves in the process. We ask ourselves if it's time to quit.” ― Emily Nagoski, Burnout: The Secret to Unlocking the Stress Cycle"},{"quote":"“To succeed at anything worthwhile in life requires persistence, no matter how gifted, fortunate, or passionate you are. When I interviewed late bloomers for this book, nearly every one said that once you find your passion and your \"pot,\" you need to hang in there--you need to persist.” ― Rich Karlgaard, Late Bloomers: The Power of Patience in a World Obsessed with Early Achievement"},{"quote":"“Part of moving forward often involves stumbling a few steps back.” ― Cathy Burnham Martin, Encouragement: How to Be and Find the Best"},{"quote":"“If the road is easy, it’s probably easy because it’s not a road and you’re not on it.” ― Craig D. Lounsbrough"},{"quote":"“We're not soldiers,\" I said. \"We're just trying to keep everyone alive, and fed, and free.\"Ghazia laughed. \"What is that if not rebellion, when those who rule you want you hungry and indentured?” ― Betsy Cornwell, The Forest Queen"},{"quote":"“Persistence can change failure into extraordinary achievement.” ― Marv Levy"},{"quote":"“I watched a squirrel fall from a rather high branch. Upon hitting the ground, he bounced slightly, paused, shook himself vigorously and then immediately scampered back up to the very same place on the very same branch from which he’d fallen. There are some that might call that stupidity. Then there are others like myself who would call that tenacity. And while I generally have no interest in being a squirrel, in this particular respect I wouldn’t mind being like one.” ― Craig D. Lounsbrough"},{"quote":"“There is most joy in virtue when 'tis hardest won.” ― Marcus Annaeus Lucanus"},{"quote":"“Re-wilding is a story of nature's amazing capacity to rebound. It tells of the resilience of birch and pine, the dogged persistence of badger and fox, of dandelion and vine, the dark and voiceless worlds of algae and fungi.” ― Per Espen Stoknes, What We Think About When We Try Not To Think About Global Warming: Toward a New Psychology of Climate Action"},{"quote":"“If we don’t change voluntarily, change will change us, but change has to happen in all circumstances. No one can stop the change.” ― Sukant Ratnakar, Open the Windows"},{"quote":"“The Spirit is as much a jealous lover as the ego. Both guard their path with an uncompromising passion but for very different reasons.” ― Donna Goddard, Circles of Separation"},{"quote":"“Sometimes you have to go through hell to create your own paradise.” ― Tirzah Z.B. Libert, Go Ahead, You're Home: The Caribbean Dream with Grit & Guts"},{"quote":"“Fortitude creates winners and champions that aren't always perfect but perfectly persistent” ― ALLENE VANOIRSCHOT, Daddy's Little Girl"},{"quote":"“Listen to me boy,' the poet declared, 'here’s a little piece of advice from me about what it takes to write. Buy a notebook. Sit down and write something on the first page—write whatever you like. A poem, a story, doesn’t matter, just write. The next day, wake up, tear out that first page, rip it up, and throw it in the fire. Or in the garbage, all the same, the important thing is that you throw it out. The next day, write some more—again you’ll be on the first page, right? On the third day, wake up, tear it out, crumple it up, and throw it out, then sit back down and write! You follow me? Keep going until you are out of pages in your notebook. Then go and buy a new notebook and start all over again . . . That’s it. Somewhere around your tenth notebook you might have something worthwhile.” ― Hristo Karastoyanov"},{"quote":"“The greatest investment you'll ever make is investing in you.” ― Wesam Fawzi"},{"quote":"“If you don't accept \"no,\" don't give up, and don't bow to the status quo, a window of opportunity will eventually crack open and you'll be standing in front of it. If it doesn't crack open, just keep prying with a crowbar until it gives.” ― Anthony Iannarino, The Only Sales Guide You'll Ever Need"},{"quote":"“Only the strong appreciate the warmth emanating from those who can turn obstacles into fuel.” ― Garry Fitchett"},{"quote":"“Every obstacle in life can be melted by your undying persistence focus on the goal at hand.” ― ANIKOR Daniel"},{"quote":"“Expecting difficulties is wise, if that usually gives you the strength to continue, and foolish, if that usually takes away the courage to begin.” ― Mokokoma Mokhonoana"},{"quote":"“Many of the interdependent mammals, birds, and corals may be vulnerable, living precariously close to the extinction cliff, but nature is also wild and robust, and swings back if given the smallest crack in the concrete. Witness the dandelions.” ― Per Espen Stoknes, What We Think About When We Try Not To Think About Global Warming: Toward a New Psychology of Climate Action"},{"quote":"“Persistence breaks resistance.” ― AYODEJI AYORINDE"},{"quote":"“Change never stops; how can we?” ― Sukant Ratnakar, Open the Windows"},{"quote":"“Those who aim high know what it takes to feel the skies on the tip of their wings and would encourage you to fly with them. Those who sour grape from below would want nothing but for people to fall for that is their only means to feel taller.” ― Erwin D. Maramat"},{"quote":"“Success in any area of life does not come easily, nor does it come overnight. It is an ongoing process that requires persistence, humility, and determination.” ― Tirzah Libert"},{"quote":"“Make a decision to keep pressing forward. Keep believing and keep stretching until you see your dream fulfilled.” ― Joel Olsteen"},{"quote":"“The little step, long continued—the very gradual but persistent advance—is sure to attain its end.” ― Lord Robert Montagu"},{"quote":"“Everything's great 'til something goes wrong.” ― Tripsy South"},{"quote":"“Writing a book, just like building a library, is an act of sheer defiance. It is a declaration that you believe in the persistence of memory.” ― Susan Orlean, The Library Book"},{"quote":"“Pain, anguish and suffering in human life are always in proportion to the strength with which a man is endowed.” ― Alexandre Dumas, The Man in the Iron Mask"},{"quote":"“A river cuts through rock, not because of its power, but because of its persistence.” ― James N. Watkins"},{"quote":"“In the diary you find proof that in situations which today would seem unbearable, you lived, looked around and wrote down observations, that this right hand moved then as it does today, when we may be wiser because we are able to look back upon our former condition, and for that very reason have got to admit the courage of our earlier striving in which we persisted even in sheer ignorance.” ― Frank Kafka"},{"quote":"“Nature is a constant reminder of the beauty of consistence, the utility of patience and persistence, the vanity of arrogance, and the necessity of impermanence.” ― Mokokoma Mokhonoana"},{"quote":"“But I apprised you that I was a hard man,\" said he, \"difficult to persuade.\"\"And I am a hard woman—impossible to put off.\"\"And then,\" he pursued, \"I am cold: no fervour infects me.\"\"Whereas I am hot, and fire dissolves ice. The blaze there has thawed all the snow from your cloak; by the same token, it has streamed on to my floor, and made it like a trampled street. As you hope ever to be forgiven, Mr. Rivers, the high crime and misdemeanour of spoiling a sanded kitchen, tell me what I wish to know.\"\"Well, then,\" he said, \"I yield; if not to your earnestness, to your perseverance: as stone is worn by continual dropping.” ― Charlotte Brontë, Jane Eyre"},{"quote":"“That’s the thing I’ve learned about mountains: the joy you feel at scaling them is in direct proportion to how high and impassable the peak appears to be once you’re on the other side of it.” ― Marie Bostwick, Just In Time"},{"quote":"“I will understand perfectly if you don’t want to answer, but I will just keep pestering you until you do.” ― Douglas Adams, Dirk Gently's Holistic Detective Agency"},{"quote":"“I am you, one day out of five, Tired, empty, hating what I carry But afraid to lay it down, stingy, Angry, doing violence to others By the sheer freight of my gloom, Halfway home, wanting to stop, to quitBut keeping going mostly out of spite.” ― Tracy K. Smith, Wade in the Water: Poems"},{"quote":"“Then his lungs seemed to open up again, each breath going deeper than the one before. His sneakers (not blinding white Adidas, just ratty old Pumas) seemed to shed the lead coating they had gained. His previous lightness of body came rushing back. It was what Milly had called the following wind, and what pros like McComb no doubt called the runner's high. Scott preferred that. He remembered that day in his yard, flexing his knees, leaping, and catching the branch of the tree. He remembered running up and down the bandstand steps. He remembered dancing across the kitchen floor as Stevie Wonder sang \"Superstition.\" This was the same. Not a wind, not even a high, exactly, but an elevation. A sense that you had gone beyond yourself and could go farther still.” ― Stephen King, Elevation"},{"quote":"“The Fifth Law: With persistence success can come at any time.” ― Albert-László Barabási, The Formula: The Universal Laws of Success"},{"quote":"“So I stood up, pretending I had moreBreath than I had been feeling that I had,And said: \"Lead on! I'm strong. I have no fear.” ― Dante Alighieri"},{"quote":"“Remember we are Pirates. We never compromise.When there is no way, there is trust and persistence.” ― Isbelle Razors, Reflective Dogma"},{"quote":"“Suffering is in proportion to the strength which has been accorded to a person; in other words, the weak suffer more, where the trial is the same, than the strong. And, what are the elementary principles, we may ask, which compose human strength? Is it not - more than anything else - exercise, habit, experience?” ― Alexandre Dumas, The Man in the Iron Mask"},{"quote":"“Be exceptional amongst exceptional people.” ― Wesam Fawzi"},{"quote":"“I'm a very smart guy. I haven't a feeling or a scruple in the world. All I have the itch for is money. I am so money greedy that for twenty-five bucks a day and expenses, mostly gasoline and whiskey, I do my thinking myself, what there is of it; I risk my whole future, the hatred of the cops and of Eddie Mars and his pals. I dodge bullets and eat saps, and say thank you very much, if you have any more trouble, I hope you'll think of me, I'll just leave one of my cards in case anything comes up.” ― Raymond Chandler, The Big Sleep"},{"quote":"“The only thing that stands between dreams and reality is persistence.” ― Abhijit Naskar, Conscience over Nonsense"},{"quote":"“If you truly believe in something, don’t give up on it.” ― Mark Kilens"},{"quote":"“Practice places mind in your muscles.” ― Amit Kalantri, Wealth of Words"},{"quote":"“The way to get to the top of the heap in terms of developing original research is to be a fool, because only fools keep trying. You have idea number 1, you get excited, and it flops. Then you have idea number 2, you get excited, and it flops. Then you have idea number 99, you get excited, and it flops. Only a fool would be excited by the 100th idea, but it might take 100 ideas before one really pays off. Unless you're foolish enough to be continually excited, you won't have the motivation, you won't have the energy to carry it through. God rewards fools.” ― Martin Hellman"},{"quote":"“Keep calm dear soul.Someday, we shall meet a day without an end where all patiently waited and strive for will await us. You shall no longer be heckled in the course of your unfiltered loving self, because all the love you've shown in chivalrous, will ungovernably come to you.” ― Prince Promise"},{"quote":"“The answer is always \"no\", if you don't ask.” ― Cheri M. Partain"},{"quote":"“Simply giving something a try’ and giving-up due to not getting instant results, will never get the ‘best’ out of our efforts, the best comes after as many ‘tries’ as it takes for getting the ‘best’ out of our efforts.” ― Shahenshah Hafeez Khan"},{"quote":"“Some people are a degree of impatience away from expecting shade from a seed.” ― Mokokoma Mokhonoana"},{"quote":"“Reality is a mental construct, as such it is mouldable, be it a personal reality or a social reality, but it can only be moulded by the persistent.” ― Abhijit Naskar, Time to Save Medicine"},{"quote":"“Don't let the illusion of destiny keep you from doing what you love to do - for nothing is meant to be, or not to be - it is only your willful and persistent action that determines your destiny.” ― Abhijit Naskar, Every Generation Needs Caretakers: The Gospel of Patriotism"},{"quote":"“If you give up on your dreams, let that crush you and destroy you, even if just a little, if your children are watching. Otherwise, when you're telling them that they must pursue theirs, they will look at you and say \"you didn't and you're doing just fine.” ― Darnell Lamont Walker"},{"quote":"“Those who really fight has no time to cry.\"وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ الْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ” ― Muhammad Mamduh"},{"quote":"“Edward could make the very devil pray, if such were his desire.” ― Kate Morton, The Clockmaker's Daughter"},{"quote":"“Impatience is even more unfortunate in the talented.” ― Mokokoma Mokhonoana"},{"quote":"“... you know that soft is stronger than hard, water stronger than rocks, love stronger than force.” ― Hermann Hesse, Siddhartha"},{"quote":"“She introduced people to the A.T., and at the same time she made the thru-hike achievable. It didn’t take fancy equipment, guidebooks, training, or youthfulness. It took putting one foot in front of the other—five million times.” ― Ben Montgomery, Grandma Gatewood's Walk: The Inspiring Story of the Woman Who Saved the Appalachian Trail"},{"quote":"“Sometimes my successes come quickly and at other times they are terribly slow to arrive. It is not my place to determine the speed at which they arrive or if they arrive at all. My place is to keep forging ahead no matter what.” ― Craig D. Lounsbrough"},{"quote":"“A kite can't soar without some kind of force against it.” ― Dakota Kirk"},{"quote":"“Through persistence to a clear vision, the dreamer comes to understand that no matter how unlikely, taboo, or youthful these dreams may appear to be, the belly of the earth can and will still stretch with the conception of the new dream as sure as the belly of a woman can and will stretch with the conception of new life.” ― Curtis Tyrone Jones, Sleeping With Enormity: The Art Of Seducing Your Dreams & Living With Passion"},{"quote":"“Successful people aren't born successful. Behind it all there is hardwork, persistence and a lot of grit.” ― Arshad Wahedna"},{"quote":"“Your darkest shadows can only be less than your brightest light.” ― Benjamin Aubrey Myers"},{"quote":"“Perseverance requires great patience.” ― Haresh Sippy"},{"quote":"“If I could understand that every ‘reality’ was once a ‘wish’, and that it moved from the latter to the former because someone was committed enough to make it so, I’d be the person that I want verses the person I’ve become.” ― Craig D. Lounsbrough"},{"quote":"“When I first stopped trying to fix other people, I turned my attention to 'curing' myself. I was in a hurry to get this healing process over. I wanted immediate recovery from the effects of growing up in a family riddled with alcoholism and from being married to an alcoholic. I looked forward to the day I would graduate from Al-Anon and get on with my life. As year two and year three passed, I was still in the program. I began to despair as the character defects I had worked so long to overcome came back to haunt me, particularly during times of stress and during periods when I didn't attend meetings.I have severe arthritis in my joints. To cope with my condition, I have to assess my body each day and patiently respond to its needs. Some days I need a warm bath to get going in the morning. On other days I apply a medicated rub to the painful areas. Yet other days some light stretching and exercise help to loosen me up. I'ave accepted that my arthritis will never go away. It's a condition I manage daily with consistent, on-going care.One day I made a connection between my medical condition and my struggle with recovery. I began to look at myself as having 'arthritis of the personality,' requiring patient, continuous care to keep me from 'stiffening' into old habits and attitudes. This care includes attending meetings, reading Al-Anon literature, calling my sponsor, and engaging in service. Now, as long as I practice patience, recovery is a manageable and adventurous process instead of an arduously sought end point.” ― Al-Anon Family Groups, Hope for Today"},{"quote":"“We can't give up just because the Universe does.” ― Isaac Asimov"},{"quote":"“Dreams Come True When You're Committed To Make Them So!” ― Wesam Fawzi"},{"quote":"“Brainstorm until your dreams roll in like thunder & your passion strikes with the love in your eyes.” ― Curtis Tyrone Jones, Sleeping With Enormity: The Art Of Seducing Your Dreams & Living With Passion"},{"quote":"“As it comes down, carefully situate the sun on yourself like a paper crown, so the light of the universe never sets on your dreams.” ― Curtis Tyrone Jones, Mirrors Of The Sun: Finding Reflections Of Light In The Shittiness Of Life"},{"quote":"“Persistence refines the miserable piece of carbon in you into the purest form of diamond.” ― Tobi Delly, 25 Things you Must Have Before age 25"},{"quote":"“Be armed with purpose, persistence and intention and the enemy called defeat will choose another to battle.” ― Daisy Gallagher, How To Succeed In A Testosterone World Without Losing Estrogen"},{"quote":"“The more you do it, the easier it will be to repeat it. If you have many successes, it’s easier to have them again.” ― Ibrahim Mustapha, The Confident Speaker: Tools to Overcome Your Fear in Public Speaking"},{"quote":"“Those who dig for water and give up, make potholes. Those who persist and dig deep, make a well.” ― L.A. Golding, Lerkus: A Journey to End All Suffering"},{"quote":"“I did not survive this long by being fragile, and I have found other ways to get what I need.” ― Shane Arbuthnott, Terra Nova"},{"quote":"“Pray , if you must prevailed.” ― Lailah Gifty Akita"},{"quote":"“To Achieve What So Few Have Achieved, Do What So Few Do.” ― Wesam Fawzi"},{"quote":"“Don't just wish for success, earn it!” ― Wesam Fawzi"},{"quote":"“Be Patient. All Storms Pass. The Sunshine Will Come. And There Will Be Joy!” ― Wesam Fawzi"},{"quote":"“It takes tremendous courage, persistence, and perseverance to pursue your ultimate purpose.” ― Debasish Mridha"},{"quote":"“Some people’s situation made them struggle. Some people find a purpose to struggle. Success depends on your choice, persistence, and ultimate struggle.” ― Debasish Mridha"},{"quote":"“It's hard to bet a person who never gives up.” ― Babe Ruth"},{"quote":"“Let us return to Benjamin Rush, who foresaw the revolutionary implications of Benjamin [Lay]'s philosophy. Writing after the abolitionist movement had burst into existence during the \"age of revolution,\" Rush was acutely conscious that Benjamin had been a lonely fighter against slavery for forty long years, suffering endless persecution, ridicule, and repression, without a movement to support and sustain him. Rush saw that his very survival took rare strength, confidence, certitude, and character. He sought to turn the experience into an object lesson for activists of his own time. The \"benefactors of mankind,\" he continued, must not \"despair, if they do not see the fruits of their benevolent proportions, or undertakings, during their lives.\" Wherever the \"seed of truth or virtue\" is planted, it will \"preserve and carry with it the principle of life.\" Some seeds bear fruit quickly, Rush explained, but the \"most valuable of them, like the venerable oak, are centuries in the growing.\" Like the fearless Benjamin Lay, these giant oaks do not wither. \"They exist and bloom for ever.” ― Marcus Rediker, The Fearless Benjamin Lay"},{"quote":"“Being the first to start or leave does not necessarily mean that you will be the first to finish or arrive. Or that you will finish or arrive.” ― Mokokoma Mokhonoana"},{"quote":"“You don’t prosper by maintaining standards; you prosper by maintaining habits. You are what you are not because of what you did; but because of what you keep doing.” ― Moffat Machingura, Life Capsules for Success: 50 Energy Capsules to Speed Boost You Towards Your Success, Now!"},{"quote":"“In life there is only one enemy who can stop your dreams - you!” ― Daisy Gallagher, The Government Contractor's Resource Guide"},{"quote":"“Growing up wrinkles the skin, giving up wrinkles the soul.” ― Amit Kalantri, Wealth of Words"},{"quote":"“I stood in my garden as the rain poured down, eyes closed, and when I opened them I thought to myself how I'd never seen anything more beautiful. Green flashed before my eyes; trees, leaves and grass, glittering with raindrops, the tears of angels weeping with sadness and joy; green, the colour of love, to remind me why I'm here.” ― Sarah Brownlee"},{"quote":"“Keep your passions burning brightly.” ― Wayne Gerard Trotman"},{"quote":"“When it all comes together, it is oddly beautiful and it makes sense.” ― Greg Dutilly"},{"quote":"“Be wise and be persistent - rest will come.” ― Abhijit Naskar, Lord is My Sheep: Gospel of Human"},{"quote":"“Rather than reacting to every obstacle or dashed expectation, incorporate the event into your overall plan. Real life setbacks like rejections, broken promises, and unfair disadvantages will happen. Rethink the meaning behind the emotional triggers and how your reaction will further your purpose. Manage emotions by recognizing their place, but do not allow them to control your moves.” ― Alisa Melekhina, Reality Check: What the Ancient Game of Chess Can Teach You About Success in Modern Competitive Settings"},{"quote":"“It is in building the best of our abilities that we ultimately destroy the worst of our liabilities.” ― Craig D. Lounsbrough"},{"quote":"“A daily dosage of positive energy so corrosive that it wears out every negative doubt as the gap between the dream & reality closes.” ― Curtis Tyrone Jones"},{"quote":"“I promise permanence. I promise persistence. I promise that falling in love was just the beginning for us.” ― Liz Newman"},{"quote":"“The thing you know as Karma, does not really exist the way you think. It can only exist through the law of causality, which means, when you make efforts to achieve something, the results do indeed occur, given enough time, resources and above all, perseverance.” ― Abhijit Naskar, Lord is My Sheep: Gospel of Human"},{"quote":"“Later I will tell him: our courage comes out in different ways. We are brave in our bold dreams but also in our hesitations. We are brave in our willingness to carry on even as our pounding hearts say, “You will fail and land on your face.” Brave in our terrific tolerance for making a hundred mistakes. Day after day. We are brave in our persistence.” ― Kyo Maclear, Birds Art Life: A Year of Observation"},{"quote":"“If you’re going to give up after few attempts, bear it in mind that your struggles are going to be wasted.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“A leader’s meal is that unstoppable desire to stay late to see his dreams achieved. They never give up.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Look forward to failure. Fail quickly. If it does not start with Failure it is probably not meant to be” ― David Sikhosana, Time Value of Money: Timing Income"},{"quote":"“You need to be able to think Independently.” ― David Sikhosana, Time Value of Money: Timing Income"},{"quote":"“Hope is the flower of the soul. Let it bloom with actions and persistence.” ― Debasish Mridha"},{"quote":"“If you persist in doing what everyone feels you can't do, they'll soon see your success and ask \"how did you do it?” ― Israelmore Ayivor, Let's go to the Next Level"},{"quote":"“The problem with patience is that we are not patient enough to learn it.” ― Craig D. Lounsbrough"},{"quote":"“Fear kills dreams more than failure” ― Idowu Ayodeji"},{"quote":"“Words are drops of blood, from my heart.” ― Jean Kenyon MacKenzie"},{"quote":"“I don’t necessarily sit around inviting life to knock me down, but when it does I don’t wait around for an invitation to stand back up either.” ― Craig D. Lounsbrough"},{"quote":"“The HillI have come this far on my own legs,missing the bus, missing taxis,climbing always. One foot in front of the other,that is the way I do it.It does not bother me, the way the hill goes on.Grass beside the road, a tree rattlingits black leaves. So what?The longer I walk, the farther I am from everything.One foot in front of the other. The hours pass.One foot in front of the other. The years pass.The colors of arrival fade.That is the way I do it.” ― Mark Strand"},{"quote":"“My ship had lost crew mates before, yet I sailed on.” ― L.M. Bryski, Book of Birds"},{"quote":"“You don’t become a good writer overnight. It takes persistence and repetition to gain mastery.” ― Israelmore Ayivor, How You Can Write Your Dream Book"},{"quote":"“He taught me how small, day-by-day decisions add up to the great consequences and that every thoughtful and educated decision I made about my life would eventually lead me to a clear and more satisfying understanding of my calling.” ― Eric Motley"},{"quote":"“Changing circumstances always present great opportunities as well as new challenges. Once you recognise the relationship, you’ll understand the need for passion and persistence (KR, 1995)” ― Kieran Revell, Release Your Unstoppable Power: The Journey Continues..."},{"quote":"“Fame and fortune await the few with the faith to fall forward despite frustrating failures.” ― Orrin Woodward"},{"quote":"“As I began examining my successes and failures, what I gradually realized was that the very same activities that had rescued me from failure, that had carried me from the failure line up to the survival line, would also rescue me from average and carry me from the survival line to the success line-IF I WOULD JUST KEEP DOING THEM.” ― Jeff Olson, The Slight Edge"},{"quote":"“If you want more, be more.” ― Will Craig, Living the Hero's Journey"},{"quote":"“At the limit of determination is only inability” ― ABC"},{"quote":"“Wise is the one who flavors the future with some salt from the past. Becoming dust is no threat to the phoenix born from the ash.” ― Curtis Tyrone Jones"},{"quote":"“When she smiles, the lines in her face become epic narratives that trace the stories of generations that no book can replace.” ― Curtis Tyrone Jones"},{"quote":"“Some situations are just like bad dreams, they're only unbearable while we're giving them our full attention.” ― Curtis Tyrone Jones"},{"quote":"“‪A wise man once said, 'Life is like breathing. If you try to hold it, you'll lose it. But let it come & go & you'll always be connected to it.'‬” ― Curtis Tyrone Jones"},{"quote":"“Ones best success comes after their greatest disappointments.” ― Henry Ward Beecher, Life Thoughts Gathered From the Extemporaneous Discourses of Henry Ward Beecher"},{"quote":"“Each timewe bow to thefeet of anythingwe find riveting,the mind rises tobe surprised withnew crowningdiamonds ofcreativity.” ― Curtis Tyrone Jones"},{"quote":"“Ignorance has one virtue: persistence. It will insist through dogged persistence on leading others to follow its vision no matter how misguided. Ignorance will drive the world to the brink of failure and catastrophe and beyond into the abyss with arrogance and anger because wisdom is often too polite to fight. Wisdom doesn’t like to impose its will, but that is all ignorance understands—force over free will and choice. Sooner or later the world comes to its senses, but oh the damage that has been done.” ― John Kramer, Blythe"},{"quote":"“Live in the shadow of the moon until you're bright enough to give birth to your own suns.” ― Curtis Tyrone Jones"},{"quote":"“Some teach youwhat can't be taught,by turning their backon you & helpingyou get internallycloser to everythingyou externallysought.” ― Curtis Tyrone Jones"},{"quote":"“You have to be firm, persistent, passionate, and driven by the idea and have a strong desire to bring your product to the market” ― Sunday Adelaja"},{"quote":"“What you resist, persists....Let go and your life will flow.” ― Nanette Mathews"},{"quote":"“‪You collide with destiny caught up in the mystery of walking the halls of a mind that's only inclined to recognize & expect victory.‬” ― Curtis Tyrone Jones"},{"quote":"“You'll always be curious yet deliriously sinking into whatever your nightmare is until you let your wings know you're serious by leaping into your wildest dreams of self love.” ― Curtis Tyrone Jones"},{"quote":"“You alwaysdrop by, to en-lighten my mind,when my wings arefeeling heavy &i've forgottenhow tofly.” ― Curtis Tyrone Jones"},{"quote":"“Get this; without a continuous struggle, your previous struggles will become a waste. Stay on and hold on until the success become evident.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“If you care to know, majority of successful people in the world were all struck by limitations in one way or the other. What made them great isn’t the absence of limitations; but it was their persistence to rise in the face of those limitations.” ― Israelmore Ayivor, 101 Keys To Everyday Passion"},{"quote":"“Please don't be overly sober with your precious wings, it's your addiction to freedom that makes me think that i too can defy gravity.” ― Curtis Tyrone Jones"},{"quote":"“The distance between your Dreams and Reality is inversely proportional to your Efforts.” ― Vineet Raj Kapoor"},{"quote":"“On Perseverance – Persistence is admirable. Stubbornness is stupid. Just remember: the latter two even begin with the same three letters.” ― Marsha Hinds"},{"quote":"“Your fate is never determined when your massive imagination is.” ― Curtis Tyrone Jones"},{"quote":"“Catastrophe alone sparks man’s salvation. I don’t mean in the religious sense, although I guess it is appropriate there, too, because believers agree that salvation comes only after death. It is part of the human near-tragedy that we learn more from loss than from gain. Gain binds us until we stumble and fall into that black pit then we find the spirit of understanding and truth. And if we fall far enough and still persist, we find our salvation.” ― John Kramer, Blythe"},{"quote":"“Develop distinct habits of wreaking havoc on any stinking thinking addicted to launching mental missiles aimed at sinking your unique magic.” ― Curtis Tyrone Jones"},{"quote":"“Mountains are moved when we choose positivity, when we choose to exert the power of love, when we chip away at our problems 1 day at a time.” ― D. Allen Miller, Scarlet Tears"},{"quote":"“You need persistence in order to maintain the reality that you desire.” ― Steven Redhead, Life Is A Cocktail"},{"quote":"“Push until you can push no more, and then, push some more.” ― Kevin Abdulrahman, THE BOOK on What Ever You're Into: These are the 52 Timeless Winning Truths you Need To Know to have a chance at Winning"},{"quote":"“Part time effort means part time results” ― Tony Curl"},{"quote":"“Never give up. It might not seem easy at first but in the end, it will all be worth it” ― Sunday Adelaja"},{"quote":"“Be persistent and diligent in the way you spend your time daily” ― Sunday Adelaja"},{"quote":"“WHO YOU CAN BE, WILL COME TO YOU THROUGH CONSISTENT PERSONAL DEVELOPMENT.” ― Seema Brain Openers"},{"quote":"“Whatever you have in mind do, for the Lord is with you.” ― Lailah Gifty Akita"},{"quote":"“Hit the reset button. Whatever happened yesterday, forget about it. Get a new perspective. Today is a new day. Fresh start, begins now.” ― Germany Kent"},{"quote":"“Nothing in the world can take the place of Persistence. The desire and ability to press on has and always will solve the problems of the human race and divide those who achieve from those who might have been.” ― Jeffrey Fry"},{"quote":"“One who finishes, lasts.” ― Jeffrey Fry"},{"quote":"“A negative outlook is dangerous. When you say, “It can’t get any worse!” You're essentially challenging the universe to do exactly that.” ― Kamand Kojouri"},{"quote":"“Turn your weakness into your richness.” ― Erol Ozan"},{"quote":"“Being \"nowhere\" is a step towards getting somewhere.Today, if you feel like you are nowhere, you are in a powerful position to choose the \"somewhere\" you want to go.” ― Dr. Jacinta Mpalyenkana, Ph.D, MBA"},{"quote":"“Over many a race the sun's bright net was spreadAnd loosed their pearls nor left them even a thread.This dire world delights us, though all sup—All whom she mothers—from one mortal cup.Choose from two ills: which rather in the mainSuits you? —to perish or to live in pain?” ― Abu Al-Alaa Al-Maarri"},{"quote":"“The journey may be fraught with challenges, yet it continues, for even the smallest leaf must embrace destiny...Persistence is the key...” ― Virginia Alison"},{"quote":"“Age in itself gives substance — what has lasted becomes a thing worth keeping. An older poem's increasing strangeness of language is part of its beauty, in the same way that the cracks and darkening of an old painting become part of its luminosity in the viewer’s mind.” ― Jane Hirshfield, Nine Gates: Entering the Mind of Poetry"},{"quote":"“One who doesn't recognise an opportunity is bigger loser than one who tries his hand at an opportunity.” ― Amit Kalantri, Wealth of Words"},{"quote":"“Even lungs that are gasping are lungs that are trying.” ― Taylor Patton"},{"quote":"“Yes, this man had the persistence of an insect.” ― Patrick Modiano, So You Don't Get Lost in the Neighborhood"},{"quote":"“Salesman profesional tidak terpengaruh oleh situasi atau keadaan ekonomi, kompetisi, atau pelanggan; atau membiarkan situasi apa pun memengaruhi sikap dan emosi mereka. Mereka selalu percaya dan yakin akan perusahaan, produk, dan diri mereka.” ― Dedy Budiman, Sales Insight"},{"quote":"“Then it began to dawn on us: There was no miracle moment. Although it may have looked like a single-stroke breakthrough to those peering in from the outside, it was anything but that to people experiencing transformation from within. Rather, it was a quiet, deliberate process of figuring out what needed to be done to create the best future results and then simply taking those steps, one after the other, turn by turn of the flywheel. After pushing on that flywheel in a consistent direction over an extended period of time, they'd inevitably hit a point of breakthrough.” ― Jim Collins, Good to Great: Why Some Companies Make the Leap... and Others Don't"},{"quote":"“Worthwhile things never come easily” ― ميرنا المهدى"},{"quote":"“The most formidable adversary of evil is a persistent man with a loud conscience.” ― Justin Alcala"},{"quote":"“What matters is that life is good. It has a lovely texture, like some rich cloth or fur, or the petals of flowers, and everything else worthwhile. And that's as true for the last man as the first.” ― Fritz Leiber, A Pail of Air"},{"quote":"“Without delayed gratification,there is no persistence.” ― Sunday Adelaja"},{"quote":"“Optimism doesn't make you more persistent. Persistence makes you more optimistic.” ― Richie Norton"},{"quote":"“Hold on to God, hold on to your visions and continue to develop them” ― Sunday Adelaja"},{"quote":"“Triumphs are usually the outcomes of countless learned-from 'failures” ― Rasheed Ogunlaru"},{"quote":"“Simply giving something ‘a shot’ is not giving something our ‘best,’ for our best is made up of as many ‘shots’ as it takes in order to be our best.” ― Craig D. Lounsbrough"},{"quote":"“I will take all the action there is, and even if I fail and fail and fail and fail and fail, I know like I know, that the door to this opportunity will one day get weakened by the forces of my attempts, and breaks wide open for me to get in.” ― Dr. Jacinta Mpalyenkana, Ph.D, MBA"},{"quote":"“Mereka (pemilik perusahaan) sangat menghargai salesman yang bekerja keras walaupun hujan sedang turun lebat. Pelanggan mempunyai mata dan hati, mereka tahu dan kenal mana salesman yang mau bekerja keras dan salesman yang asal-asalan. Jadi dalam kesulitan pasti ada berkat, asal saja kita jeli melihat dan memanfaatkannya.” ― Dedy Budiman, Sales Insight"},{"quote":"“Critique, Challenge, Question yourself always, but never doubt your purpose” ― Natasha Tsakos"},{"quote":"“Why start something that you won’t see to the end? You need to finish what you start!” ― Nabil N. Jamal"},{"quote":"“In order to make our gifts perfect, you need to work on yourself but it hurts” ― Sunday Adelaja"},{"quote":"“To achieve or goals we need persistence” ― Sunday Adelaja"},{"quote":"“Keep being persistent in your work and keep moving forward” ― Sunday Adelaja"},{"quote":"“God always gives riches to diligent people who persistently aim for the goal and who continue to be diligent” ― Sunday Adelaja"},{"quote":"“Every flower blooms at its own pace.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“After scientists broke open the coat of a lotus seed (Nelumbo nucifera) and coddled the embryo into growth, they kept the empty husk. When they radiocarbon-dated this discarded outer shell, they discovered that their seedling had been waiting for them within a peat bog in China for no less than two thousand years. This tiny seed had stubbornly kept up the hope of its own future while entire human civilizations rose and fell. And then one day this little plant's yearning finally burst forth within a laboratory. I wonder where it is right now.” ― Hope Jahren, Lab Girl"},{"quote":"“I seem to see ahead, in a kind of way. I know we are going to take a very long road, into darkness; but I know I can't turn back.” ― J.R.R. Tolkien, The Lord of the Rings"},{"quote":"“A certain readiness to perish is not so very rare, but it is seldom that you meet men whose souls, steeled in the impenetrable armour of resolution, are ready to fight a losing battle to the last, the desire of peace waxes stronger as hope declines, till at last it conquers the very desire of life. Which of us here has not observed this, or maybe experienced something of that feeling in his own person - this extreme weariness of emotions, the vanity of effort, the yearning for rest?” ― Joseph Conrad, Lord Jim"},{"quote":"“Be persistent like a mosquito, at the end you will get your bite” ― Bangambiki Habyarimana, Pearls Of Eternity"},{"quote":"“Love becomes imprudent only when it is impatient to enjoy; but when it is a matter of procuring the return of a happiness to which a baleful combination of circumstances has raised impediments, love sees and foresees all that the most subtle perspicacity can discover.” ― Giacomo Casanova, History of My Life, Volumes III & IV"},{"quote":"“Grab every chance given and do not throw it away; always cherish what you already have, for you never know when you will receive something of its likeness again; and if you lose what was most precious to you, never stop fighting for it until you have it once again in your possession.” ― Imania Margria, Secrets of My Heart"},{"quote":"“Chase your dreams even with the last breath.” ― Lailah Gifty Akita"},{"quote":"“As it turns out, that persistence is a requirement. Thus, he would tell me, you need the dark to show the light, so you shouldn't curse darkness. You needed death to define life.” ― Terry Goodkind, The First Confessor"},{"quote":"“The next time the world tells you “Stop”, “Don’t”, or “You can’t do this”, the next time the world beats the living daylight out of you, hit it back with a knock just as strong and say, “No, I want to do this.” ― Joud Tabaza, No, I Want To Do This"},{"quote":"“Knowing that one thing you want is a great step. Sure, whether you prefer or not, you'll get offers, and many will seem that one thing you want.” ― Ufuoma Apoki"},{"quote":"“There is a sacred cost for everything.” ― Lailah Gifty Akita"},{"quote":"“Do not quit too soon. The future is bright like a shining diamond.” ― Lailah Gifty Akita"},{"quote":"“Dreams are the inner perceptions and realizations that require goal oriented actions and persistence.” ― Debasish Mridha"},{"quote":"“Tenacity bores failure.” ― Seun Ayilara"},{"quote":"“We are semipermeable membranes. We can pick and choose which troubles are worthy of our attention. What sinks us can only do so with our permission; a boat stays afloat until the water gets in.” ― Joyce Rachelle"},{"quote":"“Patience, my friend; Once again, I say, Patience. In an era 'plagued' with speed, doggedness of character and drudgery of persistence is the only guarantee to mastery.” ― Ufuoma Apoki"},{"quote":"“The whole hard work in achieving any goal is not in the means of achieving greater heights, but in the courage in fulfilling the simple yet daunting tasks.” ― Chinonye J. Chidolue"},{"quote":"“Hope is the flower of the soul. Let it bloom with action and persistence.” ― Debasish Mridha"},{"quote":"“Nothing in life is stronger than perseverance; time only promotes it, failure is afraid of it, negative people hide from it, and disease is affected by it. Even rocks give way to perseverance: because if water perseveres its impacts on the surface of a rock long enough, the rock starts to wither.” ― Dr. Jacinta Mpalyenkana, Ph.D, MBA"},{"quote":"“There is no always,\" I say. \"Nothing persists forever.\"\"Nothingness persists,\" she says. She is testing me.\"No. So long as anything exists, nothingness is impossible. In fact, it's nothingness that cannot persist. Nothingness gives way to somethingness. The nothingness that preceded the Big Bang was obliterated. Nothing became something.” ― Michael Grant, Eve & Adam"},{"quote":"“Patient is a persistent act.” ― Lailah Gifty Akita"},{"quote":"“I’ve failed over and over and over again in my life. And that is why I succeed.” ― Michael Jordan"},{"quote":"“The secret of success is the strength to overcome any obstacle.” ― Lailah Gifty Akita, The Alphabets of Success: Passion Driven Life"},{"quote":"“Hard work is the key to any achievement.” ― Lailah Gifty Akita"},{"quote":"“Persistence drives the achievement of the desired outcome for reality.” ― Steven Redhead, Life Is Simply A Game"},{"quote":"“When it comes to the core of who we are, it takes incredible effort to shift more than one standard deviation from the mean of your life.” ― E. Obeng-Amoako Edmonds"},{"quote":"“So what else have they said you can’t do and how many of those have you believed?” ― Chinonye J. Chidolue"},{"quote":"“Knowing that one thing you want is a great step. Sure, whether you prefer or not, you'll get offers, and many will seem just like that one thing you want.” ― Ufuoma Apoki"},{"quote":"“Power of persistence can overcome any obstacles.” ― Debasish Mridha"},{"quote":"“This the kind of world, if you don’t die, you just keep on growing up and living through everything that comes.” ― J. California Cooper, Some Soul to Keep"},{"quote":"“I remember what I must do, even if it makes me the villain of my own story” ― Josephine Angelini, Trial by Fire"},{"quote":"“Men dressed in an embroidery of excuses are not fit to enter the colorful chamber of champions” ― Osho Samuel Adetunji"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“Most great accomplishments do not look promising in the beginning. If you give up on a big dream too early, you have probably stepped on gold and mistook it for a rock.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Persistence, perseverance, and continuous improvement are the ingredients for forming a successful person.” ― Debasish Mridha"},{"quote":"“You can break through every barrier with persistent effort.” ― Lailah Gifty Akita"},{"quote":"“Mr. Lawrence drank from his beer. Do you know how I figure out what to do? I look under rocks for slime. I lick the slime with my own tongue. I see the problem for what it is, not what a consultant's methodology says it should be. I find people who are working on something that no one told them to work on, who solve a problem because they can't let it stay unsolved, who don't eat or bathe because it takes too much time. I find the ones selling their ideas to customers without going through the marketing department first. I've gotten good at picking molds off cheeses and turning them into penicillin. People used to wonder where my ideas came from. It was simple: I looked for slimy rocks and moldy cheese, and I watched the bank account like a hawk. It worked well for this company for a long time.” ― Charlie Close, Before the Ripcord Broke: Stories"},{"quote":"“The strength within you is the fuel for farther flight” ― Lailah Gifty Akita"},{"quote":"“Focus on the mission.” ― Lailah Gifty Akita"},{"quote":"“Your will to success supersedes all other wills.” ― Lailah Gifty Akita"},{"quote":"“Let your passion fuel your perseverance.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“The brand building process is a marathon that takes time with patience, persistence, consistence, and authenticity to deliver on your unique promise of value” ― Bernard Kelvin Clive"},{"quote":"“The author describes the adoption process in which he and his wife participated as \"a paperwork pregnancy\".” ― David Platt, Follow Me: A Call to Die. A Call to Live."},{"quote":"“Sacrifice precedes success.” ― Lailah Gifty Akita"},{"quote":"“The journey to success is easy if you know the road map and have persistence and perseverance.” ― Debasish Mridha"},{"quote":"“If you fail at something, it means you have not mastered the art. With persistence practice, you will be master and eventually succeed.” ― Lailah Gifty Akita"},{"quote":"“If the knock once and door remain lock, do not turn away. With persistent knocks, the door will be open.” ― Lailah Gifty Akita"},{"quote":"“If knock the door once and it remains lock, do not turn away. With persistent knocks, the door will be open.” ― Lailah Gifty Akita"},{"quote":"“Persist with great passion and fulfill your great dreams.” ― Lailah Gifty Akita"},{"quote":"“Sacred soul has indomitable strength.” ― Lailah Gifty Akita"},{"quote":"“Inspiration shouldn't respond to time, rather the other way around. Time must be altered to inspiration, \"Timing is wrong\" NO! Timing is never wrong. Sacrifice and the likes gets thrown in at this point.” ― Unarine Ramaru"},{"quote":"“Courage is act of faith.” ― Lailah Gifty Akita"},{"quote":"“You can endure every hardship with hope.” ― Lailah Gifty Akita"},{"quote":"“Stay determined to achieve your dreams.” ― Lailah Gifty Akita"},{"quote":"“Every face of life demands endurance.” ― Lailah Gifty Akita"},{"quote":"“Without overcoming the obstacles on the path, how can you get to the top of the mountain?” ― Lailah Gifty Akita"},{"quote":"“Persist in the pursuit of your passion.” ― Lailah Gifty Akita"},{"quote":"“Persistence is the key to fulfilling the dream.” ― Lailah Gifty Akita"},{"quote":"“The cost you will pay to achieve the goal is worthwhile.” ― Lailah Gifty Akita"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“If you fail an examination, it means you have not yet master the subject. With diligent study and understanding, you will succeed in passing the exams.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You may encounter many disappointments. Be strong. Tell yourself, “I am good enough, I will try again.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“Perseverance, endurance and patience are the three greatest survival skills.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“Success requires preparation and persistence effort.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You must endure willingly for the fulfillment dreams” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“May you find the faith, hope and courage to survive life.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“It is the toughest time but the best.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“I must endure to the end.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“If you never persisted, you will never succeed.” ― Vann Chow"},{"quote":"“Be persistent, be persistent, they say. But please, do not mistake being a pest for being persistent.” ― Nike Thaddeus"},{"quote":"“There is a price to be paid for any accomplishment.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Be persistent in the pursuit of your dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“May you the willpower and chase your God-given dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Sometimes, we must travel on the longest path to our sacred-destination.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“In the achievement of dreams demands 100 percent dedication.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“The world needs peak performers like you to set the example of how to accept failures, dust off, and move on with your head held high. Whether you face a business failure, a divorce, a missed opportunity, a lost sale, a fumbled business presentation, or all of the above, own it, learn from it, and envision a successful future.” ― Michelle McCullough, Intro To Make It Happen: The First 11 Practices for Peak Performers"},{"quote":"“With great diligent, pursue your dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“A willing spirit, a determined effort.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“There are no smooth paths to success. You have to straighten many rugged roads and scale numerous walls for the ultimate triumph.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Persistence is a writer's best friend disguised as a bully.” ― A.M. McKnight, Goslyn County"},{"quote":"“Persistence Pays...Period.” ― Sotero M Lopez II"},{"quote":"“You may face many disappointments. But don’t lose hope.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“If you give up on a big dream too early, you have probably stepped on gold and mistook it for a rock.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Persistence in the face of failure is of course important, but it is not the same thing as dedication or passion. Persistence is a discipline that you learn; devotion is a dedication you can't ignore.” ― Stuart Firestein"},{"quote":"“I am pushing through every barrier to fulfill my dream.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You can only overcome a negative attitude with a positive attitude.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Keep going. You're a mess and you're happy.” ― Markus Zusak, The Book Thief"},{"quote":"“For every great success, diligence is desirable from the beginning to the very end.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Do you know why I am unstoppable? It is because I decide my stopping line. ~ Aarush Kashyap” ― Kirtida Gautam"},{"quote":"“Stand fast, firm and steadfast.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Be patient and wait for the due harvest.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“With persistent perseverance, you can break through any barrier.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Persistence is what keeps you hanging on when hanging on gets tough.” ― Debasish Mridha"},{"quote":"“Don't be in a hurry in life. The sacred-time determines the due events.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“In the midst of the adversity, we can still strive by the grace of God” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You must know the rules of the game, to play better.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Don’t allow the challenges to overpower you. Choose a positive attitude and persistent endurance over defeat.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Without a clear vision, you can be drifted to any shore.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You can courageously conquer any challenge.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Reach out, with all your heart, to your divine-dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“It can be done. It will be done.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Life is an enduring faith.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Without a vision, where is the focus?” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“When I have fully executed this phase of my life, then I can begin a new chapter.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Arise in great might and chase your dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Don’t give up in the middle of the journey.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“When nothing works, persistence will.” ― Abhishek Ratna, No Parking. No Halt. Success Non Stop!"},{"quote":"“Imagination, persistence, perseverance, and trust transform dreams into reality.” ― Debasish Mridha"},{"quote":"“Patient endurance is the greatest life survival skills.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“It is only by persistent focus on your dreams; you will pull all the divine forces for the passion of fulfilled dream.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Be passionate persistent in the pursuit of your dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Find the will power and begin to chase your dreams.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“I will never give up on my dreams. I have the patient to wait and work hard for its fulfillment.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“One may suffer the long-term in order to grow in appreciation for the small things. For in short-term suffering, one only notices the large.” ― Criss Jami, Healology"},{"quote":"“What happens to us are tiny matters compare to us response to any situation.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“What happens to us are tiny matters compared to us response to any situation.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“An unpublished writer should doubt themselves. They should constantly wonder whether what they’re creating has merit. And then, having doubted, they should take up their pen and see if they can’t make it better.” ― Johnny Rich"},{"quote":"“Run the race of life with all perseverance and endurance.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“How could we have achieved the set-goal, without endurance to the end?” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“There are people who know where they want to be, and also have a roadmap in their mind, about how to get there. But something stops them! They either keep waiting for better circumstances, or simply lack the courage to give up the comfort of a secure life. For them, the pursuit of their purpose is a risky proposition. Often, those are the same people that die with the weight of regrets. Those are the people who feel unfulfilled or unworthy at the end of their journey. They bury their dreams for the sake of a safe life, without ever venturing into the world of possibilities. But the truth is that if you risk nothing for the pursuit of your passion, you risk more. An even deeper reality is that there’s never a perfect time; the most ideal and opportune time is the time when YOU choose to begin your journey. Find courage to take the first step today. Your age, your pace, or your handicap doesn’t matter. Nothing is insurmountable if you have passion and persistence – your heart knows this. You simply have to convince your mind to play along. Find your moments of courage – the times when you feel strong, able, and energized. Tap those moments to launch yourself; the world beckons!” ― Manprit Kaur"},{"quote":"“With persistent focus, commitment and enthusiasm, your dream will be reality.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Persistence to fight for what you want is what separates those who win and those who don't.” ― Tony Curl"},{"quote":"“You ought to conquer the obstacle to achieve the goal.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“A task is only difficulty, when we not find the best strategy to get it done.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Courage to dare is the strength to endure.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Don’t quit when you encounter an obstacle. Adapt a new strategy to conquer it.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You ought to find all your might to climb a higher height.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“With persistent attempt, you will succeed.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Life is a personal race. Run the race of life with all endurance.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You ought to endure and complete your own race of life.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“If you are unhappy about something change it.Choose what you want in life, create your plan to get it, put your plan into action and follow through with persistence.” ― Latorria Pier, Turn My Life Around Discovering Your Purpose"},{"quote":"“Plans become Platitudes, if you don't have Passion and Persistence to Execute them!” ― Manprit Kaur"},{"quote":"“No matter how long the journey takes, don’t give up. Keep travelling onwards.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“I have patient to wait for what I desire.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Passion, patient, perseverance and persistent are four keys to great achievements.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“God grant be the strength to endure all things.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You ought to move onwards!” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You must persistence long enough to triumph.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“The more I dare to play the game of life, the more the possibility to win.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“We ought to pray persistently.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“With certainty, courage and commitment, the dream will be a reality.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Our government, media houses, schools, must focus on creating a new culture in our society. A culture of work. A culture of labour. A culture of diligence. A culture of hard work. A culture of perseverance. A culture of persistence. A culture of DIGNITY OF LABOUR.” ― Sunday Adelaja"},{"quote":"“We ought to be patient at all times.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Go forward and conquer any mountain on your path.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“The deeper the difficulty in fulfilling a dream, the brighter the outcome of its fulfillment and the sweeter the celebration thereof. Persist to the end; don't give up!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“The obstacles were intended to be a distraction from the goal.You must keep a persistence focus to realise the goal.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“What lies ahead is often unknown. But keep traveling.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Dare to try again when you failure.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Be strong, be confident and be determined.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Do not quit. Hang on the wings of hope.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“It is better to hope than despair.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“It takes self-discipline and persistence action to achieve the goal.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“It is the possibility of the dream, which quickens my spirit to take action.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“You have to conquer every obstacle to realize the goal.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Once, a few years earlier, Jules had gone to see a play at Ash’s theater, and afterward, during the “talkback,” when the audience asked questions of the playwright and of Ash, who’d directed the production, a woman stood up and said, “This one is for Ms. Wolf. My daughter wants to be a director too. She’s applying to graduate school in directing, but I know very well that there are no jobs, and that she’s probably only going to have her dreams dashed. Shouldn’t I encourage her to do something else, to find some other field she can get into before too much time goes by?” And Ash had said to that mother, “Well, if she’s thinking about going into directing, she has to really, really want it. That’s the first thing. Because if she doesn’t, then there’s no point in putting herself through all of this, because it’s incredibly hard and dispiriting. But if she does really, really want it, and if she seems to have a talent for it, then I think you should tell her, ‘That’s wonderful.’ Because the truth is, the world will probably whittle your daughter down. But a mother never should.” ― Meg Wolitzer, The Interestings"},{"quote":"“Nothing in this world can take the place of persistence. Talent will not;nothing is more common than unsuccessful people with talent.Genius will not; un-rewarded genius is almost a proverb.” ― Calvin Coolidge"},{"quote":"“Your voice is strongest when you remain firm, when you are not moved by your circumstance. For we must not permit others to define who we are or what we stand for.” ― Lorna Jackie Wilson, Black Butterfly: The Journey - the Victory"},{"quote":"“Be patient, persistent and above all, believe.” ― Fennel Hudson, Wild Carp: Fennel's Journal No. 4"},{"quote":"“Life is a fairytale of courage, fear, failure, persistence and triumph.” ― Debasish Mridha"},{"quote":"“In the long run most short cuts are flawed - especially on journeys to 'so-called' success” ― Rasheed Ogunlaru"},{"quote":"“Take one more step because it might be the last one needed.” ― Innocent Mwatsikesimbe, The Reason"},{"quote":"“We find the greatest happiness for every challenge we conquered.” ― Lailah Gifty Akita , Pearls of Wisdom: Great mind"},{"quote":"“Walk and loveWe're walking in loveFor the walk of love” ― Criss Jami, Salomé: In Every Inch In Every Mile"},{"quote":"“We endure hardships by God’s grace.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“No matter how talented you are, if you don't persist the probability of achieving your goals is extremely small\".” ― Camilla Dorand, Back to Me: Changing How I Feel About My Mother, My Body, and Men"},{"quote":"“Persistence separates those who want it more.” ― Tony Curl"},{"quote":"“Fear deprive us of what we can possess.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Persistence is victory. Just . . . keep . . . going. It doesn’t matter if things aren’t going the way you thought they would or if you’re facing a disappointment. The only defeat is in quitting. If you keep going, you’re winning.” ― Mara Schiavocampo, Thinspired: How I Lost 90 Pounds -- My Plan for Lasting Weight Loss and Self-Acceptance"},{"quote":"“Persistence is key when you want to achieve. You can't afford to quit just because you don't feel good about failure.” ― Innocent Mwatsikesimbe, The Reason"},{"quote":"“The joy of success outweighs whatever negativity you might get from failing a couple of times.” ― Innocent Mwatsikesimbe, The Reason"},{"quote":"“Patience, persistence and hard work lead to success and happiness. Or you can do whatever the hell you want and with a bit or a whole lot of luck you'll stumble onto success and happiness.” ― S.A. Tawks, Misadventurous"},{"quote":"“The people you need to make your goals and visions happen aren’t just going to call you or walk up to you and hand you an opportunity. You have to go to them. And you must have a plan for how you will approach them.” ― La la Anthony"},{"quote":"“God has given you the opportunity to make a difference. Plan purposefully, Prepare Prayerfully, Proceed Positively & Pursue Persistently!” ― Dr. Pazaria Smith"},{"quote":"“My father told me never to take my foot off a ladder to kick at someone who was kicking at me. When I did that, I would no longer be climbing. While they are kicking, my father told me, I should keep stepping. They can kick only one time. If I continued to climb, they would be left behind. In trying to hurt me, to impede my progress, they would get left behind because they allowed themselves to get sidetracked from their agenda.” ― Steve Harvey, Act Like a Success, Think Like a Success"},{"quote":"“When a storm comes, bamboo bends. It doesn't break.” ― Michelle Moran, Rebel Queen"},{"quote":"“We ain't giving up,\" I said. \"We done gone this far.” ― Ernest J. Gaines, The Autobiography of Miss Jane Pittman"},{"quote":"“The art of love is largely the art of persistence.” ― Albert Ellis"},{"quote":"“Strong enough to make holes in the rock are tiny drops of water that persist to fall. Persistence is the attitude that breaks down mountains one rock at a time!” ― Israelmore Ayivor, Leaders' Watchwords"},{"quote":"“An anomaly has his own ambitions. You can try reasoning with him, but that's like using money to bribe a beast.” ― Criss Jami, Healology"},{"quote":"“When resistance closes the door against you, remember that persistence holds the key. Don't give up too early; insist to endure to the end... You will never regret it!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“To esteem what makes you holy over what makes you happy - that is the greatest dare.” ― Criss Jami, Healology"},{"quote":"“Great men are made in the crucible of experiences” ― Osho Samuel Adetunji"},{"quote":"“Every successful person had experience failure but they overcome with courage and adamant hope” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Arise and pursue your dreams.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Never waste your energy to dwell on the past failures and mistakes.May you find renewed energy, courage and hope to pursue new adventures.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Change for the better... Let your change be purposeful and determined. Never repeat steps that always make you fail. Never change a step that brings you closer to excellence! You got to make a change!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“In traveling, there is nothing like dissecting people's statements, which are usually colored by their estimate of the powers or likings of the person spoken to, making all reasonable inquiries, and then pertinaciously but quietly carrying out one's own plans.” ― Isabella L. Bird, A Lady's Life in the Rocky Mountains"},{"quote":"“While there may be various tips, pointers, ingredients, and strategies to success, there is no one formula that always guarantees it other than to keep learning from failure itself.” ― Criss Jami, Healology"},{"quote":"“Forgive your past because it the vehicle through your process and from this point forward your life is made of 100% future; Caterpillars always look up despite having no wings... and butterflies don't waste time crying over the legs they lost or dwelling on on the ground.” ― Johnnie Dent Jr."},{"quote":"“There are two ways to do great mathematics. The first is to be smarter than everybody else. The second way is to be stupider than everybody else — but persistent.” ― Raoul Bott"},{"quote":"“Don't allow the circumstances to stop you from pursuing your passion.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Persistence is often a detective's greatest ally.” ― Lara Adrian, Taken by Midnight"},{"quote":"“Worrying paralyzes progress; prayer, preparation and persistence ensures it.” ― T.F. Hodge, From Within I Rise: Spiritual Triumph over Death and Conscious Encounters With the Divine Presence"},{"quote":"“For while it is of no particular importance how many things you start in life, it is of great importance how many you finish!” ― Josephine Daskam Bacon"},{"quote":"“You have no control over what happens to you! You can only pray for grace and strength to endure any situation.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“All you need is a little hope in order cope in times of failure, and be able to try again with a better intelligence for excellence!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“MAKE SUCCESS HAPPENSuccess is like a camera. Only focus on what is most important. Ignore trivial details. Concentrate on your main goal image for success. Develop your pictures. If they don't turn out, don't give up. Take more shots at it. Always be persistent. Focus on making success clearly happen.” ― Mark F. LaMoure"},{"quote":"“Not aware of any boundaries or any rules or any traditions abiding upon them, the water flows free and wild. Not bothered about anything gone or left behind she eagerly rushes to the new dimension of her life knowing the best is yet to come.Learn to be like that soul clean, compassionate, loving and strong enough to endure.” ― Harshada Pathare, You Complete Me"},{"quote":"“Start over, and start over, and start over.” ― Nancy Ring, Walking on Walnuts"},{"quote":"“We are all given equal opportunity to learn new things. We just have to be determined and persistent.” ― Val Irvin Mabayo"},{"quote":"“The success gate is far at the end of the long failure corridor. Keep moving no matter how many potholes you step into. You will get there with time!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“Patience is productive only when aligned and doggedly chasing of objectives is pursued with consistence and persistence” ― Priyavrat Thareja"},{"quote":"“I have never seen a heavyweight champion apologize for a knockout” ― Jock J. Davis"},{"quote":"“Your love is as stable as you are: It's not about how good a person makes you feel, but rather what good you can do for them.” ― Criss Jami, Killosophy"},{"quote":"“I have a thing for things that last.” ― Criss Jami, Killosophy"},{"quote":"“Sometimes giving up feels like the easiest thing to do. But then the easiest thing has never produced more than a garden full of weeds.” ― Richelle E. Goodrich, Making Wishes: Quotes, Thoughts, & a Little Poetry for Every Day of the Year"},{"quote":"“Successful people are defined as ordinary people who never gave up on their dreams and passion is the secret of that persistence!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“No fine work can be done without concentration and self-sacrifice and toil and doubt.” ― Max Beerbohm"},{"quote":"“Dreams and freedom are the same. In order for them to be, they come with a price.” ― Criss Jami, Killosophy"},{"quote":"“Loving what you do doesn’t mean you are never going to be faced with trials. It rather means, you are highly qualified to persist, persevere and endure till the end because you are enthusiastic about seeing the joyous end.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“The only people capable of handling success are those who have learned to handle failures w/o taking their eyes off the prize.” ― Orrin Woodward"},{"quote":"“Persistence is a necessary ingredient for success.” ― Debasish Mridha"},{"quote":"“Persistence is the source of great strength.” ― Debasish Mridha"},{"quote":"“Success is 3Ms: Your vision produces the Map; your actions produce the Motion; your persistence produces Monetary rewards.” ― Orrin Woodward"},{"quote":"“Hope is a belief in a better tomorrow.,” ― Lailah Gifty Akita"},{"quote":"“P's of life; Passionate life, Persistent life.” ― Lailah Gifty Akita"},{"quote":"“Winners never suffer defeat, but rather just many setbacks on their way to victory.” ― Orrin Woodward"},{"quote":"“The weak can't bear to face their weaknesses in the presence of our strength.” ― Crystal Woods, Write like no one is reading"},{"quote":"“If you are going to devote your time to do something you claim you love, take this thought; \"Can I pursue this till the end? Am I sure I will never give up on it?\" This is persistence.” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“You’ll find a way. You’ll always find a way. And on the rare occasions when you can’t, you’ll have friends who will.” ― Michael Monroe, Afterlife"},{"quote":"“We are only failures in life when give up and stop trying.If you fail, get up and try again.” ― Lailah Gifty Akita"},{"quote":"“Leaders are made not born. They are the results of persistent effort. Thus, leadership involves much more than just shouting. Effective leadership requires a human focus and reflects a servant and transformation mentality. It is about the nuts and bolts of execution. Leadership is an everyday activity. It is a process that begins but never ends.” ― Vishwas Chavan, VishwaSutras: Universal Principles For Living: Inspired by Real-Life Experiences"},{"quote":"“In order to reach our goals we sometimes need a plan B. Other times we go all the way through to plan Z.” ― Jo Linsdell"},{"quote":"“Be consistent with what you believe and do. Persist and insist that you will do it till it's done and done well.” ― Israelmore Ayivor"},{"quote":"“Vision and persistence will take you to the top of the leadership mountain, but only humility will keep you there.” ― Orrin Woodward"},{"quote":"“When it comes to human success, I'm pretty sure the object doesn't need a net external force to move it.” ― Majid Kazmi"},{"quote":"“Even through the darkest phaseBe it thick or thinAlways someone marches braveHere beneath my skin” ― K.D. Lang"},{"quote":"“You must believe to see, see to do, do to improve, and improve consistently to win; therefore, believing is the key to winning.” ― Orrin Woodward"},{"quote":"“Those 10000 days in prison, but this never made Nelson Mandela to leave what he was doing. He loved what he did and he would repeat to again if he had been arrested again and imprisoned again! He has his bigger picture in view!” ― Israelmore Ayivor, Dream big!: See your bigger picture!"},{"quote":"“Your thoughts can change your actions and your actions can change your thoughts.” ― Sukant Ratnakar"},{"quote":"“... if they are persistent enough, even tiny drops of water, over time, can change the rock forever. And it will never change back.\" - Zoe” ― Veronica Roth, Allegiant"},{"quote":"“You pray and nothing happens. You pray and nothing happens.You pray and nothing happens.You pray; - and something is bound to happen!.” ― Kunle Olusegun-Emmanuel"},{"quote":"“I can bow to fear and flee the pursuit of great things. I can bow to God and engage in the pursuit of making things great.” ― Craig D. Lounsbrough"},{"quote":"“When you forget about the how, go back to the why.” ― Charlotte Eriksson"},{"quote":"“Trying again is okay. Trying again and again and again is okay. It's sort of an infinite thing because the alternative is failure, and that's not okay.” ― Richelle E. Goodrich, Making Wishes: Quotes, Thoughts, & a Little Poetry for Every Day of the Year"},{"quote":"“When you complain, you explain pain for no gain. Endure and balance yourself through the pain, be hopeful and persist to the end.” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Who told you it was too late? And more importantly, why did you choose to believe them?” ― Richelle E. Goodrich, Making Wishes: Quotes, Thoughts, & a Little Poetry for Every Day of the Year"},{"quote":"“In algorithms, as in life, persistence usually pays off.” ― Steven S. Skiena, The Algorithm Design Manual"},{"quote":"“Today is a BRAND NEW day—a perfectly good reason to get up and start over. Never give up.” ― Richelle E. Goodrich, Making Wishes: Quotes, Thoughts, & a Little Poetry for Every Day of the Year"},{"quote":"“Every great man, every successful man, no matter what the field of endeavor, has known the magic that lies in these words: every adversity has the seed of an equivalent or greater benefit.” ― W. Clement Stone"},{"quote":"“When you get a pinch and decide to give up, you will get a cut when you eventually do so. The consequences of giving up are more harmful than the causes. Just don’t give up!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“What matters more than where you are is the direction you are heading.” ― Cameron C. Taylor, Does Your Bag Have Holes?: 24 Truths That Lead to Financial and Spiritual Freedom"},{"quote":"“Everyday should be a working day on those difficult tasks. A little bit per day is the only way to make it through. Never feel it can't be done; it can be done with persistent actions, repeated input and consistent attendance!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“The chance that you will become a master in something after the first attempt is neither here nor there. You don't get master's degree by attending school on the first day! Time will tell, so you got to persist!” ― Israelmore Ayivor, Shaping the dream"},{"quote":"“You can always try another approach; even change your subject when a scientific strategy or experiment fails.” ― Ada Yonath"},{"quote":"“People stagger, but they pick up a tattered thread and wind it back onto a spool.” ― Donia Bijan, Maman's Homesick Pie: A Persian Heart in an American Kitchen"},{"quote":"“Persistence is the most traveled path to success.” ― Bryant McGill, Simple Reminders: Inspiration for Living Your Best Life"},{"quote":"“Be patient with yourself.The journey of life requires alot of patient, persistence and perseverance.” ― Lailah Gifty Akita"},{"quote":"“Never allow the ill-thoughts of people stop you from pursuing your goals and dreams.” ― Lailah Gifty Akita"},{"quote":"“The spirit of perseverance and persistence will calm mighty storms.” ― Lailah GiftyAkita"},{"quote":"“You will never know what you can accomplish until you really put in persistent effort and never giving up.” ― Lailah Gifty Akita"},{"quote":"“Follow your dreams, your passions - your obsessions. Persistence will always turn failure into success.” ― Cody McLain"},{"quote":"“Any fight in life whether it is physical, mental, moral, or spiritual, how long you stay in the fight is highly dependent on your growth.” ― Assegid Habtewold, The 9 Cardinal Building Blocks: For continued success in leadership"},{"quote":"“En el lodo, pero no derrotados.” ― Pedro A. Pérez Raymond, La piedra del fin"},{"quote":"“Never let those who say it can't be done obstruct you from pursuing your goals.” ― Lailah Gifty Akita"},{"quote":"“Failures are part of life lessons.Keep trying no matter how many times you fail. You will one day succeed.” ― Lailah Gifty Akita"},{"quote":"“The grace and blessing of God is sufficient to carry us through the storms of life. With persistence and determination, victory awaits us at end of the journey.” ― Lailah Gifty Akita"},{"quote":"“start something, with a knowledge to end it.” ― Krishna Sagar"},{"quote":"“Your persistent problems are because of your response to common misfortune.” ― Bryant McGill, Simple Reminders: Inspiration for Living Your Best Life"},{"quote":"“When our challenge persists, returning in different forms, it may be a sign for us to accepted it as a valuable lesson.” ― Raphael Zernoff"},{"quote":"“Keep trying no matter how many times you have failed.If you fail, try, try again.Never stop trying.You success will come unexpected.” ― Lailah GiftyAkita"},{"quote":"“Most of your problems exist because your heart is hard and you are being arrogant.” ― Bryant McGill, Simple Reminders: Inspiration for Living Your Best Life"},{"quote":"“The P's of life:Passion, Persistence, Perseverance.” ― Lailah Gifty Akita"},{"quote":"“Those not chasing their dreams should stay out of the way of those who are.” ― Tim Fargo"},{"quote":"“Edison was by far the most successful and, probably, the last exponent of the purely empirical method of investigation. Everything he achieved was the result of persistent trials and experiments often performed at random but always attesting extraordinary vigor and resource. Starting from a few known elements, he would make their combinations and permutations, tabulate them and run through the whole list, completing test after test with incredible rapidity until he obtained a clue. His mind was dominated by one idea, to leave no stone unturned, to exhaust every possibility.” ― Nikola Tesla"},{"quote":"“You haven't failed until you stop trying.” ― Jon Gordon, The Energy Bus: 10 Rules to Fuel Your Life, Work, and Team with Positive Energy"},{"quote":"“Your passion is measured by the difference between your willingness to take actions and your desire to quit. When your desire to quit outweighs your willingness to persist, you are ripe for failure!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“She dabbed at the surface of the water with one paw, and the moon fluttered like silver wings before settling again as the water stilled. Letting out a faint mrrow of wonder, Half Moon dabbed again and again. However often she disturbed the surface, the moon was still there.“It doesn’t give up, does it?” Half Moon blinked at Jayfeather. “It’s always there, constant like the stones in this cave. Maybe we should be like the moon’s reflection, holding fast whatever happens?” ― Erin Hunter"},{"quote":"“life has a funny way of testing you to see if you really want, what you say you want.” ― Turcois Ominek"},{"quote":"“Education is a choice. We don't become educated by watching television, and we don't learn a whole lot having similar conversations with the same, safe people day after day. Our education comes from pushing up against boundaries, from taking risks that may seem at first to be overwhelming, and by persevering past the first disappointments or shortfalls until we reach a point at which actual learning takes place. Determination and perseverance are absolutely vital to developing a true education--rarely, if ever, do we learn the most valuable lessons in the first few steps of the journey.” ― Tom Walsh"},{"quote":"“If you adjust first time, compromise second time, failure is what you will get third time.” ― Amit Kalantri"},{"quote":"“As the tides of life rise and fall, life is constant, like the waves crashing upon the shore. Persistence is the key in high and low times…” ― James A. Murphy, The Waves of Life Quotes and Daily Meditations"},{"quote":"“When all help is stopped, when your loved ones started doubting your competence, when failure seems almost confirmed, but no matter what, if you make one more attempt, that final step will fetch you the victory.” ― Amit Kalantri"},{"quote":"“It is in our genes to understand the universe if we can, to keep trying even if we cannot, and to be enchanted by the act of learning all the way.” ― Lewis Thomas"},{"quote":"“God's heart…is not that we escape our lot, but that we learn to thrive in the midst of it.” ― Mary E. DeMuth, Everything: What You Give and What You Gain to Become Like Jesus"},{"quote":"“She and me? We the same in some fings. We live. The others, those orphan kids, they dead. Because she and me, we want to live and we do anyfing to make that happen. That's the difference between us and the others.” ― Melina Marchetta, Finnikin of the Rock"},{"quote":"“It's only those who are persistent, and willing to study things deeply, who achieve the Master Work” ― Paulo Coelho, The Alchemist"},{"quote":"“I tried and failed. I tried again and again and succeeded.[Epitaph from Gail Borden's gravestone.]” ― Gail Borden"},{"quote":"“You may work with 100% capacity every day and may not be seen by anybody for recommendation. This does not mean you should give up! The day you will decide to work at 40% may be the day you'll be seen by the person who is meant to recommend you for higher profile opportunities!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Love at infancy is the strongest and puriest of all, it is mixed with infatuation and deep happiness. Persistent smile brings out hollow dimples, and persistent frowns brings out hollow wrinkles.” ― Michael Bassey Johnson"},{"quote":"“Success is reserved for you if you persevere; it's not deserved by you if you are indolent!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“But that's the wonderful thing about man; he never gets so discouraged or disgusted that he gives up doing it all over again, because he knows very well it is important and worth the doing.” ― Ray Bradbury, Fahrenheit 451"},{"quote":"“The thought that you will become a master in something after the first attempt is neither here nor there. You don't get master's degree by attending school on the first day of your life! Time will tell, so you got to persist!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“The only way when your thirst for excellence is satisfied is when you take up the challenge to do a little more every day than you have already been doing every day!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Success is like sausage, you'd be surprised what goes into it.” ― Tim Fargo"},{"quote":"“Don’t quit. It’s very easy to quit during the first 10 years. Nobody cares whether you write or not, and it’s very hard to write when nobody cares one way or the other. You can’t get fired if you don’t write, and most of the time you don’t get rewarded if you do. But don’t quit.” ― Andre Dubus"},{"quote":"“Water flows, but never changes. It's always H2O.” ― Ljupka Cvetanova, The New Land"},{"quote":"“The ordeal is not that truth does not win; it is that it wins in the end.” ― Raheel Farooq"},{"quote":"“The only way to succeed in life is to never give up. Oftentimes, it requires standing alone.” ― Ellen J. Barrier"},{"quote":"“Love never fails. Character never quits. And with patience and persistence, dreams do come true” ― Pete Maravich"},{"quote":"“Courage is the first of human qualities, because it is the quality that guarantees all the others. - Winston Churchill” ― Carl Hansen, Declassified"},{"quote":"“It's only \"single steps\" that make a journey of 1000 miles. It means the combined effect of many steps is the equivalence of a great journey. Go, take many little steps.” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“If you can find just one place of pleasure within, than you can find the courage to persist.” ― Tania Elizabeth, The Tier of Eternal Grace: The Souls Cry"},{"quote":"“Never rebel for the sake of rebelling, but always rebel for the sake of truth.” ― Criss Jami, Killosophy"},{"quote":"“Think! There's nothing certain in our future! All we can hope for is a vague continuation. But in spite of that, you're going to keep on living. You can't give up on life just because it's vague. It's a question of possibilities...” ― Koji Suzuki, Ring"},{"quote":"“I don't stop when I am tired, I stop when I am done” ― James Bond"},{"quote":"“It’s good to remember that success may be just beyond the next failure, and you’ll get there, not because you’re destined to, but because you’re determined to.” ― Steve Goodier"},{"quote":"“You must dare, and dare again, and then dare a little bit more, and go on daring.” ― Justin Cotillard"},{"quote":"“God can allow you to pass through storms and get to your success. But what the devil loves to do is to make you not to realize it that the storm is over. He wishes to keep you in condemnation even at the time you have to feel liberated.” ― Israelmore Ayivor"},{"quote":"“Writing is difficult. You do it all alone without encouragement and without any certainty that you'll ever be published or paid or even that you'll be able to finish the particular work you've begun. It isn't easy to persist amid all that....Sometimes when I'm interviewed, the interviewer either compliments me on my 'talent,' my 'gift,' or asks me how I discovered it.... I used to struggle to answer this politely, to explain that I didn't believe much in writing talent. People who want to write either do it or they don't. At last I began to say that my most important talent--or habit--was persistence. Without it, I would have given up writing long before I finished my first novel. It's amazing what we can do if we simply refuse to give up.I suspect this is the most important thing I've said in all my interviews and talks as well as in this book. It's a truth that applies to more than writing. It applies to anything that is important, but difficult, important, but frightening. We're all capable of climbing so much higher than we usually permit ourselves to suppose.The word, again, is 'persist'!” ― Octavia E. Butler, Bloodchild and Other Stories"},{"quote":"“Licking your wounds will not stop the bleeding, but applying pressure will.” ― Orrin Woodward"},{"quote":"“There is an easy way to silence your critics; just try to do what they say you can't do. If they are still not content, do more of it! Keep doing it until you become a master. Then look around, and you will see fewer critics and many compliments!” ― Israelmore Ayivor"},{"quote":"“We have begun a fight that it may be will take many a generation to complete...but you know that men are not put into this world to go the path of ease; they are put into this world to go the path of pain and struggle...We have given our lives to the enterprise, and that is richer and the moral is greater.” ― Woodrow Wilson"},{"quote":"“Love, endure, persist... Everything will return to you, innocent fool!” ― Raheel Farooq"},{"quote":"“Persistence and passion will make you invincible.” ― Christian Baloga"},{"quote":"“She knew she could answer it. She knew how to put one foot in front of the other even when every step hurt. And she knew there was pain in the journey, but there was also great beauty. She’d seen it standing on rooftops and in green eyes and in the smallest, ugliest rock. She would find the answer.” ― Veronica Rossi, Under the Never Sky"},{"quote":"“For a writer, I'm not sure that feeling of knowing you've just written something good and strong can be trumped. Not because it means I did something right. But because it proves how many wrongs I pushed through to get there.” ― Cara Rosalie Olsen"},{"quote":"“As you think and act, so your world becomes.” ― T. Scott McLeod"},{"quote":"“Keep at it. Persistence does pay dividends. But there is a catch; you gotta believe it before manifestation will validate conviction as [your] truth. And sacrifice is a required path to fulfillment.” ― T.F. Hodge, From Within I Rise: Spiritual Triumph over Death and Conscious Encounters With the Divine Presence"},{"quote":"“Although some of the people at church rejected and even denounced me, this did not particularly hinder me in my search. Rather, the fact that there were church people as weak and foolish as I was myself gave me a deep sense of reassurance. Arrogantly I thought, 'If God accepts that sort of person, isn't it possible thatHe will even accept me?' And I began to read the Bible more attentively.” ― Ayako Miura, The Wind is Howling: The Autobiography of a Japanese Novelist"},{"quote":"“Narrow the focus, take the ascent one step at a time, and it's amazing what odds a man can beat.” ― Courtney Schafer, The Tainted City"},{"quote":"“They who lack talent expect things to happen without effort. They ascribe failure to a lack of inspiration or ability, or to misfortune, rather than to insufficient application. At the core of every true talent there is an awareness of the difficulties inherent in any achievement, and the confidence that persistence and patience something worthwhile will be realized. Thus talent is a species of vigor. (Eric Hoffer 1902-1983)” ― Eric Hoffer"},{"quote":"“Never underestimate the hidden power of one very determined person. There is nothing more powerful than determination and persistence.” ― Ziad K. Abdelnour, Economic Warfare: Secrets of Wealth Creation in the Age of Welfare Politics"},{"quote":"“Whatever you do in your life, always go the distance.” ― Ken Norton"},{"quote":"“It's a funny word, persistence. It means not giving up, but it also means just passing on through time.” ― Questlove, Mo' Meta Blues: The World According to Questlove"},{"quote":"“An aspirational diet will have you dreaming of success; but it’s the attachment of expectations and tangible goals that feeds the desire, persistence, and fortitude required to make the win.” ― Lorii Myers, No Excuses, The Fit Mind-Fit Body Strategy Book"},{"quote":"“I stretched out on the bed and slept. It was twilight when I awakened and turned on the light. I felt better, no longer tired. I went to the typewriter and sat before it. My thought was to write a sentence, a single perfect sentence. If I could write one good sentence I could write two and if I could write two I could write three, and if I could write three I could write forever. But suppose I failed? Suppose I had lost all of my beautiful talent? Suppose it had burned up in the fire of Biff Newhouse smashing my nose or Helen Brownell dead forever? What would happen to me? Would I go to Abe Marx and become a busboy again? I had seventeen dollars in my wallet. Seventeen dollars and the fear of writing. I sat erect before the typewriter and blew on my fingers. Please God, please Knut Hamsun, don’t desert me now. I started to write and I wrote:“The time has come,” the Walrus said,“To talk of many things:Of shoes—and ships—and sealing wax—Of cabbages—and kings—”I looked at it and wet my lips. It wasn’t mine, but what the hell, a man had to start someplace.” ― John Fante, Dreams from Bunker Hill"},{"quote":"“A warm sunny evening, the plash and gurgle of the waves in the rock pools, the rush of the cold gin. I thought for the first time of my novel, abandoned, all these years, and I came up, unprompted, with the perfect title. Octet. Octet by Logan Mountstuart. Perhaps I will surprise them all, yet.” ― William Boyd, Any Human Heart"},{"quote":"“It takes time, patience, productivity and persistence to 'pop the oil'; just keep digging. Worthy investments take time to show positive returns.” ― T.F. Hodge"},{"quote":"“For success, don't take the path of least resistance. Take the path of most persistence.” ― Michele Jennae"},{"quote":"“Either you make things happen or you quit.” ― Vivian Weissman"},{"quote":"“It is not the best for us to lay embago on the industries that produce temptations. What we need to do is to compete, overcome and dominate the market with the products of our endurance. No battles we face, no crown will we win. No temptations exist, no conquerors are known.” ― Israelmore Ayivor"},{"quote":"“Believing in yourself truly means trusting your capability to think, learn, do, and deliver better results. In that case, it doesn’t matter where you’re starting from. As you keep going, you’re developing into a better person.” ― SuccessCoach Nilesh, Go For Success: Be a Champion by 6 Effective Steps"},{"quote":"“Patience can be bitter but her fruit is always sweet.” ― Habeeb Akande"},{"quote":"“Is anything truly impossible? Or is it that the path to our goals appears too unclear to follow? It seems to me that if you seek hard enough, pray hard enough, you usually stumble across a scattering of breadcrumbs that marks the trail leading to the goal you once considered beyond your reach.” ― Richelle E. Goodrich, Smile Anyway: Quotes, Verse, & Grumblings for Every Day of the Year"},{"quote":"“It's not about what you're capable of, it's about what you are willing to endure.” ― Orrin Woodward"},{"quote":"“Inspiration comes when you stick your elbows on the table, your bottom on the chair and you start sweating. Choose a theme, an idea, and squeeze your brain until it hurts. That's called inspiration.” ― Carlos Ruiz Zafón, The Angel's Game"},{"quote":"“Persistence is the twin sister of excellence. One is a matter of quality; the other, a matter of time.” ― Habeeb Akande"},{"quote":"“In conservation, the motto should always be 'never say die'.” ― Gerald Durrell, The Aye-Aye and I"},{"quote":"“People don't just live one life. They keep coming back until they get it right.” ― C R Strahan, Lucid Dreaming: A Novel"},{"quote":"“To shine and outshine the shining stars, to take your abilities to the greatest height, to sit on top of the world, you must fortify yourself with persistence, the determination and willingness to stay in the same direction over a long period of time whatever the cost might be.” ― Ogwo David Emenike, You Are a Star"},{"quote":"“While persistence offers no guarantees, it does give 'luck' a chance to operate.” ― Tom Shippey, The Road to Middle-Earth: How J.R.R. Tolkien Created a New Mythology"},{"quote":"“Do you have the talent?' is rarely the question. 'Do you have the guts to finish?' is the real question.” ― Orrin Woodward, LIFE"},{"quote":"“To be a highflier and a name to conjure with, you must decide your dimension, plan your path, master the moment, focus on the future, determine your degree, push your persistence and leadyour life.” ― IFEANYI ENOCH ONUOHA"},{"quote":"“You can either follow your dreams with determination and persistence until they become true, or you can be blown by the winds of fate - were anything can happen.” ― steven redhead, The Solution"},{"quote":"“Most of Csongor's time in T'Rain had been spent blundering about in a state of hapless newbie confusion. Only his long experience as a system administrator, struggling with Byzantine software installations, had prevented hum from plummeting into despair and simply giving up. Not that any of the sysadmin's knowledge and skills were applicable here. The psychological stance was the thing: the implicit faith, a little naive and a little cocky, that by banging his head against the problem for long enough he'd be able to break through in the end.” ― Neal Stephenson, Reamde"},{"quote":"“If I did not believe in life, if I were to lose faith in the woman I love, if I were to lose faith in the order of things, even if I were to become convinced, on the contrary, that everything is a disorderly, damned, and perhaps devilish chaos, if I were struck even by all the horrors of human disillusionment-still I would want to live, and as long as I have bent to this cup, I will not tear myself from it until I've drunk it all!” ― Fyodor Dostoyevsky The Brothers Karamazov"},{"quote":"“I will not be defined by the marks left on me by the world, but by the mark I leave on the world (referring to the facial scars he still carries from his successful 1991 battle against cancer, which caused him to be turned down for a customer service job because he was \"too ugly\").” ― James Houston Turner"},{"quote":"“A series of failures may culminate in the best possible result.” ― Gisela Richter"},{"quote":"“Temporary setbacks are overshadowed by persistence.” ― Quentin L. Cook"}]
