[{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“Sometimes you go through things that seem huge at the time, like a mysterious glowing cloud devouring your entire community. While they're happening, they feel like the only thing that matters and you can hardly imagine that there's a world out there that might have anything else going on. And then the glow cloud moves on. And you move on. And the event is behind you. And you may find, as time passes, that you remember it less and less. Or absolutely not at all, in my case.” ― Welcome to Night Vale"},{"quote":"“Should it concern us that the bible never calls us to ask Jesus into our hearts. Should it concern us that the bible never mentions such a superstitious sinners prayer and yet that is exactly what we have sold to so many as salvation.” ― David Platt"},{"quote":"“Turning away from a flight from death, you see a horizon of opportunity that puts you in a state of anticipatory resoluteness with solicitous regard for others that makes your life seem like an adventure perfused with unshakeable joy.” ― Heidegger, Martin"},{"quote":"“I've never seen anyone's life get better by complaining about reality, I've seen it get better by accepting reality as it is and then making personal decisions to make it better.” ― Ben Shapiro"},{"quote":"“I’ve been thinking lately of our pizza nights. Dough from scratch, sauce from scratch, cheese from…well, from the store. Not goin’ that far. I loved the making of bread, the dough for the crust. Flour and water in your hands, first separate and then merging into a silky whole. The yeast and gluten making it a living thing. It moves when you poke it. It breathes into your hands. Our hands covered in flour, we open a bottle of wine, and we eat the pizza we made, and…we just watch whatever’s on TV and fall asleep in a wine and bread coma.I think love is cooking together. I think it’s making something with each other, that’s what I think, Alice. I don’t know what you think. Turns out that I didn’t know what you were thinking at all.” ― Alice Isn't Dead"},{"quote":"“Activate your followers, don’t just collect them like stamps.” ― Stacey Kehoe"},{"quote":"“[W]ith a heavy heart, we are biding farewell to those entries that were written in rhyming slang, which utilized Atbash cyphering, and which assumed expert knowledge of American Sign Language and the inner intricacies of the I Ching from its readers.” ― Marcus Cutter, Pryce and Carter’s Deep Space Survival Procedure & Protocol Manual"},{"quote":"“Grey men in grey suits going greyly about the tedious business of running the world” ― Joseph Fink, Alice Isn't Dead"},{"quote":"“If you love to write, start a blog. If you love to talk, start a podcast. If you love to solve problems, start a business. If you love freedom, do what you love.” ― Maxime Lagacé"},{"quote":"“Whatever you're thinking, you get it out of that damned foolish head of yours right now.' Except it's not in my head, it's in my heart, and she's the same woman who told me if you're going to follow anything, it might as well be that. Even if it's a mess.” ― Courtney Summers, Sadie"},{"quote":"“I'd tell anyone who wants to be a podcaster, the same thing others have recommended - find a niche you're passionate about and willing to be immersed in.” ― Sandra Sealy, Chronicles Of A Seawoman: A Collection Of Poems"},{"quote":"“Books are an intimate art form…the way books work is they are necessarily a union between the imagination of the reader and the words that are on the page. Everyone’s experience with a book is different.” ― Ta-Nehisi Coates"},{"quote":"“Alex Blumberg: What if *I wanted to say 'Hey pull out your phones right now, and I'll show you a picture of what a better podcasting app would look like'? I can't. In other words, podcasts are still the same old MP3s they've always been, and by 'always', I mean, since the dark ages in 2004, when, according to Wikipedia, the word 'podcast' appeared for the first time in history. Matt says 'You're missing the truly big opportunity here - to make your own app - to take podcasting out of the dark ages, reinvent the way we listen.'Matt Mazzeo: Podcasts is frankly a technology that has really core audience on it that just love it, that hasn't broken out into the broader mainstream. Most people aren't podcast listeners. There are a whole bunch of things that are broken there, that you have an opportunity to fix.” ― Gimlet Media"},{"quote":"“While many say Schrager’s work is about design, it isn’t—it’s about ideas and experiences. Ian uses the power of his ideas to tap into what he calls the “collective unconsciousness, the ethereal, elusive, and hard-to-define magic and energy.” He understands the power of this intangible, emotional place and uses it to connect deeply with his customers. He knows that “the way a product makes you feel is more important than how it looks. The goal is to create experiences that people will remember, to touch them in emotional and visceral ways, to lift their spirits, to assault their senses, and to wow them in tasteful ways.” But just as important, Schrager under- stands that an amazing experience can’t be created from ideas alone, knowing that “good execution is just as important as a good idea.” And he has consistently manifested his creative potential because he has regularly married the four key elements that create value in our new age: purpose, creativity, execution, and emotion.” ― Alan Philips, The Age of Ideas: Unlock Your Creative Potential"},{"quote":"“When I refer to experienced creativity as a critical part of manifesting your ideas, I’m pointing to the need for creativity that has been steadily practiced through years of experi- mentation; whether or not you’re a prodigy, that’s what it takes to reach your potential.” ― Alan Philips, The Age of Ideas: Unlock Your Creative Potential"},{"quote":"“Podcasting has become one of the fasted and trusted tools/channels for building and promoting brands.” ― Bernard Kelvin Clive"},{"quote":"“Tim Ferriss, Rogaine, Brian Rose, Rich Roll... etc. how do they get away with this shit. Have long talks with mostly uninteresting characters, and sometimes they just fucking interview each other. How do I get in on the action. On this little scam. Just kidding. I have better things to do. I got Runescape. Sometimes I watch Mishlove. At least he talks to dogs and poltergeists.” ― Dmitry Dyatlov"},{"quote":"“Wait What Really OK is A methodical, comical and informational podcast sharing authentic brand messaging, optics approaches & strategies for honorable authority driven businesses.” ― Loren Weisman"},{"quote":"“O sitcom (...) é a crônica do audiovisual. O sitcom também vive do pequeno, do miúdo, embora a maneira dele se desenvolver seja uma maneira dramatúrgica, que é diferente da crônica, o tema é o mesmo” ― Antonio Prata"},{"quote":"“It was suggested to me once that it’s called art-work, not art-fucking-around.” ― David duChemin"},{"quote":"“When the person you rely on for support and survival shows themselves to be not what you expected, it can cut deep.” ― Tony Overbay, He's a Porn Addict...Now What? An Expert and A Former Addict Answer Your Questions"},{"quote":"“Like other chronic diseases, addiction often involves cycles of relapse and remission. But there is help, and there is hope.” ― Tony Overbay, He's a Porn Addict...Now What? An Expert and A Former Addict Answer Your Questions"},{"quote":"“A round of applause for circles.” ― Roman Mars, The 99% Invisible City: A Field Guide to the Hidden World of Everyday Design"},{"quote":"“you're gonna have to jump through all these hoops, Mr Beta.” ― Rollo Tomassi"},{"quote":"“a lot of words here... that I don't understand.” ― Mikhaila Peterson"},{"quote":"“Every great philosopher, in their own way, questioned the fundamental assumptions that were present in the thinking of their time” ― Steven West"},{"quote":"“No! What? Grayson, bro! I’m not gonna keep doin’ the pod with you if you rape and kill this girl.” ― Mert, Threes: 1"},{"quote":"“....I wasn't being mean or anything. I wasn't scaring her at that point. I was trying, you know, to see like a normal person.” ― Israel Keyes"},{"quote":"“-reply- \"but you felt called too?\" [In reference to why Menchú joined the clergy, Getting out. Helping people.]\"It was my best chance to accomplish what I wanted to accomplish\"-reply-\"Which was?\"\"To help people.\" Menchú said, \"If not to save them, at least to help them when they could not be saved.” ― Max Gladstone, Bookburners: The Complete Season 5"},{"quote":"“Remember: if you see something, say nothing, and drink to forget.” ― Welcome to Night Vale"},{"quote":"“There's a monster at the end of this book. It's the blank page where the story ends and you're left alone with yourself and your thoughts.” ― Welcome to Night Vale"},{"quote":"“Whisper a dangerous secret to someone you care about. Now they have the power to destroy you, but they won't. This is what love is.” ― Welcome to Night Vale"},{"quote":"“The moon’s weird though, right? It’s there, and there, and then suddenly it’s not. And it seems to be pretty far up. Is it watching us? If not, what is it watching instead? Is there something more interesting than us? Hey, watch us moon! We may not always be the best show in the universe, but we try.” ― Welcome to Night Vale"},{"quote":"“And now a brief public service announcement. Alligators: can they kill your children? Yes.” ― Welcome to Night Vale"},{"quote":"“It’s nice to have a station pet. Wish it wasn’t trapped in a hovering prison in the men’s bathroom, but listen: no pet is perfect. It becomes perfect when you learn to accept it for what it is.” ― Welcome to Night Vale"},{"quote":"“We have nothing to speak about. There never was. Words are an unnecessary trouble. Expression is time wasting away. Any communication is just a yelp in the darkness. I am speaking now but I am saying nothing. I am just making noises, and, as it happens, they are organized in words and you should not draw meaning from this.” ― Welcome to Night Vale"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“Listening to podcast, reading a book, listening to an aduibook and watching films isn't waste of time. It's how somebody becomes wise!” ― Deyth Banger"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“Long story short: The end.” ― Paul F. Tompkins"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“I’m creating a self help show called Self Talk. I’ll insult myself for an hour then open phone lines to a fitness coach & my mother-in-law.” ― Ryan Lilly"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"},{"quote":"“ With all due disrespect...” ― Sir Topless Bottomley"},{"quote":"“Truth is the greatest marketing campaign.” ― Richie Norton"}]
