[{"quote":"“No matter how long you train someone to be brave, you never know if they are or not until something real happens.” ― Veronica Roth, Insurgent"},{"quote":"“Art is unquestionably one of the purest and highest elements in human happiness. It trains the mind through the eye, and the eye through the mind. As the sun colors flowers, so does art color life.” ― John Lubbock, The Pleasures of Life"},{"quote":"“My muscles informed me they did not want to go through any more exercise today. So I suggest that maybe he should let me off this time. He laughed, and I'm pretty sure it was at me...not with me. \"Why is that funny?\" \"Oh,\" he said, his smile dropping. \"You were serious.\"\"Of course I was! Look, I've technically been awake for two days. Why do we have to start this training now? Let me go to bed.\" I whined. \"It's just one hour.\"\"How do you feel right now?\"\"I hurt like hell.\"\"You'll feel worse tomorrow.\"\"So?\"\"So, better get a jump on it while you still feel...not as bad.\"\"What kind of logic is that?\" I retorted.” ― Richelle Mead, Vampire Academy"},{"quote":"“What has mood to do with it? You fight when the necessity arises—no matter the mood! Mood's a thing for cattle or making love or playing the baliset. It's not for fighting.” ― Frank Herbert, Dune"},{"quote":"“No one learns as much about a subject as one who is forced to teach it.” ― Peter Drucker"},{"quote":"“He who conquers himself is the mightiest warrior.” ― Confucius"},{"quote":"“How do you feel right now?\" \"I hurt like hell.\"\"You'll feel worse tomorrow.\"\"So?\"\"So, better get a jump on this while you still feel...not as bad.\"\"What kind of logic is that?\" I retorted.” ― Richelle Mead, Vampire Academy"},{"quote":"“If you want to teach people a new way of thinking, don't bother trying to teach them. Instead, give them a tool, the use of which will lead to new ways of thinking.” ― Richard Buckminster Fuller"},{"quote":"“Practice is the hardest part of learning, and training is the essence of transformation.” ― Ann Voskamp, One Thousand Gifts: A Dare to Live Fully Right Where You Are"},{"quote":"“If you want to find the real competition, just look in the mirror. After awhile you'll see your rivals scrambling for second place.” ― Criss Jami, Killosophy"},{"quote":"“Aren't they supposed to be hiring someone else to train me, ANYWAY?\"\"Yes,\" he said, getting up and pulling her to her feet with him. \"and I'm worried that if you get into the habit of making out with your instructors, you'll wind up making out with him, too.\"\"Don't be sexist. They could find me a female instructor.\"\"In that case you have my permission to make out with her, as long as I can watch.\"\"Nice.\" Clary grinned, bending down to fold up the blanket they'd brought to sit on. \"You're just worried they'll hire a male instructor and he'll be hotter than you.\"Jace's eyebrows went up. \"Hotter than ME?\"\"It could happen,\" Clary said. \"You know, theoretically.\"\"Theoretically the planet can crack in half, leaving me on one side and you on the other side, forever and tragically parted, but I'm not worried about that, either. Some things,\" Jace said, with his customary crooked smile, \"are just too unlikely to dwell upon.” ― Cassandra Clare"},{"quote":"“I work my hardest and she still kicks the crap out of me.” ― Pittacus Lore, The Power of Six"},{"quote":"“It's much easier on the emotions when one sees life as an experiment rather than a struggle for popularity.” ― Criss Jami, Killosophy"},{"quote":"“If we can use an H-bomb--and as you said it's no checker game; it's real, it's war and nobody is fooling around--isn't it sort of ridiculous to go crawling around in the weeds, throwing knives and maybe getting yourself killed . . . and even losing the war . . . when you've got a real weapon you can use to win? What's the point in a whole lot of men risking their lives with obsolete weapons when one professor type can do so much more just by pushing a button?'Zim didn't answer at once, which wasn't like him at all. Then he said softly, 'Are you happy in the Infantry, Hendrick? You can resign, you know.'Hendrick muttered something; Zim said, 'Speak up!'I'm not itching to resign, sir. I'm going to sweat out my term.'I see. Well, the question you asked is one that a sergeant isn't really qualified to answer . . . and one that you shouldn't ask me. You're supposed to know the answer before you join up. Or you should. Did your school have a course in History and Moral Philosophy?'What? Sure--yes, sir.'Then you've heard the answer. But I'll give you my own--unofficial--views on it. If you wanted to teach a baby a lesson, would you cuts its head off?'Why . . . no, sir!'Of course not. You'd paddle it. There can be circumstances when it's just as foolish to hit an enemy with an H-Bomb as it would be to spank a baby with an ax. War is not violence and killing, pure and simple; war is controlled violence, for a purpose. The purpose of war is to support your government's decisions by force. The purpose is never to kill the enemy just to be killing him . . . but to make him do what you want him to do. Not killing . . . but controlled and purposeful violence. But it's not your business or mine to decide the purpose of the control. It's never a soldier's business to decide when or where or how--or why--he fights; that belongs to the statesmen and the generals. The statesmen decide why and how much; the generals take it from there and tell us where and when and how. We supply the violence; other people--\"older and wiser heads,\" as they say--supply the control. Which is as it should be. That's the best answer I can give you. If it doesn't satisfy you, I'll get you a chit to go talk to the regimental commander. If he can't convince you--then go home and be a civilian! Because in that case you will certainly never make a soldier.” ― Robert A. Heinlein, Starship Troopers"},{"quote":"“As night fell, Yamamoto, aboard the huge battleship Yamato, steamed eastward at full speed into the night. Far ahead the destroyers went to flank speed to search for the US carriers. Lookouts, with the best night-vision binoculars in the world, swept the night horizon where the very dark sky meets the black ocean. The faintest shape, the tiniest pinprick of light, would show there was something out there, like the superstructure of a ship over the horizon. There was nothing.” ― Dale A. Jenkins, Diplomats & Admirals: From Failed Negotiations and Tragic Misjudgments to Powerful Leaders and Heroic Deeds, the Untold Story of the Pacific War from Pearl Harbor to Midway"},{"quote":"“The essence of training is to allow error without consequence.” ― Orson Scott Card, Ender’s Game"},{"quote":"“One may not always know his purpose until his only option is to monopolize in what he truly excels at. He grows weary of hearing the answer 'no' time and time again, so he turns to and cultivates, monopolizes in his one talent which others cannot possibly subdue. Then, beyond the crowds of criticism and rejection, the right people recognize his talent - among them he finds his stage.” ― Criss Jami, Killosophy"},{"quote":"“Before the first streaks of light at dawn on December 7, 275 miles north of Oahu, the six (Japanese) carriers of the Striking Force turned into the southeast wind. Pounding into heavy swells at high speed, the carriers pitched severely with thunderous impact. The wind, surging seas, and roar of warming aircraft engines made communications possible only by hand signals and handheld signal lamps. Salt spray reached the high flight decks, and Commander Fuchida, the group leader, was very concerned about the conditions for launching planes. If this had been a training exercise the launch might have been delayed until conditions improved. However, this was not an exercise, and there would be no delay.” ― Dale A. Jenkins, Diplomats & Admirals: From Failed Negotiations and Tragic Misjudgments to Powerful Leaders and Heroic Deeds, the Untold Story of the Pacific War from Pearl Harbor to Midway"},{"quote":"“Champions do not become champions when they win the event, but in the hours, weeks, months and years they spend preparing for it. The victorious performance itself is merely the demonstration of their championship character.” ― T. Alan Armstrong"},{"quote":"“Thus the man who is responsive to artistic stimuli reacts to the reality of dreams as does the philosopher to the reality of existence; he observes closely, and he enjoys his observation: for it is out of these images that he interprets life, out of these processes that he trains himself for life.” ― Friedrich Nietzsche, Twilight of the Idols / The Anti-Christ"},{"quote":"“Civilize The Mind, But Make Savage The Body.” ― Ancient Chinese Proverb"},{"quote":"“Every beginner possesses a great potential to be an expert in his or her chosen field.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Give me a dozen healthy infants, well-formed, and my own specified world to bring them up in and I’ll guarantee to take any one at random and train him to become any type of specialist I might select—doctor, lawyer, artist, merchant-chief and, yes, even beggar-man and thief, regardless of his talents, penchants, tendencies, abilities, vocations, and race of his ancestors. (1930)” ― John Broadus Watson, Behaviorism"},{"quote":"“I frowned as my fingers throbbed. “Wait a sec. There’s a chance I can’t work with fire and you let me do that?”“How else am I going to figure out your limitations?”“What the hell!” I pulled my hand free, furious. “That’s not cool, Blake. What’s next? Trying to stop a moving vehicle by standing in front of it, but whoops, I can’t do that and now I’m dead?” ― Jennifer L. Armentrout, Onyx"},{"quote":"“Our enemies are Medes and Persians, men who for centuries have lived soft and luxurious lives; we of Macedon for generations past have been trained in the hard school of danger and war. Above all, we are free men, and they are slaves. There are Greek troops, to be sure, in Persian service — but how different is their cause from ours! They will be fighting for pay — and not much of at that; we, on the contrary, shall fight for Greece, and our hearts will be in it. As for our foreign troops — Thracians, Paeonians, Illyrians, Agrianes — they are the best and stoutest soldiers in Europe, and they will find as their opponents the slackest and softest of the tribes of Asia. And what, finally, of the two men in supreme command? You have Alexander, they — Darius!” ― Alexander the Great"},{"quote":"“If there is no element of asceticism in our lives, if we give free rein to the desires of the flesh (taking care of course to keep within the limits of what seems permissible to the world), we shall find it hard to train for the service of Christ. When the flesh is satisfied it is hard to pray with cheerfulness or to devote oneself to a life of service which calls for much self-renunciation.” ― Dietrich Bonhoeffer, The Cost of Discipleship"},{"quote":"“When we set about accounting for a Napoleon or a Shakespeare or a Raphael or a Wagner or an Edison or other extraordinary person, we understand that the measure of his talent will not explain the whole result, nor even the largest part of it; no, it is the atmosphere in which the talent was cradled that explains; it is the training it received while it grew, the nurture it got from reading, study, example, the encouragement it gathered from self-recognition and recognition from the outside at each stage of its development: when we know all these details, then we know why the man was ready when his opportunity came.” ― Mark Twain, How Nancy Jackson Married Kate Wilson and Other Tales of Rebellious Girls and Daring Young Women"},{"quote":"“Every great achiever is inspired by a great mentor.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Poets, like fighters, both reap the benefits of roadwork.” ― Cameron Conaway, Caged: Memoirs of a Cage-Fighting Poet"},{"quote":"“It is not uncommon for fighters’ camps to be gloomy. In heavy training, fighters live in dimensions of boredom others do not begin to contemplate. Fighters are supposed to. The boredom creates an impatience with one’s life, and a violence to improve it. Boredom creates a detestation for losing.” ― Norman Mailer, The Fight"},{"quote":"“At one time I thought the most important thing was talent. I think now that — the young man or the young woman must possess or teach himself, train himself, in infinite patience, which is to try and to try and to try until it comes right. He must train himself in ruthless intolerance. That is, to throw away anything that is false no matter how much he might love that page or that paragraph. The most important thing is insight, that is ... curiosity to wonder, to mull, and to muse why it is that man does what he does. And if you have that, then I don't think the talent makes much difference, whether you've got that or not.[Press conference, University of Virginia, May 20, 1957]” ― William Faulkner"},{"quote":"“So, I must be taken as I have been made. The success is not mine, the failure is not mine, but the two together make me.” ― Charles Dickens, Great Expectations"},{"quote":"“Your comfort zone is a place where you keep yourself in a self-illusion and nothing can grow there but your potentiality can grow only when you can think and grow out of that zone.” ― Rashedur Ryan Rahman"},{"quote":"“Pain was their body's way of telling them that they'd pushed themselves to their limits -- which was exactly where they were supposed to be.” ― Richard Marcinko, Rogue Warrior"},{"quote":"“Never take advice about never taking advice. That is an old vice of men - to dish it out without being able to take it - the blind leading the blind into more blindness.” ― Criss Jami, Healology"},{"quote":"“True leaders bring out your personal best. They ignite your human potential”.” ― John Paul Warren"},{"quote":"“War can condition a person to be resilient, tolerant, dependable, strong, and capable of so much more than one who had experienced nothing of it; it can bring out the very best in us, but also the very worst. Where is it, I ask, the proper conduit through which a soldier should be raised from whence they would become an upstanding citizen of the world, instead of a single country?” ― Mike Norton"},{"quote":"“Athletes need to enjoy their training. They don't enjoy going down to the track with a coach making them do repetitions until they're exhausted. From enjoyment comes the will to win.” ― Arthur Lydiard"},{"quote":"“Selfishly, perhaps, Catti-brie had determined that the assassin was her own business. He had unnerved her, had stripped away years of training and discipline and reduced her to the quivering semblance of a frightened child. But she was a young woman now, no more a girl. She had to personally respond to that emotional humiliation, or the scars from it would haunt her to her grave, forever paralyzing her along her path to discover her true potential in life.” ― R.A. Salvatore, Streams of Silver"},{"quote":"“If you want to be a successful runner, you have to consider everything. It's no good just thinking about endurance and not to develop fine speed.” ― Arthur Lydiard"},{"quote":"“The parent is protector and trainer, but never the ultimate teacher. Every parent is responsible for teaching their kid basic moral conduct, manners, the difference between love and hate, and right from wrong. However, after maturity, the child must set off to seek knowledge on their own. Religion is never to be forced. And you cannot threaten your child with hell and tell them your religion is the only right way. There is no one right way. The many ways to the Creator are as varied as the colors of a rainbow.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“We trust to novels to train us in the practice of great indignations and great generositie.” ― Henry James"},{"quote":"“I might walk vast expansesof earth and always be beginningand I love beginningor could learnto love it.” ― S. Jane Sloat"},{"quote":"“Dr. Talbon was struck by another very important thing. It all hung together. The stories Cheryl told — even though it was upsetting to think people could do stuff like that — they were not disjointed They were not repetitive in terms of \"I've heard this before\". It was not just she'd someone trying consciously or unconsciously to get attention. really processed them out and was done with them. She didn't come up with them again [after telling the story once and dealing with it]. Once it was done, it was done. And I think that was probably the biggest factor for me in her believability. I got no sense that she was using these stories to make herself a really interesting person to me so I'd really want to work with her, or something. Or that she was just living in this stuff like it was her life. Once she dealt with it and processed it, it was gone. We just went on to other things. 'Throughout the whole thing, emotionally Cheryl was getting her life together. Parts of her were integrating where she could say,\"I have a sense that some particular alter has folded in with some basic alter\", and she didn't bring it up again. She didn't say that this alter has reappeared to cause more problems. That just didn't happen. The therapist had learned from training and experience that when real integration occurs, it is permanent and the patient moves on.” ― Cheryl Hersha, Secret Weapons: How Two Sisters Were Brainwashed to Kill for Their Country"},{"quote":"“Train up a child in such a way she or he should go; even when she or he is old she or he will not depart' Proverb” ― Santosh Avvannavar, God's Table: The Last Supper"},{"quote":"“People skills are useless with cats, because cats are immune to training, and do whatever they decide in any situation... And most importantly they aren’t human.” ― Will Advise, Nothing is here..."},{"quote":"“If you would understand this secret, you must first understand the distinction between training an animal and educating one. Trained animals are relatively easy to turn out. All that is required is a book of instructions, a certain amount of bluff and bluster, something to use for threatening and punishing purposes, and of course the animal. Educating an animal, on the other hand, demands keen intelligence, integrity, imagination, and the gentle touch, mentally, vocally, and physically.” ― J. Allen Boone, Kinship with All Life"},{"quote":"“Train, don't strain.” ― Arthur Lydiard"},{"quote":"“For several thousand years man has been in contact with animals whose character and habits have been deformed by domestication. He has ended by believing that he understands them. All he means by this is that he is able to rely on certain reflex actions which he himself has implanted in them. He will flatter himself at times on the grasp of animal psychology which has brought him the love of the dog and the purr of the cat; and on the strength of such assumptions he approaches the beasts of the jungle. The old tag about nature being an open book is just not true. What nature offers on a first examination may appear to be simple but it is never as simple as it appears.” ― Hans Brick, Jungle, Be Gentle"},{"quote":"“Remember, without a goal, your stamina is useless no matter how you get trained. You may defend your integrity and attack your obstacles, but when you have no target in focus, you will score many zero number of goals...” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Here is a truth that most teachers will not tell you, even if they know it: Good training is a continual friend and a solace; it helps you now, and assures you of help in the future. Good education is a continual pain in the neck, and assures you always of more of the same.” ― Richard Mitchell, The Gift of Fire"},{"quote":"“Training is a good dog, a constant companion and an utterly loyal and devoted friend, and everyone should have one. Education is a nagging counselor. And, I am convinced, everyone does have one. It happens, however, that some nagging counselors have grown strong by a certain kind of nourishment. Others are weak and puny, even infantile, having never been nourished at all.” ― Richard Mitchell, The Gift of Fire"},{"quote":"“How's that training coming along, Griff? Good old Max says you're a natural.\"Turner frowned. Any time a white man asked you about yourself, they were about to fuck you over.” ― Colson Whitehead, The Nickel Boys"},{"quote":"“Vague statements are interchangeable.” ― Robert Mager"},{"quote":"“I griped about it at lunch one day to Bill Weist and Dr. Leslie Squier, our visiting psychologists from Reed College. I'd been trying to train one otter to stand on a box, I told them. No problem getting the behavior; as soon as I put the box in the enclosure, the otter rushed over and climbed on top of it. She quickly understood that getting on the box earned her a bite of fish, But. As soon as she got the picture, she began testing the parameters. 'Would you like me lying down on the box? What if I just put three feet on the box? Suppose I hang upside down from the edge of the box? Suppose I stand on it and look under it at the same time? How about if I put my front paws on it and bark?' For twenty minutes she offered me everything imaginable except just getting on the box and standing there. It was infuriating, and strangely exhausting. The otter would eat her fish and then run back to the box and present some new, fantastic variation and look at me expectantly (spitefully, even, I thought) while I struggled once more to decide if what she was doing fit my criteria or not.My psychologist friends flatly refused to believe me; no animal acts like that. If you reinforce a response, you strengthen the chance that the animal will repeat what it was doing when it was reinforced; you don't precipitate some kind of guessing game. So I showed them. We all went down to the otter tank, and I took the other otter and attempted to get it to swim through a small hoop. I put the hoop in the water. The otter swam through it, twice. I reinforced it. Fine. The psychologists nodded. Then the otter did the following, looking up for a reward each time: swam through the hoop and stopped, leaving its tail on the other side. Swam through and caught the hoop with a back foot in passing, and carried it away. Lay in the hoop. Bit the hoop Backed through the hoop. 'See?' I said. 'Otters are natural experimenters.” ― Karen Pryor, Lads Before the Wind: Diary of a Dolphin Trainer"},{"quote":"“In due course I would learn how to cover up for this event, but on that awful day I knew of nothing to say but: 'Well, I guess they aren't going to do that either, heh, heh.\" FINALLY Hoku and Kiko stopped staring suspiciously through the glass long enough to go over the six bars, gracefully arcing in and out of the water against the glass, making the beautiful picture they were supposed to. I waved frantically at Chris to stop right there, to quit while we were ahead. I thanked the politely clapping audience and suggested they come back in a month and see what Hoku and Kiko could really do (I didn't have the courage to order them to KEEP clapping, and louder, please, so that Hoku and Kiko would do the applause jump). Then I yanked out the mike plug, raced down the ladder into the trainers' little sitting room underneath the stage, and took up smoking again.” ― Karen Pryor, Lads Before the Wind: Diary of a Dolphin Trainer"},{"quote":"“Do not feed that beggar. Hamlet, lie down.” The dog ignored her.“Down,” Viktor ordered, his deep voice stern. The dog whined and then lay down. The prince looked at her. “You need to be more forceful.”“I suppose my forcefulness will improve once my voice changes. Sopranos get no respect.” ― Patricia Grasso, Seducing the Prince"},{"quote":"“Right, he can kill the dead. What happens when he realizes we're training him to kill the living?” ― Robert Kirkman, The Walking Dead, Vol. 26: Call to Arms"},{"quote":"“Remember, the real aggressors are not going to hold back and play by the rules. This is why you want to train holistically by going through a variety of scenarios — so that you don’t get caught up by surprise when a new scenario hits you.” ― Thomas Lu, The Personal Sustainability Handbook: 60+ Practices to Sustainabilize Your Health, Finances, Relationships and Beyond"},{"quote":"“We should remember that one man is much the same as another, and that he is best who is trained in the severest school.” ― Thucydides, The Best of Thucydides: Fifteen Extracts from Thucydides' \"History of the Peloponnesian War\""},{"quote":"“Gribble’s journey was in many ways different from others around him. He was often looked after and fed by local village chiefs where news was exchanged and advice given on both sides. He was concerned that the lives of the Kachin and Naga people were being turned upside down by the thousands of refugees. Later he was overwhelmed with worries about his own survival, but even at that final stage he had contact with local guides.” ― Elizabeth Tebby Germaine, EXTRAORDINARY TRUE STORIES OF SURVIVAL IN BURMA WW2: tens of thousands fled to India from the Japanese Invasion in 1942"},{"quote":"“The Japs,” said one Indian, “have reduced Mandalay to ashes, and their bombers are operating all over the country. They are a barbarous foe and have butchered many of their prisoners.” ― Elizabeth Tebby Germaine, EXTRAORDINARY TRUE STORIES OF SURVIVAL IN BURMA WW2: tens of thousands fled to India from the Japanese Invasion in 1942"},{"quote":"“I have had the joy of seeing him constantly putting himself and his companions through countless drills and possible tactical situations, which will result in instant action by the warriors without the necessity of giving them orders because every man in his units will know what he must do and when he must do it.” ― Michael G. Kramer, Full Story of the Anglo-Saxon Invasion"},{"quote":"“I teach you to be warriors in the garden, so that you may never be gardeners in a war.” ― Tomi Adeyemi, Children of Anguish and Anarchy"},{"quote":"“We must make sure that we do not get casualties from training!” ― Michael G. Kramer, Full Story of the Anglo-Saxon Invasion"},{"quote":"“There are two basic military functions: waging war and preparing for war. Any military activities that do not contribute to the conduct of a present war are justifiable only if they contribute to preparedness for a possible future one. Clearly, we cannot afford to separate conduct and preparation. They must be intimately related because failure in preparation leads to disaster on the battlefield.” ― U.S. Marine Corps, Warfighting"},{"quote":"“To train the body is to honor the temple that houses the spirit, fortifying it against the storms of life.” ― Aloo Denish Obiero"},{"quote":"“In his Close Quarter Defense School training, Duane Dieter tells the platoon SEALs, “The truth of combat is; to fight is to risk death.” ― Dick Couch, The Warrior Elite: The Forging of SEAL Class 228"},{"quote":"“Here's how we're going to teach. If you see your student doing something wrong, you give him a positive correction. Not a negative correction. Instead of telling him *not* to do what he's doing wrong, identify the fundamental he needs to be implementing, and remind him to do that.” ― Brandon Webb, The Killing School: Inside the World's Deadliest Sniper Program"},{"quote":"“Beauty may be dangerous, but intelligence is lethal.” ― Paisley Jacobs, Heaven Sent"},{"quote":"“Training is only as good as how one performs in the battle, People won’t remember how hard one trained before battle, but people will remember how one fared during the battle.” ― Shon Mehta, Lair Of The Monster"},{"quote":"“I waved and shook my head at Max. \"Don't look so surprised. Humans seem very attracted to elves, even the old crusty anes with one eye.\"\"That's gonna earn you extra training, kid,\" Max grumbled and started walking.\"Crap!” ― E.V. Drake, Elves of Fate: Denial"},{"quote":"“A famous Russian Field Marshal and opponent of Napoleon, Count Alexander V. Suvorov (1729–1800), once said, ‘Train hard and fight easy.’ It has become a famous Army quotation, often repeated. He got it spot on, especially where the SAS is concerned.” ― Geordie Doran, Geordie: SAS Fighting Hero"},{"quote":"“Everybody knew that the only way for the United States to get out of Afghanistan was by creating a strong Afghan Army. The 101st called their effort to achieve this shonna ba shonna, translated as “shoulder to shoulder.” ― Kevin Maurer, Gentlemen Bastards: On the Ground in Afghanistan with America's Elite Special Forces"},{"quote":"“Critiques are an important part of training because critical self-analysis, even after success, is essential to improvement. Their purpose is to draw out the lessons of training. As a result, we should conduct critiques immediately after completing training, before memory of the events has faded. Critiques should be held in an atmosphere of open and frank dialogue in which all hands are encouraged to contribute. We learn as much from mistakes as from things done well, so we must be willing to admit mistakes and discuss them. Of course, a subordinate’s willingness to admit mistakes depends on the commander’s willingness to tolerate them. Because we recognize that no two situations in war are the same, our critiques should focus not so much on the actions we took as on why we took those actions and why they brought the results they did.” ― U.S. Marine Corps, Warfighting"},{"quote":"“Our deepest secrets are nothing but unsung songs, Lyra.\"Palmyra would always repeat this to Lyra at every opportunity.\"And certain vegetables,Palmyra would repeat to Lyra at every opportunity,\"when held in the hand of the cook, can just pick these secrets up and listen to them being silently sung.” ― Suzy Valtsioti, Lyra's Kitchen: A Culinary Chronicle of Simmering Secrets"},{"quote":"“Being healthy and strong is hard. Being unhealthy and weak is very hard.” ― Raven., Hero, Vol. 2: A Self-Improvement Workbook Series, The Most Epic Diet Ever & Ultimate Training"},{"quote":"“Coaching is personal.Consulting is organizational.Training is for groups.” ― Richie Norton"},{"quote":"“Coaching is personal. Consulting is organizational. Training is grouped.” ― Richie Norton"},{"quote":"“Great coffee is an art, and every barista is an artist in the making.” ― galaxy"},{"quote":"“I respect every Type of Sports, but the best Training stays the Fight against one's own Mind – lifting Weights until Power- & Pain Threshold.” ― Sino Melo"},{"quote":"“Training that isn’t applied is training that’s forgotten. Make learning stick—or don’t bother.” ― Erden Tuzunkan"},{"quote":"“Leadership training, when effectively implemented, holds the potential to transform both organizations and industries. However, for it to have lasting impact, it cannot be limited to isolated workshops or seminars. Instead, it should become an integral part of an organization's culture—strengthened through mentorship, capacity-building initiatives, and broad institutional reforms that foster an environment where leadership can genuinely flourish.” ― George K'Opiyo, Rethinking Leadership in Afria: Reflections on Dependency and Learned Helplessness"},{"quote":"“Make your training time count the most by focusing upon the situations you are most likely to encounter and the moves most likely to succeed.” ― Heroes of the Art, The Danaher Diaries: Over 100 of John Danaher's Musings on Jiu-Jitsu, Kaizen, Training, and Living"},{"quote":"“I hate you,\" I muttered, before climbing onto the tracks and glaring at her as she grinned. \"That's a good Dungeon Lord,\" she praised me. \"I'd pat your head and give you a cookie, but I haven't got any and I don't want to. Now run.” ― Jez Cajiao, Age of Conquest"},{"quote":"“They ran all over Fort Benning. All over kingdom come. Airborne was simply infantry dropped into war without any means of transport. Anywhere you had to go you went on foot, which required men of exceptional endurance. The goal of the first week was to weed out anyone who wasn’t supremely fit. No sense training you to jump if you didn’t have the stamina.” ― Jack Wang, The Riveter"},{"quote":"“I know that Jiu Jitsu is my therapy; I if miss a session I become grumpy. When I don’t go for a few days my wife begs me to go because I always come back more relaxed and a better person, a better husband and a more patient father.” ― Coach Ben BJJ, Brazilian Jiu-Jitsu for Beginners: Your First Steps on the Mat"},{"quote":"“تحقیقات تربیتی و همچنین زمینه ی نوروساینس که به سرعت در حال پیشرفت است به ما می گوید که همه ی انسان ها (حتی آنهایی که با چالش های شناختی به دنیا آمده اند) دارای ظرفیت پرورش تمام لیاقت های انسانی را تا والاترین درجه، اگر چه متفاوت با یکدیگر، دارند. نه تنها ما در هنگام تولد به چیزی محکوم نشده ایم، بلکه دارای پتانسیل هایی هستیم که به ندرت کاملا متوجه آنها می شویم. بچه ای که در ابتدا هیچ ظرفیتی ندارد- چه فکری، چه اجتماعی یا حتی ورزشی- وقتی در محیط تربیتی صحیح قرار بگیرد، می تواند آنها را کسب کند.” ― Jin Li, Cultural Foundations of Learning: East and West"},{"quote":"“خانه آماده ترین بستر برای انتقال فرهنگ، حفاظت از آن و از نو ساختن آن است.” ― Jin Li, Cultural Foundations of Learning: East and West"},{"quote":"“Ми маємо суб’єкта, який присвячує своє життя задоволенню й настільки глибоко застряє в підготовчій діяльності (ранкові пробіжки, масажі, засмагання, застосування кремів і лосьйонів…), що привабливість офіційної Мети його зусиль неодмінно блякне.” ― Славой Жижек, Річ із внутрішнього простору"},{"quote":"“That pine tree wasn't there a moment ago.'Azriel let out a quiet laugh from where he sat atop a boulder two days later, watching me pluck pine needles out of my hair and jacket. 'Judging by its size, I'd say it's been there for... two hundred years, at least.” ― Sarah J. Maas, A Court of Wings and Ruin"},{"quote":"“Don't train to GET a better body, train to BE a better body.” ― Nate Hamon"},{"quote":"“Every great leader is developed, trained, and shaped by the wilderness experience. This is a time of loneliness, insecurity, and trouble in an environment that is not supportive” ― Dr. Lucas D. Shallua"},{"quote":"“If we feed them they will grow, if we train them they will know and if we trust them they will blow our minds.” ― Dr. Lucas D. Shallua"},{"quote":"“Self discipline is one of the most important and useful skills you can have. Discipline is the number one trait needed to create a happy mood, and healthy and meaningful life.” ― Vishal D Baraiya"},{"quote":"“I had no idea punching was so fraught with peril.''Apparently, it takes brains to be a brute.” ― Sarah J. Maas, A ​Court of Silver Flames"},{"quote":"“You were never alone. You couldn’t see them, but help was all around you. We work in the dark a lot, so that’s something you’ll learn—you’ll know where everybody is, even when you can’t see them.” ― Vincent H. O'Neil, The Gathering Elements"},{"quote":"“The understanding that some things are worth your life, some people are worth your life, is something we can't teach.” ― Vincent H. O'Neil, The Gathering Elements"},{"quote":"“Sorrys are stories I do not have time for.” ― Jordan G Kobos"},{"quote":"“There are lots of ways to celebrate achievements. Showing them that you have recognized their efforts will help them feel a sense of accomplishment and pride in what they are doing.” ― Vishal D Baraiya"},{"quote":"“I want to train with him instead.'She could have sworn Cassian went still. Interesting.Azriel coughed into his tea.Cassian drummed his fingers on the table. 'I think you'll find that Az is even less forgiving that I am.''With that pretty face?' she crooned. 'I have a hard time believing that.'Azriel ducked his head, focusing on his food.'You want to train with Az,' Cassian said tightly. 'then go ahead.' He appeared thoughtful for a moment, his eyes lighting before he added, 'Though I doubt that you'll survive a lesson with him, when you can't manage to walk down a hundred stairs without being so sore the next morning that you're unable to get out of your chair.” ― Sarah J. Maas, A ​Court of Silver Flames"},{"quote":"“So, who won the fight?' Cassian asked the next morning as she sat on her rock and watched him go through his exercises.He hadn't asked at breakfast about the black eye and cut chin or how stiffly she'd moved. Neither had Mor upon her arrival. That the bruising and cuts remained at all told Nesta how bad the fall had been, but as High Fae, with her improved healing, they were already on the mend....'What fight?' She examined her mangled nails. Even with the... whatever it was she'd flung out to catch herself, her nails had cracked. She didn't let herself name what had come from within her, didn't let herself acknowledge it. By dawn, it had been strangled into submission.'The one between you and the stairs.'Nesta cut him a glare. 'I don't know what you're talking about.'Cassian began moving once more, drawing his sword and running through a series of movements that all seemed designed to hack a person in two. 'You know: three in the morning, you leave your room to get shit-faced drunk in town, and you're in such a rush to conquer the steps that you fall down a good thirty of them before you can stop yourself.'Had he seen the step? The handprint?She demanded. 'How do you know that?'He shrugged.'Are you watching me?' Before he could answer, she spat. 'You were watching and didn't come to help?'Cassian shrugged again. 'You stopped falling. If you'd kept at it, someone would have eventually come to catch you before you hit the bottom.'She hissed at him.He only grinned and beckoned with a hand. 'Want to join me?''I should push you down those stairs.'...'Well?' he demanded, an edge creeping into his voice. 'If you've got those glorious bruises, you might as well claim it came from training and not a pathetic tumble.” ― Sarah J. Maas, A ​Court of Silver Flames"},{"quote":"“I'll make a bargain with you.'...Cassian maintained a casual stance. 'If you do an hour of exercises right now, I'll owe you a favour.''I don't need any favours from you.''Then name your price.' He struggled to calm his racing heart. 'An hour of training for whatever you want.''That's a fool's bargain for you.' Her eyes narrowed. 'I thought you were a general. Aren't you supposed to be good at negotiating?'His mouth quirked upward. She wasn't fighting him. 'For you, I have no strategies.'She studied him with unflinching focus. 'Anything I want?''Anything.' He added wryly, 'Anything short of you ordering me to fall out of the sky and smash my head on the earth.'She didn't smile the way he'd hoped. Her eyes turned to chips of ice. 'You truly believe me capable of such a thing?'No,' he said without hesitation.Her mouth tightened. Like she didn't believe him....She surveyed him again, and Cassian willed himself to stand still, to appear open and nonthreatening and not like his very heart was in his bloody, outstretched hands.She said at last, 'Fine. Let's just say it will be a favour. Of whatever size I wish.'It was dangerous to allow this. Deadly. Stupid. But he said. 'Yes.'He extended his hand. One last time.Keep reaching out your hand.'A bargain.' He met her steely expression with his own. 'You train with me for an hour, and I'll owe you one favour of whatever size you wish.''Agreed.' She slid her hand into his and shook firmly.” ― Sarah J. Maas, A ​Court of Silver Flames"},{"quote":"“Cassian titled his head to the side at her silence. 'What is it?''Would you train non-Illyrian females?''I'm training you, aren't I?''I mean, would you consider...' She didn't know how to elegantly phrase it, not like silver-tongued Rhysand. 'The priestesses in the library. If I invited them to train with us here, where it's private and safe. Would you train them?'Cassian blinked slowly. 'Yes. I mean, of course, but...' He winced. 'Nesta, many of the females in the library do not want to be- cannot stand to be- around males again.''Then we'll ask one of your female friends to join. Mor or anyone else you can think of.''The priestesses might not even be able to stomach having me present.''You'd never hurt anyone like that.'His eyes softened slightly. 'It's not about that for them. It's about the fear- the trauma they bear. Even if they know I'd never do that to them, I might still drag up memories that are incredibly difficult for them to face.''You said this training would help me with my... problems. Perhaps it could help them. At the very least give them a reason to get outside for a bit.'Cassian watched her for a long moment. Then he said, 'Whoever you can get up here with us, I'll gladly train. Mor's away, but I can ask Feyre-''Not Feyre,' Nesta hated the words. The way his back stiffened. She couldn't look at him as she said, 'I just...' How could she explain the tangle between her and her sister? The self-loathing that threatened to consume her every time she looked at her sister's face?'All right,' Cassian repeated. 'Not Feyre. But I need to give her and Rhys a heads-up. You should probably ask Clotho for permission, too.' A warm hand clasped her shoulder and squeezed. 'I like this idea, Nes.' His hazel eyes shone bright. 'I like it a lot.'And for some reason, the words meant everything.” ― Sarah J. Maas, A ​Court of Silver Flames"},{"quote":"“I'm tired of being weak. Of depending on others to defend me.” ― Sarah J. Maas, A ​Court of Silver Flames"},{"quote":"“Employees who feel supported and appreciated are more likely to go above and beyond for their organization.” ― Dax Bamania"},{"quote":"“I always wondered why my coworkers disliked my resignation. It was because those that were left had to do more work!” ― Steven Magee"},{"quote":"“Train, train, train, Put yourself to the test. Under sun or rain, With no reason nor rest. Without feeling pain You'll always be the best!” ― Ana Claudia Antunes, Flat Feet: An Autobiography of a Cosmic Dancer"},{"quote":"“The Monastic Academy offers a transformative experience. This center prioritizes rigorous training in mindfulness, meditation, and leadership, empowering individuals to become compassionate, beneficial leaders.” ― Monastic Academy"},{"quote":"“Every strike in Muay Thai tells a story of perseverance and determination, creating a work of art that depicts human resilience.” ― Abhysheq Shukla"},{"quote":"“In Muay Thai, the true essence lies not in defeating our opponents but in conquering our own selves and being the best version of ourselves that we can be.” ― Abhysheq Shukla"},{"quote":"“Muay Thai is an art that weaves a tapestry of discipline and honor, a symphony of mind, body, and spirit.” ― Abhysheq Shukla"},{"quote":"“MUAY THAI is a relentless teacher who shows the benefits of pushing boundaries and rising above challenges.” ― Abhysheq Shukla"},{"quote":"“Every breath and movement in Muay Thai is a meditation of strength and grace, activating the warrior within you.” ― Abhysheq Shukla"},{"quote":"“前幾天，我看到日本有新的企業隊，報導中寫道：「選手不可能一天工作或跑步十幾個小時。在日本沒跑步的時候，就讓選手工作吧！J「不對，選手出乎意外地很忙耶！」我和待在這裡的川崎有輝一起提出反對意見 。在高海拔地區第一個問題就是睡眠不足。而且，我們也需要時間做重量訓練和按摩。 其實，沒什麼時間做公司的工作。大家可能會覺得我們都在跑步，但是我希望大家知道並非如比 。” ― 大迫 傑, 決戰前：大迫傑東奧訓練紀事（附大迫傑跑步訓練日誌）"},{"quote":"“I assist individuals who want to achieve their goals and dreams in life. I love the grit, struggle. and passion of individuals.” ― Avijeet Das"},{"quote":"“We can't allow our need for sales to cause us to vomit our business on our people.” ― Kyle Draper, Rethink Everything: You “Know\" About Social Media"},{"quote":"“In medicine, we have long faced a conflict between the imperative to give patients the best possible care and the need to provide novices with experience.” ― Atul Gawande, Complications: A Surgeon's Notes on an Imperfect Science"},{"quote":"“I don't praise or make students feel that they know everything. There is a philosophy behind my training.” ― Avijeet Das"},{"quote":"“Trying is what's getting in the way. Think of the sea. Water isn't capable of flowing and then striking by trying. It should come naturally to you.” ― Lauren Lola, Dasig"},{"quote":"“The line between being demanding and being demeaning is as wide as an ocean.” ― Jennifer Fraser, The Bullied Brain: Heal Your Scars and Restore Your Health"},{"quote":"“No man ever reached to excellence in any one art or profession without having passed through the slow and painful process of study and preparation.” ― Horatius"},{"quote":"“Madoc would be so proud- his little girl, remembering all her training,' she says. 'Starving off the terrifying possibility of romance.” ― Holly Black, The Cruel Prince"},{"quote":"“Rationality is not a power you are born with but one you acquire through training and practice.” ― Robert Greene, The Laws of Human Nature"},{"quote":"“Without the momentum of a stern discipline, motivation is mostly a momentary, flighty emotion. For it works best under the supervision of discipline, but can serve as not only an ally but also an enemy: because in anything that requires your self-discipline - whether going to church, going to classes, going to workouts, going through trainings, completing jobs, reading books, living well, eating healthily, studying, practicing something - the more times you skip, the more relaxed and motivated you'll become about skipping; and the next thing you know you've quit your fight altogether (or, put in short, the more you skip, the more you'll skip until you've quit). Maybe then you'll see that motivation bears its fruits when watered by discipline, but it spoils when not.” ― Criss Jami"},{"quote":"“What is the difference between coaching, consulting, and training?Coaching is personal.Consulting is an expertise shared (generally) with an organization.Training is for the many.” ― Richie Norton"},{"quote":"“You’re focusing too much on what you’re doing, not what your opponent is doing. You’re too much in your own head.”“You keep saying that, but I don’t know what it means.” ― Lucy Gould, The Rescue"},{"quote":"“Capacity building is critical for development of the country.” ― Lailah Gifty Akita"},{"quote":"“J-Meter Training in Chennai | Best J-Meter Course in ChennaiLearn best J-Meter Training in Chennai from BITA Academy. 100% Placement assistance for our J-Meter Course in Chennai.” ― Bita"},{"quote":"“No training was given on what the pulse oximeter meter readings meant at the W. M. Keck Observatory atop Mauna Kea and how it can impact human health in the long term.” ― Steven Magee, Hypoxia, Mental Illness & Chronic Fatigue"},{"quote":"“AN UNSUCCESSFUL PERSON TRAIN OTHERS WHILE A SUCCESSFUL PERSON TRAIN HIMSELF” ― P.S. Jagadeesh Kumar"},{"quote":"“A GENIUS TAKE RISKS AND A STUPID TAKES TRAINING” ― P.S. Jagadeesh Kumar"},{"quote":"“We will never be perfect if we are not trying.” ― De philosopher DJ Kyos"},{"quote":"“We sometimes have to exercise to want to exercise.” ― @Mokokoma Mokhonoana"},{"quote":"“Why did I become Jackie Chan? Mostly because I work very hard. When people were sleeping, I was still training.” ― Jackie Chan"},{"quote":"“The best working method of losing weight before any product or anything is discipline.” ― De philosopher DJ Kyos"},{"quote":"“A small percentage of the weight of sins.” Jake explained. “That’s why they are so heavy.”Sin weighs heavily on a person, apparently.” ― Emily R. McCormick, Holy Bliss"},{"quote":"“What I witnessed at the dangerous DeSoto Solar Farm went against my training as a Chartered Electrical Engineer.” ― Steven Magee"},{"quote":"“In some cases, trying is better than doing because it indicates that you are attempting things hard enough to fail.” ― Criss Jami"},{"quote":"“Wat me het meest aan bestsellers stoorde, was hun eindeloosheid. Hoe konden deze spannende boeken spannend worden genoemd? Honderden pagina’s aan het lijntje worden gehouden over wie het gedaan had, af en toe maar een hapje worden gevoerd op het eind van een hoofdstuk, als was je een hond op training. Ik vond het denigrerend. Zou een boek waarin je niet de dader maar de misdaad moest voorspellen niet veel interessanter zijn?” ― Peter Terrin, De gebeurtenis"},{"quote":"“To be a genius you must be a madman for. Your art ~” ― Patricio Telman Chincocolo"},{"quote":"“Incompetence: The COVID-19 pandemic hit the world in 2019. It takes three years to train a nurse. In 2022 there is a shortage of nurses. Why wasn’t a massive government funded training program initiated to train huge numbers of nurses in 2019?” ― Steven Magee"},{"quote":"“Positive people like you all who spread positive energy achieve success in life. I have trained more than 10,000 students by now in my teaching experience of 12+ years. And I can tell this with conviction.” ― Avijeet Das"},{"quote":"“As a Chartered Electrical Engineer working for one of the largest electrical utility company’s in the USA, I found I was working in an environment that my training told me was completely abnormal and dangerous!” ― Steven Magee"},{"quote":"“In every battle, it is not numbers and untaught bravery so much as skill and training that generally produce the victory. For we see no other explanation of the conquest of the world by the Roman People than their drill-at-arms, camp discipline and military expertise. No one is afraid to do what he is confident of having learned well. A small force which is highly trained in the conflicts of war is more apt to victory; a raw and untrained horde is always exposed to slaughter.” ― Vegetius, The Military Institutions of the Romans"},{"quote":"“Never let your guard down, Wendy. No matter who you are with,” Peter whispered in her ear. He abruptly let go and said, “Go get your dagger and try again.” ― Lucy Gould, The Rescue"},{"quote":"“It is better to have a longer period of preparation and training for a shorter service, than shorter preparation for a longer service.” ― Dr. Lucas D. Shallua"},{"quote":"“Storytelling is an important cognitive skill that helps us to understand concepts and apply logic. This is why I use \"Storytelling\" in my classes. You can make a session interesting by telling stories to your students and assisting them in their imagination and learning.” ― Avijeet Das"},{"quote":"“Our Mission Is to Provide a Professional & Honest Approach to Your Health & Fitness” ― Bingham Health & Fitness"},{"quote":"“We see their lack of education as an advantage. It means no one taught them what to think—or how.” ― Vincent H. O'Neil, The Gathering Elements"},{"quote":"“Whichever direction our [desires] pushes us, we must become more [concious] about continuously pulling in the [opposite] direction. Back to the center.” ― Xilaristw"},{"quote":"“Whichever direction our [desires] pushes us, we must become more [concious] about continuously pulling in the [opposite] direction. Back to Center.” ― Xilaristw"},{"quote":"“When you are old. Everything you do becomes an exercise.” ― De philosopher DJ Kyos"},{"quote":"“No matter your goal or level, I highly recommend finding a compatible training partner and a coach. They will hold you accountable on days when your motivation is low. A coach will help you work through challenges and make adjustments to your training program.” ― Shalane Flanagan, Rise and Run: Recipes, Rituals and Runs to Fuel Your Day"},{"quote":"“Everyone needs to have their own measure of what ‘winning’ means to them.” ― Ken Sayles, Coach, Run, Win"},{"quote":"“We hear all the time about how important it is to be physically fit. Our society has become ultra-focused on fitness and health. Our Facebook feeds are filled with seven-minute workouts. There are YouTube videos galore on seven days to rock-hard abs. The radio plays ads to lose ten pounds in ten days, but only if you call in the next ten minutes.Even the president told us to be physically fit. Remember the Presidential Physical Fitness Test in elementary school? A quick shuttle run, the dreaded flexed arm hang. It tested strength, endurance, flexibility, and agility. All different ways to prove we were physically fit. Or not.As a matter of fact, Americans now spend more on fitness than on college tuition.1 Over a lifetime, the average American spends more than $100,000 on things like gym memberships, supplements, exercise equipment, and personal training.2 Seems shocking, right?But where are the training programs for the thoughts in your head? Those thoughts that tell you that you have no choices when bad things happen. Those thoughts that try to convince you everything is out of your control in difficult situations. Where do you go if you want to be Thoughtfully Fit?Right here in this book.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“The world is a stage waiting for you to take lead or become an audience.” ― Aiyaz Uddin"},{"quote":"“Hindsight is the best science, and I know now that what I picked up and learnt from my mother was the best informal education and trainingI could ever have received” ― Basetsana Kumalo, Bassie: My Journey of Hope"},{"quote":"“By the time they were finished, noses and cheeks red with cold, hands and feet aching, lungs ready to burst, they were both exhausted, but their spirits were somewhat lifted. Even if they should fail, even if they should die, it would not be for lack of effort.” ― Rebecca Crunden, A Promise of Return"},{"quote":"“For most of you, you’ll start building these skills a little at a time. We’re not running a marathon here—we’re just getting off the couch. Getting your brain off the couch. Learning to take a few small steps on your path to being Thoughtfully Fit.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“It’s no coincidence that the Thoughtfully Fit model helps you focus on your choices and control. That’s what coaching does too. From my master’s thesis to my office to the university classroom, this is a training plan grounded in coaching philosophies that work.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“If you practice being Thoughtfully Fit, you’ll be prepared for whatever problems life throws your way. And while life won’t get easier—you’ll still have frustrating neighbors, annoying colleagues, bad news, and unwelcome adversity—it will feel easier because you prepared and trained.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“So, on March 17, 2016, when life handed me the highest and worst “mountain” I’ve ever had to climb, I was ready. While I never could have imagined the horrible events that unfolded would be part of my life story, I later realized I had trained for that moment my whole life. This book is my training plan. And my hard-earned gift to you.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“Discipline is like swiss army knife. It's a must-have to success” ― Janna Cachola"},{"quote":"“Just because you went to a seminar about how to be a more efficient swimmer, your swim stroke won’t improve without practice. Likewise, a bike-riding video can’t improve your balance until you practice. And you certainly can’t wake up tomorrow and do an Ironman Triathlon if you haven’t been training.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“Let's recognize that wolves which are often hungry for chickens, will probably eat the chickens if allowed to carry the keys to the hen's house.For similar reasons the senile and the clumsy should probably not be allowed to walk freely around sensitive equipment. The protector of dangerous means such as nuclear weapons or other powerful decisions which may affect thousands, millions or billions of lives through a simple order or press of a button ought therefor be screened regularly, very thouroughly through a strict protocol regarding mental, physical, social and spiritual health/status. On top of this we are not fully aware of all the currently unknown dangers such as external manipulation of our own biology [as already witnessed in small scale with certain parasitic venoms in insects], the universe is colossal and there is almost certainly a few exotic, unseen and unexpected threats.Likewise, human psychology can in some ways be easy to predict, opportunity to soften otherwise perpetuated tragedies caused by the mismatch between individuals with certain characteristics and certain responsibilities.Let's also recognize that even if each of us were shipped with previously necessary primal flaws [which coincidentaly, may be highlighted as sins] also includes a very real ability to manipulate our biology and circumstances through various forms of voluntary discipline or exposure.Furthermore, while it is more comfortable to rely on our strengths perhaps we should also make an effort to explore our weakneses. Let's not forget that babies are all bundles of confusions, struggling to find their ways [and if someone has lost their love for babies they should be executed on the spot, or somewhere nearby]” ― Monaristw"},{"quote":"“So, we hide, and we fight, and we hide, and we train, and we fight.” ― Jennifer West, The Legend of Acacia Vitak"},{"quote":"“[He] bowed his head, crossing himself, and so ferventlydid he pray that he almost missed the sound of the footsteps crossing the courtyard. But a man who has watched through many a long night waiting for that slight intake of breath that in the assassin makes before he sticks the dagger your back or slices his knife across your throat, can never again give himself over to prayer or sleep or even love-making without his sixth sense remaining ever watchful.” ― Karen Maitland, The Gallows Curse"},{"quote":"“How to juggle training and family, as well how to find a few moments of \"me time\" in your schedule.” ― Kara Goucher"},{"quote":"“Training, doing something for myself, makes me happier and more appreciative of the time I have with my son. Being a runner makes me a better mother, and being a mother makes my running better.” ― Kara Goucher"},{"quote":"“A growing number of elite runners — including Kara Goucher, Doc Patton, and Paula Radcliffe — are proving that it’s possible to balance a tough training schedule with a family. In fact, some say that having a baby has actually helped them achieve better balance.” ― Anonymous"},{"quote":"“The distance, the endurance, isn't whatyou're actually focussed on by the timeyou reach the start line; instead, you'refocussed on your behaviours that'll getyou there. You'll be ready to execute theplan, rather than just hope for the best.” ― Mark Beaumont, Endurance: How to Cycle Further"},{"quote":"“Flexibility, like all the Thoughtfully Fit practices, is something you need to work on to improve. Start simple, such as with the outrageous dresser at the parent-teacher meeting or the glacially slow cashier at the convenience store. Find the places where things are none of your business and affect you the least, and use those as your training ground. You’ll be building your Flexibility muscles, so they’ll be ready in more challenging circumstances.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“If there is something you should know and you don’t know it, because you were not taught. It is not your fault. But, if there is something . You know that you don’t know, and you should know, and you are not doing your best in learning it. Then it is your fault. You are the way you are. You are where you are in life .” ― De philosopher DJ Kyos"},{"quote":"“Traditional training programmes can be a hit or a miss. A miss could arguably be attributed to their generic format of delivery or lack of consideration of the professional needs of an individual or an organisation. Line managers need to scrutinise business needs versus experience, knowledge or skill gaps to invest in relevant capacity enhancement for their human capital for concrete results. Many excellent professionals work outside their fields of study because of :- Learning on the job or through cross functional circuit stints- Mentorship from seasoned professionals- Relevant continuous professional development - Participating in simulated learning environment” ― Victor Manan Nyambala"},{"quote":"“Incompetence is prevalent in the engineering field.” ― Steven Magee, Magee’s Disease"},{"quote":"“Former Olympian distance runner Lynn Jennings shared that her best races were ones in which she wanted to quit halfway through.Why? Because she was out on the edge, pushing herself… The result was championship level performances.” ― Ken Sayles, Coach, Run, Win"},{"quote":"“I love running! I began running as an adult and became addicted, running over 70,000 miles, much of it alongside the athletes I was lucky enough to coach.” ― Ken Sayles, Coach, Run, Win"},{"quote":"“There are many promises in the word of God to get you through the storms of life. Just like any pilot gets trained to fly with their instruments and trust their instruments when they cannot see anything out of the airplane window, likewise we need to trust the promises of God and not rely on our feelings, emotions or instincts when in a storm of doubt, fear, worry or discouragement.” ― Paddick Van Zyl, This Stormy Life"},{"quote":"“Capacity building is necessary for development.” ― Lailah Gifty Akita"},{"quote":"“Take a few minutes out of your schedule every now and then and remind yourself why you can achieve your goals. Make sure that your brain is getting enough training in seeing you and your business as a success and as a winner and not as a failure.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“In addition to building a strong team, you also have to motivate that team when their spirits are down, show your pride in them when they perform well, and be there when they make mistakes. You have to invest in their training and start treating them as partners in your business’ success.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“Employee loyalty is cheaper than hiring new employees, training them, and motivating them.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“Training looks like a financial loss to many but when your employees learn something new and implement the same for your company, they improve efficiency of your business process which gives you a competitive edge.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“Employees learn about the importance of consistency and quality control through their training program.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“A healthy mind will train you in facing your adversity like a champ.” ― Pooja Agnihotri, 17 Reasons Why Businesses Fail :Unscrew Yourself From Business Failure"},{"quote":"“To people schooled in the humanistic tradition, the manipulation of human behavior by some sort of conscious technique seems incorrigibly wicked, in spite of the obvious fact that we all go around trying to manipulate one another's behavior all the time, by whatever means come to hand.” ― Karen Pryor, Don't Shoot the Dog! : The New Art of Teaching and Training"},{"quote":"“Age On Purpose. Be intentional in your journey. You define aging. Don't allow aging to define you. It renders helplessness.” ― Macie P. Smith, A Dementia Caregiver's Guide to Care"},{"quote":"“If my eyes show me what all my training assures me is impossible, I can only conclude that my eyes deceive me.” ― W. Somerset Maugham, The Magician"},{"quote":"“Sales can never be done with 'good' skills or 'good' communication or with 'thorough' product knowledge.. It can only be done with PASSION and You gotta be a People Loving Person, to be Alive in Sales.” ― honeya"},{"quote":"“Welcome breeze\"Exclaim fresh leavesAnd Dry, cry\"No please, no please” ― Ramesh Sood, A Little More Than Ordinary: A bouquet of verse in thougths for Thoughtful Hearts"},{"quote":"“All of them?” ― Walter Tevis, The Queen's Gambit"},{"quote":"“Don't you get bored sometimes?”, she asked.“What else is there?”, Benny replied.” ― Walter Tevis, The Queen's Gambit"},{"quote":"“I promise you, there will be no push-ups. I’m not going to have you run laps. And I definitely won’t have you do any dreaded chin-ups. Your life is the gym and the training ground. Think of it as circuit training for your mind. Allow me to be your coach.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“Automotive Technician Training in Las Vegas at ATIIf you love cars, and want to make a career out of working on them, then you are in luck: Automotive Technicians are in high demand! There are more cars on the road today than ever before, and all of those vehicles require regular maintenance as well as occasional repairs. Experienced, qualified Automotive Technicians have the important responsibility of keeping vehicles in good working condition.” ― Sally Mikhail Bemis"},{"quote":"“Automotive Technician Training in Las Vegas at ATIOur hands on program provides the fundamentals of Automotive Technician in order to prepare you for the demands of today’s Automotive Industry. Our program features Classroom theory on today’s complicated vehicles coupled with lab time where you demonstrate theory with hands-on learning on live vehicles.” ― Sally Mikhail Bemis"},{"quote":"“...you don't have to wait 'til the end to feel good about about all the parts in the middle.” ― Chris Hadfield"},{"quote":"“Practice to personalize.” ― Lailah Gifty Akita"},{"quote":"“what work elegant training company in Dubai” ― elegantelephant"},{"quote":"“Training is necessary for toughness.” ― Lailah Gifty Akita"},{"quote":"“You must train regularly and there are rarely any shortcuts.” ― Rob Steger, Training For Ultra: Ultra Running Stories From the Middle of the Pack"},{"quote":"“No one learns anything by driving blind except what it feels like to crash” ― Paul De Leo"},{"quote":"“Tested,Tried,Trained.” ― Lailah Gifty Akita"},{"quote":"“Our training grounds rarely resemble the place God is taking us to in life. What you need to settle in your heart is this—your experiences today will help you with your future.” ― Olawale Daniel"},{"quote":"“Gifted? I'm skilled. People call others \"gifted\" when they don't want to believe they're worse at something because they're not willing to put in the work excellence requires.” ― Brent Weeks, The Burning White"},{"quote":"“You have before you the beginnings of an amazing opportunity to explore this transformation within yourself, your entire being, physically, mentally and spiritually, monitor its progress and expand on it, and always continue to believe and trust in yourself. Realize that high-intensity interval training will be as hard as you make it, so make sure it counts, in the end it will be extremely rewarding. Use this to your advantage. May you achieve what you desire for yourself and the goals you set, and may the world open up to you the eventualities you seek.” ― Paul W. Matthews, Intense Transformation: Discover How HIIT—the Most Powerful Exercise to Transform Your Mind, Body, & Spirit—Can Activate Your Full Potential"},{"quote":"“Train your mind to adjust in every possible situation you can think of, and then train your mind some more.” ― Sarvesh Jain"},{"quote":"“My mind was learning to work in different ways, becoming stronger. It felt the same way your body feels after a day of splitting wood, or swimming, or sex. You feel exhausted, languorous, and almost godlike. I could feel my mind starting to awaken.” ― Patrick Rothfuss, The Name of the Wind"},{"quote":"“But when we have vaguely said that Education will set this tangle straight, what have we uttered but a truism? Training for life teaches living; but what training for the profitable living together of black men and white?” ― W.E.B. Du Bois, The Souls of Black Folk"},{"quote":"“Just as physical events are easier when you train for them, your life and people problems are easier to manage when you train for them.” ― Darcy Luoma, Thoughtfully Fit: Your Training Plan for Life and Business Success"},{"quote":"“Because of nothing but training, some people can effortlessly do something we cannot do even terribly.” ― Mokokoma Mokhonoana"},{"quote":"“Effective practice of solitude always give birth to freshness, renewal, refocus, rejuvenation, revelation and restoration.” ― Benjamin Suulola"},{"quote":"“Learn a lesson from the branch. Although it has brought fruit for thirty years, the branch is well aware that the years of experience in bearing fruit is not a reason to be independent. The goal of God’s training is never to develop you to stand alone without Him.” ― Kingsley Opuwari Manuel"},{"quote":"“No tea then?’ Sidney Grice asked and the constable huffed.‘I only have two hands.’‘Even without your police training I had observed that,’ Sidney Grice said, ‘but I also note that they are both free now.” ― M. R. C. Kasasian"},{"quote":"“You will be struck, and when you are the force of it must not stagger you, the pain of it must not slow you, the shock of it must not cause you to doubt.” ― Joe Abercrombie, Half the World"},{"quote":"“Speculation cannot replace education.” ― Wayne Gerard Trotman"},{"quote":"“We play at paste,Till qualified for pearl,Then drop the paste,And deem ourself a fool.The shapes, though, were similar,And our new handsLearned gem-tacticsPractising sands.” ― Emily Dickinson"},{"quote":"“If others work for you, give your own time only to those who are willing to learn and grow.” ― John C. Maxwell"},{"quote":"“University training teaches discipline.” ― Lailah Gifty Akita"},{"quote":"“Discipline means get the work done even though you do not want to work.” ― Lailah Gifty Akita"},{"quote":"“You must be quicker to strike and quicker when you do. You must be tougher and cleverer, you must always look to attack, and you must fight without honour, without conscience, without pity.” ― Joe Abercrombie, Half the World"},{"quote":"“Have you considered Medical Assisting, or phlebotomy, but not sure if they are the right fit for you? Maybe it’s time to consider Ultrasound Technology! At NCE, we train motivated students just like you to enter this highly rewarding medical field. Ultrasound Technician Programs is a rewarding career choice. It requires a great deal of commitment as your abilities directly impact patient care.” ― Sal Younis"},{"quote":"“NCE’s program provides hands-on, practical training to give students real-world experience. Graduates will be capable of working in residential and industrial maintenance environments, and will also be able to execute new construction electrical work. Graduates of NCE’s Electrical Technician Program will be prepared to test for the State of California Electrical Trainee (ET) certification.” ― Sal Younis"},{"quote":"“Are you considering a career in HVAC technology? Are you trying to decide where to go to school for your career training needs? If you are looking for a rewarding new career in the trades, consider NCE for your HVAC career training.” ― Sal Younis"},{"quote":"“During Optical/Optometric Assistant program, students will learn the procedures and equipment used in diagnosing and treating eye and vision deficiencies and office procedures related to the vision care field.” ― sal younis"},{"quote":"“I was never aware of any professional astronomy summit worker that had received formal industry recognized training in the safe handling of cryogenic fluids and industrial gasses.” ― Steven Magee"},{"quote":"“Electrician Training at NCEOur basic and adaptable Electrical Trainee Program is intended to assist you with achieving your expert and budgetary objectives in only 30 months contrasted and other longer and all the more expensive projects. Our costs and adaptable timetables will assist you with turning into an Electrical Trainee in almost no time.” ― Sal Younis"},{"quote":"“Always remember, to maintain a rule, you need to break it once a while” ― Cindrella"},{"quote":"“If things didn’t work out last year doing them a certain way, you should hire someone who has done it before to teach you how to do it this year.” ― Richie Norton"},{"quote":"“Having an understanding of the 'why' will help with having an understanding of the 'how'.” ― Bobby Darnell, Time For Dervin - Living Large In Geiggityville"},{"quote":"“The training field lies in overcoming trials.” ― Lailah Gifty Akita"},{"quote":"“Any training is difficult, it takes time to learn the art.” ― Lailah Gifty Akita"},{"quote":"“We can not able to train someone to become successful, they have to train themselves.” ― Allan Bridjith"},{"quote":"“In the land of affliction is where every good soldier of Christ undergoes graceful training.” ― Lailah Gifty Akita"},{"quote":"“Pain is hard training but pure test.” ― Lailah Gifty Akita"},{"quote":"“My training is not from the trained dogs, my training is from an untrained lion, Har Har Har Mahadev” ― P.S. Jagadeesh Kumar"},{"quote":"“Disciplined training is a prerequisite for true artistic spontaneity.” ― Ernest Cadorin"},{"quote":"“All training except the most basic either secures or disestablishes things as they are.” ― John Taylor Gatto, The Underground History of American Education: An Intimate Investigation Into the Prison of Modern Schooling"},{"quote":"“Without experience, education, and training to guide their actions, people are highly unlikely to make good choices in the face of an unknown threat.” ― Christopher Manske, The Prepared Investor: How to Prevent the Next Crisis from Affecting Your Financial Independence"},{"quote":"“Best Spoken English Institutes in Kochi” ― Ajinorah Institutions"},{"quote":"“To become an expert, be ready to ask the dumbest question.” ― Martin Uzochukwu Ugwu"},{"quote":"“he did not seem to have any actual training with a weapon, but there was something frightening about the way he fought. Something wild and uncontrolled seemed to have possessed him.” ― Noor Al-Shanti, Children of the Dead City"},{"quote":"“Form and technique first, reps and weight second.” ― Taco Fleur, Kettlebell Training Fundamentals: Achieve Pain-Free Kettlebell Training and Lay a Strong Solid Foundation to Become PRO"},{"quote":"“When we train, our performance improves as we adapt to stress. Over time, however, if the stresses are too great or we don't incorporate sufficient recovery time, gains begin to diminish. To grow and adapt, we require stress, but equally, we need periods of rest and recovery. This is a delicate balance to strike: if we rest too frequently or for too long, we will become soft and move backward. We need stress to create adaptation.” ― Chris Duffin, The Eagle and the Dragon: A Story of Strength and Reinvention"},{"quote":"“Nothing trains a man better than his own trials.” ― Lailah Gifty Akita"},{"quote":"“Finding the perfect training partner is a challenge. It’s not enough to have someone who matches your speed; you also have to find someone whose company you enjoy over lots of miles. I have plenty of friends perfect for a dinner party or a coffee chat, but if I had to share a 16-mile run through the desert with some of those same people, it’s highly likely only one of us would return to the trailhead.” ― Susan Lacke, Running Outside the Comfort Zone: An Explorer's Guide to the Edges of Running: An Explorer's Guide to the Edges of Running"},{"quote":"“If you do not have prior medical training, then you could be in serious trouble using the USA corporate healthcare system.” ― Steven Magee"},{"quote":"“Education is not the learning of corporate government propaganda, but of training the mind to filter facts from fiction.” ― Steven Magee"},{"quote":"“When sending your children to an Ivy League school, you must remember that some schools prevent Occupational Safety & Health Administration (OSHA) from visiting their training and research facilities.” ― Steven Magee"},{"quote":"“Four fools can produce another four hundred fools, Whats the training involved?” ― Dr.P.S. Jagadeesh Kumar"},{"quote":"“During my career, I never received any training on how to deal with broken mercury lamps and the health hazards of the mercury released.” ― Steven Magee"},{"quote":"“I never received any industry recognized training in astronomy on how to safely clean up smashed mercury filled florescent tubes.” ― Steven Magee"},{"quote":"“During almost a decade of working in high altitude astronomy with liquid cryogenics and industrial gas, I have no recollection of ever being sent on an industry recognized training course in the safe handling and use of them.” ― Steven Magee"},{"quote":"“The silver smokiness of a two-way mirror. Welcome to Sparrow School.” ― Jason Matthews, Red Sparrow"},{"quote":"“... there were no clocks in the mansion, anywhere.” ― Jason Matthews, Red Sparrow"},{"quote":"“Productivity (is) Process Driven” ― Vince L. DeSalvo"},{"quote":"“HVAC Technicians manage air temperature and quality through installation, maintenance, inspection, and repair of the systems that control the climate in our homes, buildings, and vehicles. If you are looking to start a career in the Commercial Refrigeration, Heating and Air Conditioning field, then look no further- NCE has a tremendous training program and facility to train you for success as an HVAC Technician.” ― Sal Younis"},{"quote":"“NCE’s Medical Assistant program trains students to fill a variety of positions in the medical field, including as a Medical Assistant, a Clinical or Administrative Assistant and a Medical Receptionist.” ― Sal Younis"},{"quote":"“That is why I have to-day adopted the view that a dog working in transport service is preferable to the lazy kennel dog, because the latter degenerates, while the former makes himself useful and does not lose his soul.” ― V. Stephanitz, The German Shepherd Dog in Word and Picture"},{"quote":"“I attribute my ability to diagnose and treat my chronic health conditions to the Red Cross and St. John’s Ambulance training that I did in my youth.” ― Steven Magee"},{"quote":"“The murder of Botham Jean appears to be a classic case of USA police training to shoot first and ask questions later.” ― Steven Magee"},{"quote":"“Right Practice Makes Man Perfect” ― StudioGym"},{"quote":"“...I would train myself to make my work so mechanical that I could concentrate much of my energy on listening and watching. My knowledge, I believed, would still the voices of despair inside me.” ― Robert Parker, Capitol Hill in Black and White"},{"quote":"“To train a child in the way he should go, the trainer has to be in front of the same way providing example.” ― Vincent Okay Nwachukwu, Weighty 'n' Worthy African Proverbs - Volume 1"},{"quote":"“One thing I can conclude after being a Corporate Trainer that ‘Public Speaking is like Smooching’If you do not get the other person interested immediately - JUST IMAGINE -'What you are doing???'Imagine! Use your charms & then pounce...” ― Nitya Prakash"},{"quote":"“Protected by plate armor and the pride of chivalry, the noble felt himself invulnerable and invincible and became increasingly contemptuous of the foot soldier. He believed that commoners, being excluded from chivalry, could never be relied upon in war. As grooms, baggage attendants, foragers, and road-builders—the equivalent of engineer corps—they were necessary, but as soldiers in leather jerkins armed with pikes and billhooks, they were considered an encumbrance who in a sharp fight would “melt away like snow in sunshine.” This was not simple snobbism but a reflection of experience in the absence of training. The Middle Ages had no equivalent of the Roman legion. Towns maintained trained bands of municipal police, but they tended to fill up their contingents for national defense with riff-raff good for nothing else. Abbeys had better use for their peasants than to employ their time in military drill. In any epoch the difference between a rabble and an army is training, which was not bestowed on foot soldiers called up by the arrière-ban. Despised as ineffective, they were ineffective because they were despised.” ― Barbara W. Tuchman, A Distant Mirror: The Calamitous 14th Century"},{"quote":"“The holy training is trials of time.” ― Lailah Gifty Akita"},{"quote":"“Training in any field of study span over three years.” ― Lailah Gifty Akita"},{"quote":"“Those who have been trained by life's trials, knows the treasure hidden in this field.” ― Lailah Gifty Akita"},{"quote":"“Police officers assigned to the summit of Mauna Kea should request industry recognized training on very high altitudes prior to working there.” ― Steven Magee"},{"quote":"“Remember, Tané, that a sword does not need to be whetted at all hour to keep it sharp.” ― Samantha Shannon, The Priory of the Orange Tree"},{"quote":"“My daughter isn’t going to grow up as fragile flower, incapable of taking care of herself. She will train as she fights, and she will fight as she trains. She will be raised to be total bad ass. Because everyone loves a bad ass. - Raising A Strong Daughter: What Fathers Should Know by Finlay Gow JD and Kailin Gow MA” ― Kailin Gow"},{"quote":"“Collections do not leave the collector unaffected. The art of collecting results in a certain turn of mind.” ― Douglas Wilson, Wordsmithy: Hot Tips for the Writing Life"},{"quote":"“Practice does not make perfect. Imperfect makes us practice.” ― Mokokoma Mokhonoana"},{"quote":"“A person whom trains alone in isolation for extended hours or otherwise lives in a state of exile from civilization while pursuing his or her private passions can fall victim to the solipsism syndrome, a psychological state where they do not perceive the world as external to their mind. Feelings of loneliness, detachment, and indifference to the outside world characterize this syndrome.” ― Kilroy J. Oldster"},{"quote":"“With deliberate practice, however, the goal is not just to reach your potential but to build it, to make things possible that were not possible before. This requires challenging homeostasis—getting out of your comfort zone—and forcing your brain or your body to adapt.” ― Anders Ericsson, Peak: Secrets from the New Science of Expertise"},{"quote":"“Learning new systems and processes is not mandatory...but neither is staying in business” ― Bobby Darnell, Time For Dervin - Living Large In Geiggityville"},{"quote":"“(…) we were being trained to be heroes the way they train circus horses, and we quickly got used to it.” ― Erich Maria Remarque, All Quiet on the Western Front"},{"quote":"“All we need to do is get those nervous butterflies in our stomachs flying in formation.” ― Cathy Burnham Martin, Encouragement: How to Be and Find the Best"},{"quote":"“We have implied that asceticism, when considered as a whole, can assume various meanings at successive spiritual levels. Simply defined, that is to say as “training” or discipline, an ascesis aims at placing all the energies of the human being under the control of a central principle. In this respect we can, properly speaking, talk of a technique that has, in common with that of modern scientific achievements, the characteristics of objectivity and impersonality. Thus an eye, trained to distinguish the accessory from the essential, can easily recognize a “constant” beyond the multiple variety of ascetic forms adopted by this or that tradition.” ― Julius Evola, The Doctrine of Awakening: The Attainment of Self-Mastery According to the Earliest Buddhist Texts"},{"quote":"“The worst thing was that even if you did your own job, if your teammate failed to do theirs, you could be blown away along with them. And yet, if you focused only on strengthening your own defenses, someone else could get killed. All we could do was trust our teammates, and those who failed were mercilessly culled. We'd been thrown into an extreme situation that was just like the front lines. In the end, we barely slept at all.” ― Carlo Zen, 幼女戦記 (1) Deus lo vult"},{"quote":"“Meditation trains our inner world. It is the art of creating a space between your breath and thoughts, a space that allows you to choose your own response. That allows us to overcome stimuli and reactions, so we can choose who we want to be, moment to moment.” ― Natasha Potter"},{"quote":"“Practice places mind in your muscles.” ― Amit Kalantri, Wealth of Words"},{"quote":"“The activity which seems unthinkable today can become your warm-up in the future!” ― Francis Shenstone, The Explorer's Mindset: Unlock Health Happiness and Success the Fun Way"},{"quote":"“Training and Development is an never ending process” ― Peter Smith, Cooperation in the Multi-Ethnic Classroom: The Impact of Cooperative Group Work on Social Relationships in Middle Schools"},{"quote":"“Every consultant needs to understand that their competitive advantage and brand equity doesn't just come from their training and experience. It is the historical context of where they were born and raised, and major influences in their lives that makes each consultant unique.” ― Cindy Ann Peterson, My Style, My Way: Top Experts Reveal How to Create Yours Today"},{"quote":"“Gift last for few days, guidance last forever.” ― Amit Kalantri, Wealth of Words"},{"quote":"“But ironically, now having seen those qualities made incarnate, Lergen realized that the highest form of the Imperial Army's desires was simply another way to describe a monster. And it filled him with fear.” ― Carlo Zen, 幼女戦記 (1) Deus lo vult"},{"quote":"“In half that time, I’ve spent my life training to kick the ass of people like you.” ― Jason Medina, The Manhattanville Incident: An Undead Novel"},{"quote":"“Be anxious for nothing.” ― Jesus"},{"quote":"“Then on the fifth of October, to cheer the populace, we are given a new calendar. From this day forward, no one is to celebrate the Catholic festivals or use the calendar that dates from Christ’s birth. “We are a nation of thinkers,” Danton declares, “and as such, we shall celebrate the glorious rationalism that has brought us to such liberty.”Not a single journalist in all of Paris dares to point out that our new liberty has imprisoned us within the city. That our dead are buried the same day they die—in mass graves—because there is no longer room and even gravediggers are not allowed outside the city gates. And so we all must pretend to embrace this new calendar. Those who do not use it are branded enemies of the patrie.” ― Michelle Moran, Madame Tussaud: A Novel of the French Revolution"},{"quote":"“Training often fails because people expect way too much of the animal and way too little of themselves.” ― Bob Bailey"},{"quote":"“Nancy Lopez, Multi-Certified Revenue Cycle Manager of BillingParadise shares her views and guidance how health care practice administrators and managers can handle value-based care challenges. She explained how practice administrators must be prepared to help hospitals and medical practices thrive in the current value-based reimbursement climate, while answering a question of a practice manager during BillingParadise’ client conference held at Texas.For More Details, Contact ThroughBillingParadise2009 N. Lynn Taylor,TX 76574, United States.Phone: +1 214-783-6295” ― Practice Manager"},{"quote":"“Did you sleep good?\"\"Well as can be expected without formal training I suppose” ― Neil Leckman"},{"quote":"“I don't ever recall any ears going deaf from too much communication, but I've witnessed many mouths fall silent due to a lack of communication.” ― Kerry Brown, Warrior Leadership: A Transformation of Mind, Body & Spirit for Everyday Life and the Workplace"},{"quote":"“Murphy Fitness Inc offers individualized training programs for people of all fitness levels. We can help you attain your fitness goals no matter your age or current fitness levels. Doug Murphy has over 25 years experience helping both men and women.” ― Murphy Fitness Personal Training Plano"},{"quote":"“The brain is more like a muscle and less like a storage area. If you really want to be a writer, you should want to write a lot. If you want to write a lot, then you need to be in training. You are preparing to run marathons, not emptying a suitcase. Learning new languages, acquiring new vocabulary, keeping yourself in various forms of constant logocentric discipline is one of the best things you can do. And language acquisition is nothing if not logocentric discipline.” ― Douglas Wilson, Wordsmithy: Hot Tips for the Writing Life"},{"quote":"“What you delete from your computer, what you take out of your prose, is as important as what you leave in. It is not a loss. When you take away that unnecessary adjective, the removal adds to the ambience surrounding that noun. When you write a page and delete the whole thing, there is a sense in which it is not deleted. The better writer who remained behind is still there. In this sense the analogy to a musician practicing scales is most apt. The point is not to create so many yards of music. The point is to create a particular kind of musician, one who, when called upon, can do what he is expected to do. Writers who throw their scraps away are leaving a better writer behind, and that was the point, wasn't it?” ― Douglas Wilson, Wordsmithy: Hot Tips for the Writing Life"},{"quote":"“When plotting a course to success, consultants need to understand that their unique value proposition doesn’t just come from their training and professional experience.” ― Cindy Ann Peterson, My Style, My Way: Top Experts Reveal How to Create Yours Today"},{"quote":"“Training is anchored in the past. Education looks to the future.” ― Nido R. Qubein"},{"quote":"“When you fall short of your goals and dreams ask yourself is it your mindset, perspective, expectations, effort, approach, acceptance, company or a blend of these that needs to change.” ― Rasheed Ogunlaru"},{"quote":"“It takes at least five years of rigorous training to be spontaneous.” ― Martha Graham"},{"quote":"“The more you sweat in training, the less you bleed in battle.” ― Gavin Aung Than, Zen Pencils: Cartoon Quotes from Inspirational Folks"},{"quote":"“I can remember only one thing.I want to be bigger. I want to be better. I want - people -, to need me.” ― Gian Andrea, Ripped"},{"quote":"“The essence of one life is empowering another life, and so your passion has to be linked to the liberation of other people’s happiness.” ― Israelmore Ayivor, Leaders' Frontpage: Leadership Insights from 21 Martin Luther King Jr. Thoughts"},{"quote":"“Excellence is an art won by training and habituation: we do not act rightly because we have virtue or excellence, but we rather have these because we have acted rightly; 'these virtues are formed in man by his doing the actions'; we are what we repeatedly do. Excellence, then, is not an act but a habit: 'the good of man is a working of the soul in the way of excellence in a complete life... for as it is not one swallow or one fine day that makes a spring, so it is not one day or a short time that makes a man blessed and happy” ― Will Durant, The Story of Philosophy: The Lives and Opinions of the World's Greatest Philosophers"},{"quote":"“Customer service has everything to do with consistency, systems, training, and the habits you and your team create.” ― Amber Hurdle, The Bombshell Business Woman: How to Become a Bold, Brave Female Entrepreneur"},{"quote":"“Even a low class warrior can surpass an elite, with enough hard work” ― Goku"},{"quote":"“Real education is never acquisition of knowledge but training of character.” ― Lailah Gifty Akita"},{"quote":"“On the path of the budo one does not strive for victory over an opponent. One strive to avoid defeat by one's own self.” ― Akira Toriyama, Dragon Ball, Vol. 1"},{"quote":"“I have found that most people are more willing to accept physical pain and limitation rather than acknowledge and deal with the mental and/or emotional pain that might have caused it.” ― Tobe Hanson"},{"quote":"“[L]ike poems, cruising carves privacy out of public spaces. Poems are a kind of private communication that occurs in public speech. And I think cruising is that too: a training in reading occult codes; a way of seeing a significance in the world that most people don’t see.” ― Garth Greenwell"},{"quote":"“Experience is a necessary education.” ― Lailah Gifty Akita"},{"quote":"“Train your new employee properly. Sounds so obvious, and yet it often doesn’t happen.” ― Amber Hurdle, The Bombshell Business Woman: How to Become a Bold, Brave Female Entrepreneur"},{"quote":"“Don't train to get a better body - train to be a better body.” ― Nate Hamon"},{"quote":"“You have to get all the training necessary and come up with something that can only be compared to the best in the world” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“It is the best way, Sarai. To learn from your mistakes is to make them. Authentically. No amount of training, no rehearsed scenario is going to teach you better than the real thing.” ― J.A. Redmerski, Reviving Izabel"},{"quote":"“Nothing trains like the triumph in trials.” ― Lailah Gifty Akita"},{"quote":"“You can’t make a difference if you are not trained in the principles of God” ― Sunday Adelaja"},{"quote":"“Training is a necessary tool.” ― Lailah Gifty Akita"},{"quote":"“Troubles teaches us what we fail to learn.” ― Lailah Gifty Akita"},{"quote":"“Every dollar you spend on training saves you two dollars on advertising.” ― Jim Sullivan, Fundamentals - 9 Ways to Be Brilliant at the Basics of Business"},{"quote":"“Personal trainers and writers don't end up in history books.” ― Caspar Vega, Southern Dust"},{"quote":"“Java Classes in Pune - CodekulCodekul provides Java Classes in Pune for beginners. We offer completely practical based training on Java technology with the advanced concept with low course fees. Get in touch for FREE demo lecture.” ― codekul"},{"quote":"“The true training is the test that makes a man trust in a Divine Being.” ― Lailah Gifty Akita"},{"quote":"“Without a experience, how can we be truly educated?” ― Lailah Gifty Akita"},{"quote":"“Somewhere along the way, I forgot why I'm doing this.I want to be bigger. I want to be better.I want to need no one” ― gian andrea , Ripped"},{"quote":"“If you are looking for fitness center for women and men in UK do not go ahead than Podfit. We provide personal training and also give special post natal exercise for women. If you want to know more contact us or visit our website.Phone no - 01904631539” ― podfit"},{"quote":"“If you convert your time into training, you will be wise” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“If need be get all the necessary training” ― Sunday Adelaja, No One Is Better Than You"},{"quote":"“Thorn carried in each limb every hour of her training, every day and year bound into the muscle of her arms, written along the length of her legs, beaten into the hardness of stomach and thigh. She knew five dozen ways to kill, she knew them with a lover's intimacy, and in the execution perhaps lust also played its role—for what is lust but a hunger? And hunger must be fed.” ― Mark Lawrence, Red Sister"},{"quote":"“Training is a loop, a two-way communication in which an event at one end of the loop changes events at the other, exactly like a cybernetic feedback system; yet many psychologists treat their work as something they do to a subject, not with the subject.” ― Karen Pryor, Don't Shoot the Dog! : The New Art of Teaching and Training"},{"quote":"“Some people who have been working out regularly for months or even years are still out of shape because the number of cheat days they have in a week exceeds six.” ― Mokokoma Mokhonoana"},{"quote":"“Change is constant.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Good times don’t last and bad times don’t stay forever.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Time well-spent is life well-lived.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“No Student can stand the Gruel of Sports Training unless she has a Passion for Fame.” ― Vineet Raj Kapoor"},{"quote":"“Experience is costly knowledge.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Change is difficult, since it challenges the status quo.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Time management is essential for a work-life balance.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Knowledge is something that fire cannot burn, water cannot wet, air cannot dry, thieves cannot steal, and the more you spend the more it increases.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“The winning strategy is the one that successfully adapts to the changing circumstances of time, place, and person.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Strategy can turn a losing battle into a winning battle.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Strategy is influenced by circumstances.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Change is possible only if the top management agrees.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Entrepreneurs utilize even a negative change positively.” ― Rajen Jani"},{"quote":"“Only time can reveal the future.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“It is not that you give birth to a child that matters most. Rather, it is what you birth into them.” ― Craig D. Lounsbrough"},{"quote":"“What we learn in meditation, we can apply to all other realms of our lives.” ― Sharon Salzberg, Real Love: The Art of Mindful Connection"},{"quote":"“Relationships need to be valued today, for tomorrow is uncertain.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Strategy can win over tricky situations.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Unwise application of knowledge is dangerous.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Reasoning culminates in gaining knowledge.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Knowledge if churned like milk, results in the butter of wisdom.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Those benefiting from the status quo, resist change.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Time should be spent happily without regrets.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Many people do not understand why they cannot do well in their lives, even with a lot of training, using short- term and long term plans and most importantly having a huge potential” ― Sunday Adelaja"},{"quote":"“Optimists see the glass as half full.Pessimists see the glass as half empty.Experiential trainers see the whole glass and its context.” ― Bogdan Vaida"},{"quote":"“If you think training is expensive, try ignorance.” ― Peter Dricler"},{"quote":"“The real training is building character for a good conduct.” ― Lailah Gifty Akita"},{"quote":"“Actions undertaken in anger, only result in pain, sorrow, and regret.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Leaders prioritize what they want.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“How one treats another one, determines success.” ― Rajen Jani"},{"quote":"“Relationships are built on trust.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Compromise makes relationships survive.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Sometimes, changing circumstances also changes relationships.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Angry issues need settling time.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Anger management requires understanding.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Calmness subdues anger.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“The wise communicate in subtle ways.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“A clear mind achieves success.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Over time, repetition brings perfection, which brings success.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Perseverance guarantees success.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“With a common ground, solution of problems is easy.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Mutual respect is an integral part of communication.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Workers can offer guidance for improving the work.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Improvements enable adapting to new situations.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Assessment precedes improvement.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Improvement combines effectiveness with simplicity.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Leaders rule hearts, not people.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Leaders groom leaders.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Some leaders lead from the front.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Intelligent efforts are successful.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“In relationships, the cheater is unable to trust anyone, including the cheated.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Anger creates distances that shouting increases.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“For further communication, previous communication may be archived or discarded.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Even if all communication from everyone is followed, yet one cannot please everyone.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Addressing the interests of the audience, results in effective communication.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Even a child can offer ideas for improvement.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Investor confidence rests on leaders who deliver.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Conflicts are expensive.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Some problems are imaginary and not real.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“If the difficult tasks are completed first, then the remaining tasks seem easy.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“A positive change in approach improves quality.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Conflicts have small beginnings.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Conflicts need to be resolved at the earliest.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Quality is all about taking care of the details.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“The quality of the product is inseparable from the quality of its parts.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Words motivate.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Recognition motivates.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Employees are usually motivated to stay or leave due to their managers.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Make sure a conflict exists before working to resolve it.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Sometimes a problem itself offers its own solution.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Problems kept unresolved invite more problems.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Adverse situations used advantageously can offer solutions to problems.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Growth-oriented performance demands sustained entrepreneurial efforts.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Work works.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Work always makes a difference.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Simple tasks require simple solutions.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Any work not executed honestly, fails to fulfill its objective.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Quality solves the trade-off between margins and sales.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Well-intentioned but ill-informed actions usually compromise quality.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Motivation overcomes self-limitations.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Sensible motivation is always effective.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Regular and concentrated training makes an expert.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Training of parts leads to training of the whole.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Helping others is an effective way of training oneself.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Unfulfilled needs makes training unfulfilled.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“The highest training trains oneness.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Conflicts may create unfathomable distances.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“I honor you for every timethis year you:got back upvibrated highershined your lightand loved and elevatedbeyond—the call of duty.” ― Lalah Delia"},{"quote":"“One of the very striking life lessons from Game of Thrones.When Arya was blind; hopeless and helpless. The Waif lured her into multiple stick fights and the Waif would promptly beat Arya in every sparring match. But through those stick fight, Arya learned to cope with her blindness and how to fight “in the dark.”After Arya had regained her sight and Jaqen had granted the Waif’s wish to kill Arya. Arya confronted the Waif in a hideout and put out the only light in the room. Arya best the Waif due to her proficiency in fighting without sight (which, ironically, was trained by the Waif). Arya killed her adversary.ONE THING ABOUT CHALLENGES IN LIFE IS: THROUGH THEM, WE LEARN HOW TO OVERCOME THEM. Always Pay Attention!” ― Olaotan Fawehinmi, The Soldier Within"},{"quote":"“The only thing worse than training employees and losing them is to not train them and keep them.” ― Zig Ziglar"},{"quote":"“Any investment in sales training is an investment in your own gross profits.” ― Roy H. Williams, The Wizard of Ads"},{"quote":"“For every five sales you make, another nine customers who had hoped to buy from you will leave your store disappointed and empty-handed. This means your existing store traffic can give you 2.8 times your current sales volume, if you sell only those customers who are ready to buy. The only thing more expensive than hiring a sales trainer is not hiring one. Any investment in sales training is an investment in your own gross profits.” ― Roy H. Williams, The Wizard of Ads"},{"quote":"“67% of all shoppers intend to return home with the item they are shopping for, but that only 24% actually do so.” ― Roy H. Williams, The Wizard of Ads"},{"quote":"“The fate of your company is in the hands of your people. Train them well.” ― Roy H. Williams, The Wizard of Ads"},{"quote":"“Being happy has -huge- advantages. One, you smile more. Training of facial muscles. Automatic! But did you know that the risible muscle, the one that gets the biggest benefit, is part of the stomach muscles? Yes. Stomach training. Up and down.” ― René Friedrich, Success, Love, Poetry."},{"quote":"“A satisfied customer brings more customers.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“A team is more than the sum of the individuals.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“The clearer the objective, the better the performance.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“That was the funny thing. What happened to John would pass for his classmates, but for John it was a long challenging road ahead of him. Who knew where he would be sent, maybe a juvenile detention center? He might keep in touch with a few friends if his parents let him, but he would never return to Wakefield High. His peers had no clue the journey ahead of him, that his life was changed forever. And they had no idea what lay ahead for Lilly. No one knew she had been given a task by the Archangels to fight a war against pure evil. They had no idea that Lilly would spend most of her free time not training for a marathon, but training to kill demons. John and Lilly were not all too different.” ― Ellie Elisabeth"},{"quote":"“Training is an active, dynamic process lived out daily in all areas of life- not a rote exercise in memorizing verses and going to church every week.” ― Craig Groeschel, Weird: Because Normal Isn't Working"},{"quote":"“There is an immense difference between training to do something and trying to do something.” ― John Ortberg, The Life You've Always Wanted: Spiritual Disciplines for Ordinary People"},{"quote":"“Have you ever trained a girl to become a semizard?\" \"In all my years here?\" He shook his auburn-tailed head slightly. \"No.\" \"Can't women use magic?\" Smiling faintly that he had caught onto that, the wizard replied, \"They already do.” ― Matia ben Ephraim, The Wizard of Kharathad"},{"quote":"“Don't get salty with me!\"\"Yowch?!\"Whoops... Sorry, put a little too much strength into it there.\"\"...Ohhh...\" Haruhiro came close to fainting in agony. Barbara-sensei had struck him in the crotch.If I keep training here, am I eventually going to end up impotent!? he wondered.” ― Ao Jūmonji, Grimgar of Fantasy and Ash: Volume 2"},{"quote":"“Parishes that have learned to develop a culture of continual invitation to leadership, training, and growth in responsibility for their members are predisposed to ongoing health and growth when pastor transitions occur” ― William E. Simon Jr., Great Catholic Parishes: A Living Mosiac: How Four Essential Practices Make Them Thrive"},{"quote":"“If you're thinking about it, then stop. Because it could be the reason you're having a tough day.” ― Echo Bliss"},{"quote":"“Highlighting strengths increases sales.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Good sales copy creates good sales.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“In sales, every prospect is a potential customer.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“In order to sell, salespersons have to correctly evaluate and cater to customer choices.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Retail selling benefits from aggressive publicity.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“A team succeeds where an individual fails.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Some team members act as adhesives to unite the team.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“The concern of a team member is also the concern of the team.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Mutually helping team members achieve both individual and team objectives.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“A competent manager ensures competent performance.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Needless documentation hampers performance.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Criticizing is easy, performing is difficult.” ― Rajen Jani, Once Upon A Time: 100 Management Stories"},{"quote":"“Most of the time, we see only what we want to see, or what others tell us to see, instead of really investigate to see what is really there. We embrace illusions only because we are presented with the illusion that they are embraced by the majority. When in truth, they only become popular because they are pounded at us by the media with such an intensity and high level of repetition that its mere force disguises lies and truths. And like obedient schoolchildren, we do not question their validity and swallow everything up like medicine. Why? Because since the earliest days of our youth, we have been conditioned to accept that the direction of the herd, and authority anywhere — is always right.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“Champions never sleep, the eternal spirit keep them alert and awake.” ― Amit Ray, Enlightenment Step by Step"},{"quote":"“It is not over. Champions extend their limits and make things happen.” ― Amit Ray"},{"quote":"“The purpose of training is to tighten up the slack, toughen the body, and polish the spirit.” ― Morihei Ueshiba, The Art of Peace"},{"quote":"“To take away a woman's ability to walk is one thing; it's quite another to take away her ability to speak. -(Lady Meesha) I Am Lady Sasha -The Journey From Slave to Slave-” ― Julienne Russell"},{"quote":"“Unleash the potential that is in another and you unleash the potential that is in you.” ― Matshona Dhliwayo"},{"quote":"“Practice brings better results than prayer.” ― Amit Kalantri"},{"quote":"“Where the hell is your guard?\" She shouts. Damn if she doesn't sound like Haley. \"I'm tired.\"\"Do I look like I care? You're getting the hell pounded out of you. If you want to tap out, then tap out, but don't stand there and let him win.” ― Katie McGarry, Take Me On"},{"quote":"“Leaders don’t hide good news from their followers. As long as they discover knowledge, they share knowledge. They leave part of them with people they meet; hence they are hardly missed when they are gone.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“when you become addict in to MATERIAL things in life then the TRUE natural life start to run away from you, YES! it's can give you certain pleasure in the society but in the same time it will sabotage your true HAPPINESS of life which we could have simply with GRATITUDE and FORGIVENESS” ― Rashedur Ryan Rahman"},{"quote":"“Zombie nerds. They probably had the flyers already made up for this. There was nobody creepier than the zombie nerds, college guys who not only watched zombie movies and read zombie novels and played zombie video games, but actually formed clubs and collected zombie-killing weapons. Gun shops around there actually stocked zombie targets, and special zombie bullets with glow-in-the-dark tips. Not toy bullets, mind you. These guys would go out in the woods and train and shoot and defend to the death their right to stay in childhood until age thirty-five.” ― David Wong, This Book Is Full of Spiders"},{"quote":"“The Creator favors the man who loves over the man who hates. If you teach hatred to your children, one day your child will have that hatred reflected back onto them, or onto you.” ― Suzy Kassem, Rise Up and Salute the Sun: The Writings of Suzy Kassem"},{"quote":"“The earth is round for a reason. Your minimum effort starts you at the top of the world; your maximum effort keeps you there.” ― Johnnie Dent Jr."},{"quote":"“In these story telling moments we equip our children, with crucial solution tools for life. To deprive them of these necessary teachable moments is like denying a carpenter the tools of his trade.” ― Drexel Deal, The Fight of My Life is Wrapped Up in My Father"},{"quote":"“Leaders are raised through training and experience. Nobody was born naturally with hand-gloves of leadership. We come to life to search for it, discover it and optimize it.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“You can live in the body you wish; exercise daily.” ― Lailah Gifty Akita"},{"quote":"“Cooper grinned. “You should listen to me, man. After all, I’ve got a way with the ladies.” When Judd said nothing, I realized he wasn’t even looking at Cooper. Everyone followed his gaze until we realized he was glaring at Mac. Tucker laughed for the simple reason that he was hammered. Maddy rubbed his face and they started making out. Bailey rolled her eyes. “What did Mac do? Should I kick his ass?” Cooper patted his sister. “You could so take him too, midget.” Nuzzling Judd, I ignored Cooper tugging my shirt as if to separate me from my man. “I never liked him even a little bit.” “You touched his arm.” Bailey stepped closer and slapped Cooper’s hand off me. “Judd, the only way to make things right is to cut off Mac’s arm and feed it to our dogs.” “Sounds about right,” Judd muttered, still glaring at Mac who moved around the large packed family room as if trying to dodge the eyes on him. “Bailey,” I whispered, giving her the look. “What I meant was that Tawny is all kinds of loyal and shit, so cutting off Mac’s arm, while fun, isn’t necessary. Trust your woman.” “I do trust her,” Judd muttered. “I still want to stab Mac’s face.” “Yeah, that takes me back,” Cooper said, grinning at Farah who frowned. Rolling his eyes, he sighed. “Trust your woman. You know, what the dipshit said.” “Don’t call her a dipshit,” I told Cooper who glared down at me. “I’m not having a staring contest with you.” “Cause you’d lose.” “Farah,” I said and she wrapped her arms around Cooper who sighed. Seeing a way to fix my other problem, I hugged Judd to me. As he looked down and grinned, I murmured, “Pay attention to me.” Exhaling hard, Judd caressed my face. “Sorry, but that guy had your fingers on him. I feel like I should make an example of him, but I won’t. That wouldn’t be respectable.” Bailey leaned in and whispered, “Are you training him too?” “I’m training everyone,” I whispered back.” ― Bijou Hunter, Damaged and the Knight"},{"quote":"“The hardest thing about training is the battle that goes on in the mind. A battle of doubt, a battle of confidence, a battle of fatigue. Just remember one thing, you control your mind, it doesn't control you.” ― James Waapu"},{"quote":"“Soldiers are not trained for retire” ― Bimo Satriyo"},{"quote":"“The first thing that has to be recognized is that one cannot train someone to be passionate--it's either in their DNA or it's not.” ― Richard Branson"},{"quote":"“Ballet shoes... I cannot play with them like they're toys. But when the music is playing they get deep on my toes.” ― Ana Claudia Antunes, The DAO (Dancing As One) Workbook Illustrated"},{"quote":"“It is our responsibility to discover our talents, to accept them as from God, to develop them through education and training, and to use them for His glory.” ― J. Grant Howard, Balancing Life's Demands: A New Perspective on Priorities"},{"quote":"“You don’t miss great leaders because their impacts and footprints are always staring at you in the face.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“A task which seems difficult, can be done with adequate training.” ― Lailah Gifty Akita"},{"quote":"“We are people; human fucking beings, alive and kicking and wonderful in our weirdness. We are not spoons. And we should not act like we are”.” ― Rasmus Hammarberg, Break the Bar"},{"quote":"“Unwilling to give-up & willing to fail. That's how you succeed.” ― Sachin Kumar Puli"},{"quote":"“When I was instructed to use medical oxygen to do my job at the W. M. Keck Observatory from 2001 to 2006, I was never told about the legal health information that is now posted on oxygen cylinders. My memories of the green medical oxygen cylinders that we would use daily is that they had no information on them and we were never given a recognised legal oxygen administration training course for routine daily use or a medical prescription from a doctor. We were shown the three oxygen cylinders at the facility and told to use them whenever we developed headaches, which was multiple times daily. It was common to find all three oxygen cylinders in use by other very high altitude workers and to have to line up to get a turn on the magical medical gas.” ― Steven Magee"},{"quote":"“Education and Training For Life” ― David Dweck"},{"quote":"“If there is one thing in this world that I was raised and trained to know, it is that there is only so much you may ask of the gods. Victory in battle is their lightest gift; a quiet heart is your own concern.” ― Peter S. Beagle, The Innkeeper's Song"},{"quote":"“We are not practicing Jiu Jitsu to learn how to fight, we are learning how to live.” ― Chris Matakas, The Tao of Jiu Jitsu"},{"quote":"“Your VISION and your self-willingness is the MOST powerful elements to conquer your goal” ― Rashedur Ryan Rahman"},{"quote":"“Your traditional EDUCATION is not going to CHANGE your life but the life you are experiencing that can change you. Choose a POSITIVE life STYLE with positive ATTITUDE which could bring you a life with HAPPINESS and WISDOM” ― Rashedur Ryan Rahman"},{"quote":"“Autumn is a momentum of the natures golden beauty…, so the same it’s time to find your momentum of life” ― Rashedur Ryan Rahman"},{"quote":"“Martial Arts does not teach you how to fight, it teaches you why not to.” ― Lakshya Bharadwaj"},{"quote":"“Your every positive action in your life will increase your self-esteem and this self-esteem will boost you for more positive action to take you on success” ― Rashedur Ryan Rahman"},{"quote":"“How you think and create your inner world that you gonna become in your outer world. Your inner believe manifest you in the outside” ― Rashedur Ryan Rahman"},{"quote":"“If you are not EXCITED enough at your present life its mean your future is not EXITING. Excitement will give you ENTHUSIASM and enthusiasm will give you a positive energetic LIFE STYLE which could give you a successful exiting life…” ― Rashedur Ryan Rahman"},{"quote":"“Affirmations are positive statements and they need to be spoken with absolute, unadulterated faith. If you only speak with your mouth, without an iota of feeling in your heart and belief in your mind, then you’re going the wrong way! You need to feel the vibrancy, the truth, and the positivity of these statements. You need to write them on your mind-slate, create an indelible influence, and engrave them in your consciousness. You can only do that by following the Three Golden Rules of Affirmations – Repetition, Belief, and Positive Expectation. Remember, by making affirmations, you are consciously programming your mind to think in a certain way, so that hopeful and happy thinking becomes a part of your being. Affirmations are a way to train the mind; and training happens when you practice, practice, practice! Training requires conscious effort, discipline, belief, and consistency. That is exactly how you need to practice your affirmations.” ― Manprit Kaur, The Little Book of Big Affirmations"},{"quote":"“Every individual must be given the opportunity to unearth his/her highest potential.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“It takes persistent practice to be skilful in the act.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Karate is five percent sweat; the rest is all commitment” ― Soke behzad Ahmadi"},{"quote":"“They'll come a time - in fact many times - when all the tools & techniques will fail you or desert you. Then - at last - is the moment to trust, use & follow your heart” ― Rasheed Ogunlaru"},{"quote":"“Give yourself a great self-respect to know who you are then your confidence will shine on you” ― Rashedur Ryan Rahman"},{"quote":"“CONFIDENCE is not showing off your VANITY, it’s about to be HUMBLED and KIND to others what are you truly SKILLED and PROFESSIONAL about…” ― Rashedur Ryan Rahman"},{"quote":"“~Have NO fear of moving into the unknown. Simply step out fearlessly knowing that I am with YOU, therefore NO harm can befall YOU; all is very, very well. Do this in complete faith and confidence~” ― Pope John Paul II"},{"quote":"“What is difficult in training will become easy in a battle” ― Alexander Suvorov"},{"quote":"“REJECTION is kind of your negative ILLUSION which has no value but it’s give you a CLUE to go for next level of your ACTION.” ― Rashedur Ryan Rahman"},{"quote":"“The pursuit of knowledge and the skills that come with it must be done strategically. We must put the society we live in into serious consideration before we embark on this journey.We can't isolate our skills from the need of the society we live in” ― Emi Iyalla"},{"quote":"“A leader in 10 minutes can unlock your potentials which in reality would have taken you 10 years to do without them.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“Tell me, who in this life, were never guided in course of their realization of their goal?” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Your productivity will double with increase physical activity.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Setting a goal is like to set your destination point in your life GPS which could take you to your desire position as you dreamed about...” ― Rashedur Ryan Rahman"},{"quote":"“Being a good leader does not require you possessing a fancy title, no more than possessing a fancy title makes you a good leader.” ― Mark W Boyer"},{"quote":"“Leaders don’t leave people empty handed. They give them part of themselves through knowledge sharing and influence creation.” ― Israelmore Ayivor, Leaders' Ladder"},{"quote":"“You will boost your productivity with active exercise.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“If you find that you are short of funds in the field, remember that any paper can be mind augmented to perform in the place of real money.” ― Matt Kindt, MIND MGMT, Volume One: The Manager"},{"quote":"“Proverbs 22:6 (KJV) Train up a child in the way he should go: and when he is old, he will not depart from it...and pray for the Holy Ghost for them.You have 12 whole years to do all that. After that let them alone and trust God and believe in the prayers.Stop being their Holy Ghost! Be a parent and a friend. If you can't love them as your children love them as sinners to win to Christ. Don't run them out of the presence of God with that attitude” ― Mary Tornyenyor"},{"quote":"“With careful guidance and mentorship, you will reach your highest-self.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“It takes 5 to 7 years to turn a novice into a case officer capable of working in the capitals of the world.” ― Tim Weiner, Legacy of Ashes: The History of the CIA"},{"quote":"“If rhetoric study was the military, grammar teachers would be the drill sergeants.” ― T.K. Naliaka, Iron Mixed with Sand Salt without Memory"},{"quote":"“Like a speeding trainI am passing by...I don’t knowwhere I’m headingwith whom or whyall I know is thatI will never, everpass from here againall I know is I’m skidding forwardon this track of life.” ― Sanober Khan, A touch, a tear, a tempest"},{"quote":"“Some are born strong and others are made strong.” ― J.R. Rim, Better to be able to love than to be loveable"},{"quote":"“Yes, it hurts to fall— ache, tenderness—but each scar is a sign your system is working.” ― Kelli Russell Agodon, Hourglass Museum"},{"quote":"“Discipline is a bridge built through everyday action.” ― J.R. Rim"},{"quote":"“The best-trained part of us, though, is the mouth, it �is always obediently and devoutly shut. And it's only too true: an open mouth is a yawning fact, the fact that its owner is dwelling with his few thoughts in some other place than the domain and pleasure-garden of attentiveness.” ― Robert Walser, Jakob von Gunten"},{"quote":"“The assassin nodded. His eyes glinted in amusement, holding her gaze for a moment too long. And perhaps she saw his expression soften...but she didn't want to read too much into it. She gave him a little wave and turned to leave, her heart pounding strangely in her chest. She remembered the brush of his strong calloused hands, his long nimble fingers, and his arms trapping her against the railing, She thought of his full attention upon her, observing each small movement, every flaw and breath. Tomorrow they would train again. Her stomach tightened at the thought. She hoped he didn't notice her response to his touch-but deep down inside, she knew he saw everything.” ― T.L. Shreffler, Ferran's Map"},{"quote":"“Age is only a number. Keep an active life.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Flowers and jewelry worked for most girls as a romantic gesture, but here I was, misty-eyed at watching him show my mother how to stab the shit out of him.” ― Jeaniene Frost, Magic Graves"},{"quote":"“Happily, we do the work.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“You can only know how confident you are when you kick-start. True confidence is not found in excessive rehearsals; it comes from experience. Plan, prepare, but will willing to make it happen!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“As a parent, you have authority because God calls you to be an authority in your child's life. You have the authority to act on behalf of God. As a father or mother, you do not exercise rule over your jurisdiction, but over God's. You act at his command. You discharge a duty that he has given. You may not try to shape the lives of your children as pleases you, but as pleases him. All you do in your task as parents must be done from this point of view. You must undertake all your instruction, your care and nurture, your correction and discipline, because God has called you to. ... If you are God's agent in this task of providing essential training and instruction of the Lord, then you, too, are a person under authority. You and your child are in the same boat. You are both under God's authority. You have different roles, but the same Master.” ― Tedd Tripp"},{"quote":"“Daily mediation is a healthy spiritual exercise.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Even when he played, he made a business of it.” ― H.W. Brands, The Man Who Saved the Union: Ulysses Grant in War and Peace"},{"quote":"“You are destiny to be;Rebuilder of great home.Restorer of mighty nation.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Jiu Jitsu is meant to serve us, not the other way around. It is meant to make you more of whatever it is you already are. It is meant to separate the wheat from the chaff. It is meant to bring to conscious attention all that once went unseen. It is meant to make you more loving. It is meant to make you more wise, but less certain. It is meant to make us humble, yet supremely confident. It is meant to remind us of our frailty while simultaneously making us feel invincible.” ― Chris Matakas, My Mastery: Continued Education Through Jiu Jitsu"},{"quote":"“In the long run most short cuts are flawed - especially on journeys to 'so-called' success” ― Rasheed Ogunlaru"},{"quote":"“Good training is priceless.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“Great mission lies ahead of us.” ― Lailah Gifty Akita, Pearls of Wisdom: Great mind"},{"quote":"“With great inspiration, every man can reach their highest potential.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Feel better, work better.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“(Prisoners) need an education. They need a GED to start with. Then they need some kind of training so when they get out they have a marketable skill. That way they can support themselves and they can support their families.” ― Christopher Zoukis, College for Convicts: The Case for Higher Education in American Prisons"},{"quote":"“I’m going to be a warrior,” Jaybird said to Mouse.She flew beside him as he walked through tall grasses and rolling hills.Mouse cocked his head. “Oh? How’s that?”“I’ll find a teacher,” said Jay. “I’ll train and train and become the best, then I’ll lead all the other warriors!” ― B.T. Lowry, Fire from the Overworld"},{"quote":"“We were motivated by our mentors to go an extra mile.” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“If you don’t believe your whole life has been a path leading to this one point, you’re not focused enough.” Master Sergeant Gabriel Luther Wells.” ― Mark Henwick, Cool Hand"},{"quote":"“Autopilot is great, and removal of thought is one of the highest ideals of training. But removal of thought in the moment must be preceded by purposeful thought beforehand.” ― Chris Matakas, My Mastery: Continued Education Through Jiu Jitsu"},{"quote":"“Have a clear-cut plan on what you wish to improve, and seek opportunities to improve it. The more conscious and honest we can be about our shortcomings, the more strength we will have to improve them. We are going to train hard anyway, we are not going to sweat any more or less. It is simply imperative that the sweat is properly directed.” ― Chris Matakas, My Mastery: Continued Education Through Jiu Jitsu"},{"quote":"“We must remember that science is a way of using empirical evidence to better understand our world. We are all scientists, just many of us are not very good ones. However, we are all capable of exercising our intellects in a purposeful, linear pursuit of knowledge.” ― Chris Matakas"},{"quote":"“We call it training. Not because we are training for Jiu Jitsu. We are training for life.” ― Chris Matakas, My Mastery: Continued Education Through Jiu Jitsu"},{"quote":"“Mentoring is passion for skills and knowledge-transfer to young people” ― Lailah Gifty Akita, Think Great: Be Great!"},{"quote":"“Training was a rite of purification; from it came speed, strength. Racing was a rite of death; from it came knowledge” ― John L. Parker Jr."},{"quote":"“Humans are built to move. We evolved under conditions that required daily intense physical activity, and even among individuals with lower physical potential, that hard-earned genotype is still ours today. The modern sedentary lifestyle leads to the inactivation of the genes related to physical performance, attributes that were once critical for survival and which are still critical for the correct, healthy expression of the genotype. The genes are still there, they just aren't doing anything because the body is not stressed enough to cause a physiological adaptation requiring their activation. The sedentary person's heart, lungs, muscles, bones, nerves and brain all operate far below the level at which they evolved to function, and at which they still function best.” ― Mark Rippetoe, Practical Programming for Strength Training"},{"quote":"“There are three reasons I failed. Not enough training. Not enough training. And not enough training.” ― Haruki Murakami, What I Talk About When I Talk About Running"},{"quote":"“When u practice something with conscious mind n then continue practicing the same even with sub-conscious mind, You Master it..” ― honeya"},{"quote":"“Nothing great was ever achieved without a personal sacrifice. You have to pay the price to realize your goals.” ― Lailah Gifty Akita"},{"quote":"“All the training was necessary for my personal development.” ― Lailah Gifty Akita"},{"quote":"“You have to love what you do, to give your best.” ― Lailah Gifty Akita"},{"quote":"“God is the best makeup Artist I have ever seen however, you may get an honorable mention for sprucing.” ― Johnnie Dent Jr."},{"quote":"“One who is hungry for growth, doesn't requires motivation and training.. He just needs an opportunity...” ― honeya"},{"quote":"“An open mind and helpful hands can do much to change a dog's future.” ― Mary Debono"},{"quote":"“You need alot of patient to keep working.It takes time for the goals to be realized.” ― Lailah Gifty Akita, The Alphabets of Success: Passion Driven Life"},{"quote":"“Live through it or grow from it.” ― Johnnie Dent Jr."},{"quote":"“If you don't fall down now and again, it just means the training wheels are working” ― Josh Stern, And That’s Why I’m Single"},{"quote":"“A man of God has many brothers. He is a wounded soldier - he is familiar with the pain one feels in his heart, as a close and loving brother, when a brother falls victim of evil men or turns to evil desires (the latter sometimes even betrayal). Because of this, too, he is and must be well-acquainted with and trained in the strengths of hope and the gentleness of forgiveness and mercy.” ― Criss Jami, Killosophy"},{"quote":"“The more you practice the better you'll be, the harder you train the great in you they'll see.” ― Alcurtis Turner"},{"quote":"“Parents don't become inaccessible to your Children, when they don't get the right information from you, they may get the wrong one from an outsider; you are their Caretaker..be wise!” ― Jaachynma N.E. Agu, The Best Option"},{"quote":"“You can never learn Sales by reading books and watching videos, you can only get motivated by that.. To learn Sales (telesales) dial 300+ calls daily and (direct field sales) meet at-least 5 clients daily...Only customers can teach u sales!” ― honeya"},{"quote":"“There is something about sales that is universal;Out of ten at' least one says YES... try it anywhere... will work!” ― honeya"},{"quote":"“It's not about the games it's about practice and when you practice, go hard!!” ― Alcurtis Turner"},{"quote":"“A brain is like a muscle, a serial connection that you should train everyday; if you don't use it, you loose it” ― Ana Claudia Antunes, One Hundred One World Accounts in One Hundred One Word Count"},{"quote":"“Teams that spend a lot of time learning the tricks of the trade will probably never really learn the trade.” ― Yuri Boganov"},{"quote":"“The cost of a range of appropriate courses and training activities is much less than the cost of incompetence.” ― Robin Hoyle, Complete Training: From Recruitment to Retirement"},{"quote":"“There is a distressing tendency of the L&D profession to latch on to half read and barely understood concepts.” ― Robin Hoyle, Complete Training: From Recruitment to Retirement"},{"quote":"“If you don’t use your new knowledge and skills within a relatively short space of time, then it may have been better never to have had the tantalising prospect of change for the better placed in front of you.” ― Robin Hoyle, Complete Training: From Recruitment to Retirement"},{"quote":"“The most important skill for a new recruit from university will be the ability to learn.” ― Robin Hoyle, Complete Training: From Recruitment to Retirement"},{"quote":"“The only safe guide is the Bible. It is the revelation of a God who has infinite knowledge and can therefore give you absolute truth. God has given you a revelation that is robust and complete. It presents an accurate and comprehensive picture of children, parents, family life, values, training, nurture, and discipline - all you need to be equipped for the task of parenting.” ― Tedd Tripp"},{"quote":"“What you don't know can make you fail! Perhaps the only reason why you are where you are is that, you've not known what you have to know... Go, learn and take the lead!” ― Israelmore Ayivor, Daily Drive 365"},{"quote":"“There's NO in Training and Competition NO Fear, NO Limit, NO Mercy” ― arry gautama"},{"quote":"“Sales can never be done with 'good' skills or 'good' communication or 'thorough' product knowledge.. It can only be done with PASSION and U gotta be a people loving person, to be alive in sales...” ― honeya"},{"quote":"“Sell (service or product) as if you are buying it, convince yourself first that, it is worth buying..It is very simple; u 'cannot' convince someone till the time you're not convinced” ― honeya"},{"quote":"“There’s a fine line between child-like – learning as a child does, the natural way we learn most stuff – and being child-ish.” ― Robin Hoyle, Complete Training: From Recruitment to Retirement"},{"quote":"“Training- training is everything; training is all there is to a person. We speak of nature; it is folly; there is no such thing as nature; what we call by that misleading name is merely heredity and training. We have no thoughts of our own, no opinions of our own; they are transmitted to us, trained into us.” ― Mark Twain, A Connecticut Yankee in King Arthur's Court"},{"quote":"“Physics is becoming so unbelievably complex that it is taking longer and longer to train a physicist. It is taking so long, in fact, to train a physicist to the place where he understands the nature of physical problems that he is already too old to solve them.” ― Eugene Paul Wigner"},{"quote":"“Some strive to make themselves great. Others help others see and find their own greatness. It's the latter who really enrich the world we live in” ― Rasheed Ogunlaru"},{"quote":"“Give up your attachment to comfortable ways of living - show yourself in the gymnasium (gymnos = 'naked'), prove that you are not indifferent to the difference between perfect and imperfect, demonstrate to us that achievement - excellence, arete, virtu - has not remained a foreign word to you, admit that you have motives for new endeavours! Above all: only grant the suspicion that sport is a pastime for the most stupid as much space as it deserves, do not misuse it as a pretext to drift further in your customary state of self-neglect, distrust the philistine in yourself who thinks you are just fine as you are! Hear the voice from the stone, do not resist the call to get in shape! Seize the chance to train with a god!” ― Peter Sloterdijk, Du mußt dein Leben ändern"},{"quote":"“Ow!\" she cried out. She would have a fresh bruise there by the time she went to sleep, somewhere out at sea. A bruise is a lesson, she told herself, and each lesson makes us better. Syrio stepped back. \"You are dead now.\" Arya made a face. \"You cheated,\" she said hotly. \"You said left and you went right.\" \"Just so. And now you are a dead girl.\" \"But you lied!\" \"My words lied. My eyes and my arm shouted out the truth, but you were not seeing.\" \"I was so,\" Arya said. \"I watched you every second!\" \"Watching is not seeing, dead girl. The water dancer sees. Come, put down the sword, it is time for listening now.” ― George R.R. Martin, A Game of Thrones"},{"quote":"“In truth, the crossing from nature to culture and vice versa has always stood wide open. It leads across an easily accessible bridge: the practising life. People have committed themselves to its construction since they came into existence - or rather, people only came into existence by applying themselves to the building of said bridge. The human being is the pontifical creature that, from its earliest evolutionary stages, has created tradition-compatible connections between the bridgeheads in the bodily realm and those in cultural programes. From the start, nature and culture are linked by a broad middle ground of embodied practices - containing languages, rituals and technical skills, in so far as these factors constitute the universal forms of automatized artificialities. This intermediate zone forms a morphologically rich, variable and stable region that can, for the time being, be referred to sufficiently clearly with such conventional categories as education, etiquette, custom, habit formation, training and exercise - without needing to wait for the purveyors of the 'human sciences', who, with all their bluster about culture, create the confusion for whose resolution they subsequently offer their services.” ― Peter Sloterdijk, Du mußt dein Leben ändern"},{"quote":"“Good parents use the mistakes they did in the past when they were young to advice the children God gave to them to prevent them from repeating those mistakes again. However, bad parents always want to be seen as right and appear \"angelic and saintly\" as if they never had horrible youth days.” ― Israelmore Ayivor"},{"quote":"“Train hard while others don't, so you can win while your opponents wont.” ― Andre Bramble"},{"quote":"“Preparation eradicates cowardice, which we define as the failure to act in the midst of fear…” ― Four from Divergent"},{"quote":"“When Rin Tin Tin first became famous, most dogs in the world would not sit down when asked. Dogs performed duties: they herded sheep, they barked at strangers, they did what dogs do naturally, and people learned to interpret and make use of how they behaved. The idea of a dog's being obedient for the sake of good manners was unheard of. When dogs lived outside, as they usually did on farms and ranches, the etiquette required of them was minimal. But by the 1930s, Americans were leaving farms and moving into urban and suburban areas, bringing dogs along as pets and sharing living quarters with them. At the time, the principles of behavior were still mostly a mystery -- Ivan Pavlov's explication of conditional reflexes, on which much training is based, wasn't even published in an English translation until 1927. If dogs needed to be taught how to behave, people had to be trained to train their dogs. The idea that an ordinary person -- not a dog professional -- could train his own pet was a new idea, which is partly why Rin Tin Tin's performances in movies and onstage were looked upon as extraordinary.” ― Susan Orlean, Rin Tin Tin: The Life and the Legend"},{"quote":"“Goals that are not frightening are not worth having.” ― Dr. Stan Beecham"},{"quote":"“The truth hurts, only when it can heal.” ― Rob Liano"},{"quote":"“If you are not willing to give a less experienced qualified professional a chance, don't complain you are charged double for a job worth half.” ― Mark W Boyer"},{"quote":"“Also, asceticism is all right when it is the proper means of attaining some special end. It is when it produces eructations of spiritual pride, and satisfied vanity, that it is poisonous. The Greek word means an athlete; and the training of an athlete is not mortification of the body. Nor is there any rule which covers all circumstances. When men go \"stale\" a few days before the race, they are \"taken off training,\" and fed with champagne. But that is part of the training. Observe, too, that all men go \"stale\" sooner or later; training is abnormal, and must be stopped as soon as its object is attained. Even so, it too often strains vital organs, especially the heart and lungs, so that few rowing \"Blues\" live to be 50. But worst of all is the effect on the temper!When it is permanent, and mistaken for a \"Virtue,\" it poisons the very soil of the soul. The vilest weeds spring up; cruelty, narrowmindedness, arrogance—everything mean and horrible flowers in those who \"Mortify the flesh.\" Incidentally, such ideas spawn the \"Black Brother.\" The complete lack of humour, the egomaniac conceit, self-satisfaction, absence of all sympathy for others, the craving to pass their miseries on to more sensible people by persecuting them: these traits are symptomatic.” ― Aleister Crowley, Magick Without Tears"},{"quote":"“In a nutshell: Stress is stress - no matter whether it's from exercise or from lifestyle - and the more stress you're placing on yourself from your lifestyle, the less stress you'll be able to place on yourself from exercise.” ― Ben Greenfield, Beyond Training: Mastering Endurance, Health & Life"},{"quote":"“Beating children will not make them wise. They will grow wilder and wilder and the cane will feel like paper on their skins.” ― Michael Bassey Johnson"},{"quote":"“Whether it be training, dieting, working out, or work ethic, for every great excuse \"Not\" to do something, there are 100 \"better\" reasons for you to do it.” ― Mark W. Boyer"},{"quote":"“Every day is a training day and every event is a training event.” ― James Pritchert"},{"quote":"“We do not need to attend classroom training programs for everything, our observation opens the windows of knowledge around us.” ― Sukant Ratnakar, Open the Windows: To the World Around You"},{"quote":"“Don't feel pity for those who will feel disappointed because you have scored! You were trained not to entertain a pity party but to excel in a winning game!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“We all have our unique careers that differ from one another, but the fact is that we must become \"teachers and learners\" at the end of it all! By the \"learning career\", we know what other people know; by the \"teaching career\", we make other people to know what we know!” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“My training makes me uneasy with a happy mystery.” ― Jonathan Rottenberg, The Depths: The Evolutionary Origins of the Depression Epidemic"},{"quote":"“Every one has strengths. Turn your strengths into competencies for your success and you are responsible for your success” ― Surendranath A"},{"quote":"“However, more important to all of that: the players played the game as a true team. There are many teams in baseball, but not all play as a team. Many merely play as a group of talented athletes, which is a huge difference over the course of a long season.” ― Michael Delaware, The Art of Sales Management: Lessons Learned on the Fly"},{"quote":"“The purpose of a spiritual discipline is to give us a way to stop the war, not by our force of will, but organically, through understanding an gradual training.” ― Jack Kornfield, A Path with Heart: A Guide Through the Perils and Promises of Spiritual Life"},{"quote":"“If you are setting a goal without understanding the reason for it, then maybe you should reevaluate the goal in general.” ― Dr. Stan Beecham"},{"quote":"“Training enables self-confidence. Self-confidence enhances self-esteem. Self-esteem ensures success adding value to organization” ― Surendranath A"},{"quote":"“As she ran, a memory uncurled in her mind and spread out before her and it felt like she was running into the memory.” ― J.C. Morrows, Taken"},{"quote":"“I don't think Tera is capable of working with you by her own choice, no matter how much grass you pull for her, no matter how much you brush her. I think she's more like ... a three or four-year-old child, and you are her mother. Mothers must be firm with their children, sometimes make them do what needs to be done, sometimes even punish them.” ― J.Z. Colby, Journey"},{"quote":"“It's iron that can sharpen iron; wood cannot do that.” ― Israelmore Ayivor, The Great Hand Book of Quotes"},{"quote":"“Running is a mental sport, more than anything else. You're only as good as your training, and your training is only as good as your thinking.” ― Lauren Oliver, Pandemonium"},{"quote":"“There is no easy way to train an apprentice. My two tools are example and nagging.” ― Lemony Snicket, Who Could That Be at This Hour?"},{"quote":"“I know it’s hard for you to allow yourself to feel this. You've gone so long training yourself to block the feelings and emotions out any time someone touches you.” ― Colleen Hoover, Hopeless"},{"quote":"“Motivation can't take you very far if you don't have the legs.” ― Lance Armstrong"},{"quote":"“Off the bike she was like a smoker without cigarettes, never sure what to do with her hands. As soon as she got off the bike, her heart was expected to perform all these baffling secondary functions like loving someone and feeling something and belonging somewhere - when all she'd ever trained it to do was pump blood.” ― Chris Cleave, Gold"},{"quote":"“They (teenage boys)don’t really listen to speeches or talks. They absorb incrementally, through hours and hours of observation.” ― Rob Lowe, Stories I Only Tell My Friends"},{"quote":"“I would rather have cookies in my jacket pockets than a chain around my dog's neck.” ― Pat Miller, The Power of Positive Dog Training"},{"quote":"“It takes a while for revelry to turn to reverence, and much repetition of truth to eventual turn young zeal into habitual channels for good.” ― Elisabeth Elliot, Shadow of the Almighty: The Life and Testament of Jim Elliot"},{"quote":"“Asleep you can experience many hours whilst only a few waking moments have passed. This is why dreams are an ideal platform for training.” ― Wayne Gerard Trotman, Veterans of the Psychic Wars"},{"quote":"“There is no 'eugenics' in Nietzsche - despite occasional references to 'breeding'- at least no more than is implicit in the recommendation to choose a partner under decent lightning conditions and with one's self-respect intact. Everything else falls under training, discipline, education and self-design - the Übermensch implies not a biological but an artistic, not to say an acrobatic programme. The only thought-provoking aspect of the marriage recommendation quoted above is the difference between onward and upward propagation. This coincides with a critique of mere repetition - obviously it will no longer suffice in future for children, as one says, to 'return' in their children. There may be a right to imperfection, but not to triviality.” ― Peter Sloterdijk, Du mußt dein Leben ändern"},{"quote":"“I'm the well-trained fruit tree. Full of well-trained feelings and abilities and all of them grafted onto me” ― Frank Herbert, Dune"},{"quote":"“Train up a child in the way he should go; even when he is old he will not depart from it.” ― C.M. Stunich, Losing Me, Finding You"},{"quote":"“The programme into which Cheryl was inducted combined all the different ways the intelligence community had learned could cause intense psychological change in adults and children. It had been learned through the use of both knowledgeable and 'unwitting' volunteers. They were subjected to sensory overload, isolation, drugs and hypnosis, all used on bodies that had been weakened from mild hunger. The horror of the programme was that it would be like having an elementary school sex education class conducted by a paedophile rapist. It would have been banned had the American government signed the Helsinki Accords. But, of course, they hadn't. For the test that day and in those that followed, Cheryl Hersha was positioned so she faced a portable movie screen. A 16mm movie projector was on a platform, along with several reels of film. Each was a short pornographic film meant to make her aware of sexuality in a variety of forms...” ― Cheryl Hersha, Secret Weapons: How Two Sisters Were Brainwashed to Kill for Their Country"},{"quote":"“There is more experience on the field of justification than on the camp of training. Sometimes, you got to take actions to learn more.” ― Israelmore Ayivor"},{"quote":"“Conditioning was something I always shied away from, now I've learnt that training never stops.” ― Mark O'Brien"},{"quote":"“Never Underestimate. Just as in any other negotiation, watching before acting is as important as listening before speaking. It's doubly important in China, however, where customs are time-honored and breaches of protocol not so quickly forgiven.” ― Irl M. Davis, An Entrepreneur in Asia: A Personal Journey of Global Proportions"},{"quote":"“The vast majority of funding in support of women appears to have been directed toward the training of women as participants in political, civil, and economic processes. This approach to women's empowerment is based on two assumptions. The first is that Iraqi women need training to bring them into the public sphere. . . . The second is that women, if equipped with appropriate skills, merely need encouragement to participate and flourish in public life. Such an approach does not consider the social and political context in which women operate and that undoubtedly affects their ability to participate.” ― Nadje Al-Ali, What Kind of Liberation?: Women and the Occupation of Iraq"},{"quote":"“PALATABLE CRITICISM: In a performance review, don't offer more than three criticisms. That's all an employee can digest.” ― Nancy Humphries"}]
